[
    {
        "ID": "WebQTrn-2867",
        "question": "where is amazon based out of",
        "comp_type": null,
        "answer": [
            "m.0d9jr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mgkg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mgkg ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.0mgkg))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Amazon.com ] ) )",
        "gold_entity_map": {
            "m.0mgkg": "Amazon.com"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2870",
        "question": "where did robert boyle study",
        "comp_type": null,
        "answer": [
            "m.0dzbl",
            "m.0ymf1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d98m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d98m ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0d98m))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Robert Boyle ] ) )",
        "gold_entity_map": {
            "m.0d98m": "Robert Boyle"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2871",
        "question": "what is there to see near the grand canyon",
        "comp_type": null,
        "answer": [
            "m.01z_xr",
            "m.0cnrr",
            "m.0d35y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cns5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cns5 ns:travel.tourist_attraction.near_travel_destination ?x .\n}\n",
        "sexpr": "(JOIN (R travel.tourist_attraction.near_travel_destination) m.0cns5)",
        "normed_sexpr": "( JOIN ( R [ travel , tourist attraction , near travel destination ] ) [ Grand Canyon ] )",
        "gold_entity_map": {
            "m.0cns5": "Grand Canyon"
        },
        "gold_relation_map": {
            "travel.tourist_attraction.near_travel_destination": "travel , tourist attraction , near travel destination"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2880",
        "question": "where was anne frank born",
        "comp_type": null,
        "answer": [
            "m.02z0j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d9rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d9rk ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.03d9rk)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Anne Frank ] )",
        "gold_entity_map": {
            "m.03d9rk": "Anne Frank"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2885",
        "question": "what are the kennedys",
        "comp_type": null,
        "answer": [
            "m.0150p7",
            "m.0194xc",
            "m.01kyns",
            "m.01n4xb",
            "m.01qlg1",
            "m.01w83z",
            "m.01x4d5",
            "m.01y603",
            "m.0202g7",
            "m.020t1x",
            "m.028qh_",
            "m.02f95t",
            "m.02frvc",
            "m.02frws",
            "m.02frx4",
            "m.02frxh",
            "m.02h40b",
            "m.02l5km",
            "m.02l87p",
            "m.02l88c",
            "m.02l8dg",
            "m.02shr7",
            "m.03tryx",
            "m.03ts1h",
            "m.03ts2x",
            "m.03ts5s",
            "m.04f1nm",
            "m.04f1qs",
            "m.04syk4",
            "m.06hx2",
            "m.07b5gj",
            "m.07ydlp5",
            "m.07ydlpp",
            "m.07ydlq2",
            "m.08w6qf",
            "m.0bt9c",
            "m.0d3k14"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fbrl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fbrl ns:people.family.members ?x .\n}\n",
        "sexpr": "(JOIN (R people.family.members) m.0fbrl)",
        "normed_sexpr": "( JOIN ( R [ people , family , members ] ) [ Kennedy family ] )",
        "gold_entity_map": {
            "m.0fbrl": "Kennedy family"
        },
        "gold_relation_map": {
            "people.family.members": "people , family , members"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2887",
        "question": "where is sarajevo located",
        "comp_type": null,
        "answer": [
            "m.0166b",
            "m.021yyx",
            "m.03g99x",
            "m.0gfgdgx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06n8j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06n8j ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.06n8j)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Sarajevo ] )",
        "gold_entity_map": {
            "m.06n8j": "Sarajevo"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2890",
        "question": "what teams are left in the nfl",
        "comp_type": null,
        "answer": [
            "m.01c_d",
            "m.01ct6",
            "m.01ddr_",
            "m.01ddrm",
            "m.01ddsc",
            "m.01ddsr",
            "m.01ddt3",
            "m.01jr_f",
            "m.01jr_s",
            "m.01jr9j",
            "m.01jrvs",
            "m.01jrw4",
            "m.01jrww",
            "m.01jrx6",
            "m.01jrxk",
            "m.01jryn",
            "m.01jrz0",
            "m.01jrzc",
            "m.01js03",
            "m.01js0h",
            "m.01js16",
            "m.01js1y",
            "m.01js31",
            "m.01js3f",
            "m.01js45",
            "m.01js4j",
            "m.01js4x",
            "m.01js5y",
            "m.01js6_",
            "m.01js68",
            "m.01js7b",
            "m.01js7p",
            "m.01js80",
            "m.01js8c",
            "m.01js8r",
            "m.01js9f",
            "m.01js9t",
            "m.01jsb4",
            "m.01jsbx",
            "m.01jsc8",
            "m.01jscm",
            "m.01xvb",
            "m.01y3c",
            "m.01y3v",
            "m.01y49",
            "m.025hfj",
            "m.025hfx",
            "m.02896",
            "m.0289q",
            "m.02c_4",
            "m.02n0s5",
            "m.030xrm",
            "m.03b3j",
            "m.03lsq",
            "m.03wnh",
            "m.043vc",
            "m.047mhnr",
            "m.0487_",
            "m.04nmxtk",
            "m.04vn5",
            "m.051q5",
            "m.05g3b",
            "m.05g3v",
            "m.05g49",
            "m.05gg4",
            "m.05l71",
            "m.05tfm",
            "m.05tg3",
            "m.060jft",
            "m.06f2k5d",
            "m.06hcqq",
            "m.06l_dbw",
            "m.06lxrxk",
            "m.06lxvwt",
            "m.06lycgb",
            "m.06lz35s",
            "m.06mp_z5",
            "m.06mp1hm",
            "m.06mp7tp",
            "m.06mpvs8",
            "m.06mpwv_",
            "m.06mq172",
            "m.06rny",
            "m.06rpd",
            "m.06rrsy3",
            "m.06rsr2m",
            "m.06rvwhv",
            "m.06tft9v",
            "m.06tm2c_",
            "m.06vw_65",
            "m.06vw_gf",
            "m.06vw_wb",
            "m.06vw_x7",
            "m.06vwxb3",
            "m.06vwxfc",
            "m.06vwxhp",
            "m.06vwxkr",
            "m.06vwxmr",
            "m.06vwzf5",
            "m.06vx04k",
            "m.06vx0jg",
            "m.06vx0vy",
            "m.06vx115",
            "m.06x76",
            "m.070xg",
            "m.0738cbk",
            "m.0738w43",
            "m.07l24",
            "m.07l2m",
            "m.07xmq9",
            "m.084l5",
            "m.0fb2wm",
            "m.0ws7",
            "m.0wsr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059yj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059yj ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_participation.team) (JOIN (R sports.sports_league.teams) m.059yj))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league participation , team ] ) ( JOIN ( R [ sports , sports league , teams ] ) [ National Football League ] ) )",
        "gold_entity_map": {
            "m.059yj": "National Football League"
        },
        "gold_relation_map": {
            "sports.sports_league.teams": "sports , sports league , teams",
            "sports.sports_league_participation.team": "sports , sports league participation , team"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2894",
        "question": "what are historical places in new york",
        "comp_type": null,
        "answer": [
            "m.013r41",
            "m.0163ff",
            "m.016p8t",
            "m.016xm_",
            "m.0179bc",
            "m.01kht3",
            "m.01lnd3",
            "m.01nbpn",
            "m.01nq4x",
            "m.01pdsd",
            "m.01pdy0",
            "m.01rs7b",
            "m.01rxnm",
            "m.01rz3c",
            "m.01s7jw",
            "m.01zmd",
            "m.0209mm",
            "m.020nlt",
            "m.021848",
            "m.023r9j",
            "m.026bmdr",
            "m.026kp2",
            "m.02cj9_",
            "m.02gyzc",
            "m.02nd_",
            "m.02nyg",
            "m.02vqw3",
            "m.02zrs",
            "m.037lpb",
            "m.03vgd_",
            "m.0426n1",
            "m.04jpg0f",
            "m.04k2zh",
            "m.051vm6",
            "m.05l9fg",
            "m.06qvwg",
            "m.06w5wh8",
            "m.072p8",
            "m.07jwwf",
            "m.07qdr",
            "m.09c7b",
            "m.09c7v",
            "m.0cjp7w",
            "m.0cv4c",
            "m.0dpk_",
            "m.0ds4dt3",
            "m.0fb18",
            "m.0gfhhy8",
            "m.0hhjk",
            "m.0hrg52m",
            "m.0j_66",
            "m.0mzkb",
            "m.0pnb8",
            "m.0q9h2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059rby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059rby ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.059rby)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ New York ] )",
        "gold_entity_map": {
            "m.059rby": "New York"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2896",
        "question": "what countries are included in the continent of asia",
        "comp_type": null,
        "answer": [
            "m.0161c",
            "m.0162b",
            "m.0167v",
            "m.016zwt",
            "m.01c4pv",
            "m.01crd5",
            "m.01xbgx",
            "m.01z215",
            "m.01z88t",
            "m.02lx0",
            "m.03__y",
            "m.03_3d",
            "m.03h64",
            "m.03rk0",
            "m.03ryn",
            "m.03shp",
            "m.03spz",
            "m.047lj",
            "m.047yc",
            "m.04hhv",
            "m.04hqz",
            "m.04thp",
            "m.04ty8",
            "m.04w8f",
            "m.04xn_",
            "m.05b7q",
            "m.05l8y",
            "m.05sb1",
            "m.05v8c",
            "m.0697s",
            "m.06f32",
            "m.06m_5",
            "m.06qd3",
            "m.06t2t",
            "m.06vbd",
            "m.07bxhl",
            "m.07dvs",
            "m.07f1x",
            "m.07t_x",
            "m.09pmkv",
            "m.0d05q4",
            "m.0d05w3",
            "m.0j1z8",
            "m.0jdd",
            "m.0jt3tjf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j0k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j0k ns:base.locations.continents.countries_within ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.continents.countries_within) m.0j0k)",
        "normed_sexpr": "( JOIN ( R [ base , locations , continents , countries within ] ) [ Asia ] )",
        "gold_entity_map": {
            "m.0j0k": "Asia"
        },
        "gold_relation_map": {
            "base.locations.continents.countries_within": "base , locations , continents , countries within"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2899",
        "question": "when did miami dolphins win super bowl",
        "comp_type": null,
        "answer": [
            "m.076nd",
            "m.076nr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04vn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04vn5 ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.04vn5)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Miami Dolphins ] )",
        "gold_entity_map": {
            "m.04vn5": "Miami Dolphins"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2900",
        "question": "what timezone is minnesota in",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ykg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ykg ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.04ykg)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Minnesota ] )",
        "gold_entity_map": {
            "m.04ykg": "Minnesota"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2903",
        "question": "what country columbus was born",
        "comp_type": null,
        "answer": [
            "m.03rjj"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.01pwz ns:people.person.place_of_birth ?y . # Christopher Columbus\n  ?y ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.01mp . # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01pwz": "Christopher Columbus",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-2904",
        "question": "where did lauren conrad live",
        "comp_type": null,
        "answer": [
            "m.030qb3t",
            "m.0d6lp",
            "m.0r2gj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dq9wx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dq9wx ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0dq9wx))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Lauren Conrad ] ) )",
        "gold_entity_map": {
            "m.0dq9wx": "Lauren Conrad"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2905",
        "question": "what bella name her baby",
        "comp_type": null,
        "answer": [
            "m.04gk8n0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027b7y9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027b7y9 ns:fictional_universe.fictional_character.children ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.children) m.027b7y9)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , children ] ) [ Bella Swan ] )",
        "gold_entity_map": {
            "m.027b7y9": "Bella Swan"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.children": "fictional universe , fictional character , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2906",
        "question": "what is the houston rockets mascot",
        "comp_type": null,
        "answer": [
            "m.02qmvfb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmfb ns:sports.sports_team.team_mascot ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.team_mascot) m.0jmfb)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , team mascot ] ) [ Houston Rockets ] )",
        "gold_entity_map": {
            "m.0jmfb": "Houston Rockets"
        },
        "gold_relation_map": {
            "sports.sports_team.team_mascot": "sports , sports team , team mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2909",
        "question": "where did matthias schleiden do his work",
        "comp_type": null,
        "answer": [
            "m.01fy2s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dd3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dd3q ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n",
        "sexpr": "(JOIN (R business.employment_tenure.company) (JOIN (R people.person.employment_history) m.0dd3q))",
        "normed_sexpr": "( JOIN ( R [ business , employment tenure , company ] ) ( JOIN ( R [ people , person , employment history ] ) [ Matthias Jakob Schleiden ] ) )",
        "gold_entity_map": {
            "m.0dd3q": "Matthias Jakob Schleiden"
        },
        "gold_relation_map": {
            "business.employment_tenure.company": "business , employment tenure , company",
            "people.person.employment_history": "people , person , employment history"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2911",
        "question": "what songs does katherine jenkins sing",
        "comp_type": null,
        "answer": [
            "m.0137q7dm",
            "m.019db6x",
            "m.0dt_k5d",
            "m.0dvc1_d",
            "m.0dwf0l4",
            "m.0dxcr7l",
            "m.0dxl9kt",
            "m.0f19nx0",
            "m.0f1d618",
            "m.0f27vgt",
            "m.0f6gq_w",
            "m.0fcnz2q",
            "m.0fd_qhr",
            "m.0nmjh_0",
            "m.0q6ycw3",
            "m.0qcgnh8",
            "m.0ztmg3",
            "m.0ztmgb",
            "m.0ztmhw",
            "m.0ztmj2",
            "m.0ztmj9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qrf09)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qrf09 ns:music.artist.track_contributions ?y .\n?y ns:music.track_contribution.track ?x .\n}\n",
        "sexpr": "(JOIN (R music.track_contribution.track) (JOIN (R music.artist.track_contributions) m.01qrf09))",
        "normed_sexpr": "( JOIN ( R [ music , track contribution , track ] ) ( JOIN ( R [ music , artist , track contributions ] ) [ Katherine Jenkins ] ) )",
        "gold_entity_map": {
            "m.01qrf09": "Katherine Jenkins"
        },
        "gold_relation_map": {
            "music.track_contribution.track": "music , track contribution , track",
            "music.artist.track_contributions": "music , artist , track contributions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2912",
        "question": "what is ryan seacrest famous for",
        "comp_type": null,
        "answer": [
            "m.015cjr",
            "m.01d_h8",
            "m.02hrh1q",
            "m.03gjzk",
            "m.08z956",
            "m.0cbd2",
            "m.0dxtg",
            "m.0dypbr",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02b9g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02b9g4 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02b9g4)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Ryan Seacrest ] )",
        "gold_entity_map": {
            "m.02b9g4": "Ryan Seacrest"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2915",
        "question": "what does george soros own",
        "comp_type": null,
        "answer": [
            "m.01xfs8",
            "m.01xfsm",
            "m.01xfsz",
            "m.0257nv",
            "m.026q3wk",
            "m.02x7ztl",
            "m.02y2n1",
            "m.03jqnf",
            "m.0412s5k",
            "m.043pjr5",
            "m.048h_7",
            "m.04g4w2y",
            "m.04lg6qs",
            "m.04nhs7",
            "m.064pprm",
            "m.0b77zy_",
            "m.0cmf161"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gyk6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gyk6w ns:organization.organization_founder.organizations_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization_founder.organizations_founded) m.0gyk6w)",
        "normed_sexpr": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ George Soros ] )",
        "gold_entity_map": {
            "m.0gyk6w": "George Soros"
        },
        "gold_relation_map": {
            "organization.organization_founder.organizations_founded": "organization , organization founder , organizations founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2919",
        "question": "what time zone is maryville tn",
        "comp_type": null,
        "answer": [
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_swz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_swz ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0_swz)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Maryville ] )",
        "gold_entity_map": {
            "m.0_swz": "Maryville"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2921",
        "question": "who started the federal reserve board",
        "comp_type": null,
        "answer": [
            "m.02yy8",
            "m.03gfcd",
            "m.05n2sf",
            "m.083q7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xmb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xmb ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.02xmb)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Federal Reserve System ] )",
        "gold_entity_map": {
            "m.02xmb": "Federal Reserve System"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2925",
        "question": "where was emperor tiberius born",
        "comp_type": null,
        "answer": [
            "m.06c62"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hz1 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.07hz1)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Tiberius ] )",
        "gold_entity_map": {
            "m.07hz1": "Tiberius"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2930",
        "question": "what movies did zoe saldana play in",
        "comp_type": null,
        "answer": [
            "m.010kk6fr",
            "m.012z22by",
            "m.01vksx",
            "m.02814fp",
            "m.028b4ys",
            "m.02rrh1w",
            "m.0322yj",
            "m.03mg8qr",
            "m.048qrd",
            "m.04f285v",
            "m.04j08s9",
            "m.04ycptv",
            "m.050jdw",
            "m.056p3k",
            "m.05ldk6",
            "m.05vnln",
            "m.05zrdxt",
            "m.07mqwn",
            "m.07yjndt",
            "m.08jml6",
            "m.08phg9",
            "m.0b6l1st",
            "m.0bth54",
            "m.0crwvd1",
            "m.0ddg_bs",
            "m.0g53spr",
            "m.0gmbk1g",
            "m.0gwqhhn",
            "m.0gxt36r",
            "m.0h37n51",
            "m.0hhqv27",
            "m.0j9pkrn",
            "m.0jwsfxg",
            "m.0ryw0v0",
            "m.0wbjb6l",
            "m.0ynxx40"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qg6g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qg6g ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.05qg6g))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Zoe Saldana ] ) )",
        "gold_entity_map": {
            "m.05qg6g": "Zoe Saldana"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2933",
        "question": "what does matt dallas do now",
        "comp_type": null,
        "answer": [
            "m.02hrh1q",
            "m.0d1pc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dfyw6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dfyw6 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0dfyw6)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Matt Dallas ] )",
        "gold_entity_map": {
            "m.0dfyw6": "Matt Dallas"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2934",
        "question": "where was abraham buried",
        "comp_type": null,
        "answer": [
            "m.0jxp0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pwb ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.0pwb)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Abraham ] )",
        "gold_entity_map": {
            "m.0pwb": "Abraham"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2937",
        "question": "where 's the hudson river",
        "comp_type": null,
        "answer": [
            "m.059g4",
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvyp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvyp ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0cvyp)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Hudson River ] )",
        "gold_entity_map": {
            "m.0cvyp": "Hudson River"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    }
]