[
    {
        "ID": "WebQTrn-797",
        "question": "when did mcdonalds officially open",
        "comp_type": null,
        "answer": [
            "1940-05-15"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gyp7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gyp7 ns:organization.organization.date_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.date_founded) m.07gyp7)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , date founded ] ) [ McDonald's ] )",
        "gold_entity_map": {
            "m.07gyp7": "McDonald's"
        },
        "gold_relation_map": {
            "organization.organization.date_founded": "organization , organization , date founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-800",
        "question": "where is lake waynoka ohio",
        "comp_type": null,
        "answer": [
            "m.09c7w0",
            "m.0n2sv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027_7y_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027_7y_ ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.027_7y_)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Lake Waynoka, Ohio ] )",
        "gold_entity_map": {
            "m.027_7y_": "Lake Waynoka, Ohio"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-804",
        "question": "who played emperor palpatine",
        "comp_type": null,
        "answer": [
            "m.03sj0m",
            "m.04f47_",
            "m.090_hs",
            "m.0gbz5p4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_5s0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_5s0 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.03_5s0))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ The Emperor ] ) )",
        "gold_entity_map": {
            "m.03_5s0": "The Emperor"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-811",
        "question": "what province is canada 's capital located in",
        "comp_type": null,
        "answer": [
            "m.05kr_"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.0d060g ns:location.country.capital ?y . # Canada\n  ?y ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.01nm . # Canadian Province\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0d060g": "Canada",
            "m.01nm": "Canadian Province"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital",
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01nm": "Canadian Province"
        }
    },
    {
        "ID": "WebQTrn-812",
        "question": "on which continent is the usa located",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09c7w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09c7w0 ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.09c7w0)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ United States of America ] )",
        "gold_entity_map": {
            "m.09c7w0": "United States of America"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-813",
        "question": "where is singapore on a world map",
        "comp_type": null,
        "answer": [
            "m.0j0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.06t2t)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Singapore ] )",
        "gold_entity_map": {
            "m.06t2t": "Singapore"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-817",
        "question": "what did bob ross die of",
        "comp_type": null,
        "answer": [
            "m.0jdk0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hv0w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hv0w ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.02hv0w)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Bob Ross ] )",
        "gold_entity_map": {
            "m.02hv0w": "Bob Ross"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-819",
        "question": "where did martin luther live in",
        "comp_type": null,
        "answer": [
            "m.044dng",
            "m.0577d",
            "m.0cz504",
            "m.0g8gq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yd_ ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.04yd_))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Martin Luther ] ) )",
        "gold_entity_map": {
            "m.04yd_": "Martin Luther"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-827",
        "question": "what did george eastman make",
        "comp_type": null,
        "answer": [
            "m.017zc4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gc5r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gc5r ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.0gc5r)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ George Eastman ] )",
        "gold_entity_map": {
            "m.0gc5r": "George Eastman"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-828",
        "question": "what movies has billy burke been in",
        "comp_type": null,
        "answer": [
            "m.026k37r",
            "m.02q0v8n",
            "m.02qh9tj",
            "m.02rdvz1",
            "m.02vl04p",
            "m.03__xl",
            "m.03nm_fh",
            "m.043p9_t",
            "m.04j07_v",
            "m.04j275n",
            "m.05pdh86",
            "m.06r6r_",
            "m.075wx7_",
            "m.075wx89",
            "m.0b_w5w",
            "m.0b6rpt",
            "m.0bh95g3",
            "m.0c241c_",
            "m.0c8nn5",
            "m.0crtvd_",
            "m.0djz0rc",
            "m.0fbqqp",
            "m.0fwgv9",
            "m.0g4fsqy",
            "m.0gm1fy3",
            "m.0gwsjv4",
            "m.0gxm2g6",
            "m.0h15vfr",
            "m.0h28ldr",
            "m.0h2hcbj",
            "m.0ll2vtl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fqv_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fqv_3 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0fqv_3))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Billy Burke ] ) )",
        "gold_entity_map": {
            "m.0fqv_3": "Billy Burke"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-829",
        "question": "who was rudolf virchow",
        "comp_type": null,
        "answer": [
            "m.03gq2jw",
            "m.05t4q",
            "m.06q2q",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.011kz4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.011kz4 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.011kz4)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Rudolf Virchow ] )",
        "gold_entity_map": {
            "m.011kz4": "Rudolf Virchow"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-837",
        "question": "where did jennifer hudson go to school",
        "comp_type": null,
        "answer": [
            "m.01lgjy",
            "m.09v6gkq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ktrs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ktrs ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.02ktrs))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jennifer Hudson ] ) )",
        "gold_entity_map": {
            "m.02ktrs": "Jennifer Hudson"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-839",
        "question": "when did toronto blue jays become a team",
        "comp_type": null,
        "answer": [
            "1977"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07l4z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07l4z ns:sports.sports_team.founded ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.founded) m.07l4z)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , founded ] ) [ Toronto Blue Jays ] )",
        "gold_entity_map": {
            "m.07l4z": "Toronto Blue Jays"
        },
        "gold_relation_map": {
            "sports.sports_team.founded": "sports , sports team , founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-840",
        "question": "what is the zip code for moorpark ca",
        "comp_type": null,
        "answer": [
            "m.01zjg2j",
            "m.07nq1bc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r87z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r87z ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0r87z)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Moorpark ] )",
        "gold_entity_map": {
            "m.0r87z": "Moorpark"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-845",
        "question": "what did mozart do to become famous",
        "comp_type": null,
        "answer": [
            "m.012vv0",
            "m.01c72t",
            "m.05vyk",
            "m.09jwl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082db)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082db ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.082db)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Wolfgang Amadeus Mozart ] )",
        "gold_entity_map": {
            "m.082db": "Wolfgang Amadeus Mozart"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-846",
        "question": "where was avril lavigne born",
        "comp_type": null,
        "answer": [
            "m.018dhx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0161c2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0161c2 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0161c2)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Avril Lavigne ] )",
        "gold_entity_map": {
            "m.0161c2": "Avril Lavigne"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-850",
        "question": "what county is tampa located in",
        "comp_type": null,
        "answer": [
            "m.0jj6k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0n1rj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0n1rj ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0n1rj)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Tampa ] )",
        "gold_entity_map": {
            "m.0n1rj": "Tampa"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-854",
        "question": "where are they now jessica mcclure",
        "comp_type": null,
        "answer": [
            "m.013n2h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_fvt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_fvt ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.01_fvt))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Jessica McClure ] ) )",
        "gold_entity_map": {
            "m.01_fvt": "Jessica McClure"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-860",
        "question": "what other cars does gm make",
        "comp_type": null,
        "answer": [
            "m.0_knrlq",
            "m.02_ty_",
            "m.02mz1s",
            "m.03h0wb",
            "m.03qyv",
            "m.056d3_",
            "m.05pv27x",
            "m.0blvz",
            "m.0dppm",
            "m.0h734p8",
            "m.0j68wwy",
            "m.0j6nb27",
            "m.0j726ql",
            "m.0j72pxm",
            "m.0xmf42g",
            "m.0xmqcwb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035nm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035nm ns:automotive.company.make_s ?x .\n?x ns:common.topic.notable_types ns:m.02ht342 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.02ht342) (JOIN (R automotive.company.make_s) m.035nm))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Automobile Make ] ) ( JOIN ( R [ automotive , company , make s ] ) [ General Motors ] ) )",
        "gold_entity_map": {
            "m.035nm": "General Motors",
            "m.02ht342": "Automobile Make"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "automotive.company.make_s": "automotive , company , make s"
        },
        "gold_type_map": {
            "m.02ht342": "Automobile Make"
        }
    },
    {
        "ID": "WebQTrn-862",
        "question": "what movies does leo howard play in",
        "comp_type": null,
        "answer": [
            "m.03qcfvw",
            "m.05qpqj6",
            "m.07k983r",
            "m.0807n3z",
            "m.0bhc5kw",
            "m.0crrk72"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sqlp_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sqlp_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.05sqlp_))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Leo Howard ] ) )",
        "gold_entity_map": {
            "m.05sqlp_": "Leo Howard"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-863",
        "question": "what instruments does john williams use",
        "comp_type": null,
        "answer": [
            "m.0342h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0146pz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0146pz ns:music.group_member.instruments_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_member.instruments_played) m.0146pz)",
        "normed_sexpr": "( JOIN ( R [ music , group member , instruments played ] ) [ John Williams ] )",
        "gold_entity_map": {
            "m.0146pz": "John Williams"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-870",
        "question": "what was the milwaukee brewers old name",
        "comp_type": null,
        "answer": [
            "m.0fq2vj2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051vz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051vz ns:sports.sports_team.previously_known_as ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.previously_known_as) m.051vz)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , previously known as ] ) [ Milwaukee Brewers ] )",
        "gold_entity_map": {
            "m.051vz": "Milwaukee Brewers"
        },
        "gold_relation_map": {
            "sports.sports_team.previously_known_as": "sports , sports team , previously known as"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-873",
        "question": "what airport is in kauai hawaii",
        "comp_type": null,
        "answer": [
            "m.0_rq2",
            "m.01n5fw",
            "m.01r3l2",
            "m.02k5j7",
            "m.0398q8",
            "m.0398qm",
            "m.0398qz",
            "m.0398r_",
            "m.0398r9",
            "m.0398rn",
            "m.0398sb",
            "m.0398sq",
            "m.039g2f",
            "m.039ggn",
            "m.039ghr",
            "m.03cybt3",
            "m.03gddb",
            "m.07kd9xk",
            "m.08jyt_",
            "m.09gkgdn",
            "m.0hhhg6t",
            "m.0s059"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014wxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014wxc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01xpjyz .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01xpjyz) (JOIN (R location.location.contains) m.014wxc))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Airport ] ) ( JOIN ( R [ location , location , contains ] ) [ Hawaiian Islands ] ) )",
        "gold_entity_map": {
            "m.01xpjyz": "Airport",
            "m.014wxc": "Hawaiian Islands"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01xpjyz": "Airport"
        }
    },
    {
        "ID": "WebQTrn-883",
        "question": "what teams has lionel messi played for",
        "comp_type": null,
        "answer": [
            "m.0276tq4",
            "m.02bh_v",
            "m.096cw_",
            "m.0hvgt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06qjgc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06qjgc ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.06qjgc))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Lionel Messi ] ) )",
        "gold_entity_map": {
            "m.06qjgc": "Lionel Messi"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-884",
        "question": "what countries in north america continent",
        "comp_type": null,
        "answer": [
            "m.0160w",
            "m.0162v",
            "m.0164b",
            "m.01p8s",
            "m.027nb",
            "m.027rn",
            "m.02k8k",
            "m.03_r3",
            "m.0345_",
            "m.035yg",
            "m.03gyl",
            "m.03h2c",
            "m.05c74",
            "m.05qx1",
            "m.06ryl",
            "m.06s0l",
            "m.06s6l",
            "m.09c7w0",
            "m.09lxtg",
            "m.0b90_r",
            "m.0d04z6",
            "m.0d060g",
            "m.0l3h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059g4 ns:base.locations.continents.countries_within ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.continents.countries_within) m.059g4)",
        "normed_sexpr": "( JOIN ( R [ base , locations , continents , countries within ] ) [ North America ] )",
        "gold_entity_map": {
            "m.059g4": "North America"
        },
        "gold_relation_map": {
            "base.locations.continents.countries_within": "base , locations , continents , countries within"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-885",
        "question": "what time zone is colorado springs co",
        "comp_type": null,
        "answer": [
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.01vsl)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Colorado Springs ] )",
        "gold_entity_map": {
            "m.01vsl": "Colorado Springs"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-886",
        "question": "what school did sergio romo go to",
        "comp_type": null,
        "answer": [
            "m.02hscq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04cyz8g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04cyz8g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.04cyz8g))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Sergio Romo ] ) )",
        "gold_entity_map": {
            "m.04cyz8g": "Sergio Romo"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-889",
        "question": "who play luke skywalker",
        "comp_type": null,
        "answer": [
            "m.0154d7",
            "m.07l4yc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1bg ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0f1bg))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Luke Skywalker ] ) )",
        "gold_entity_map": {
            "m.0f1bg": "Luke Skywalker"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-891",
        "question": "where did john howard live",
        "comp_type": null,
        "answer": [
            "m.06y57"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chh05)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chh05 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0chh05))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ John Howard ] ) )",
        "gold_entity_map": {
            "m.0chh05": "John Howard"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-893",
        "question": "what does the name rome mean",
        "comp_type": null,
        "answer": [
            "m.0ghqr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c62 ns:symbols.namesake.named_after ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.namesake.named_after) m.06c62)",
        "normed_sexpr": "( JOIN ( R [ symbols , namesake , named after ] ) [ Rome ] )",
        "gold_entity_map": {
            "m.06c62": "Rome"
        },
        "gold_relation_map": {
            "symbols.namesake.named_after": "symbols , namesake , named after"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-894",
        "question": "what inspired scott fitzgerald",
        "comp_type": null,
        "answer": [
            "m.0154x6",
            "m.023jy9",
            "m.0249ld",
            "m.03p_bz",
            "m.040dxk",
            "m.0465_",
            "m.05nj0",
            "m.07g2b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zjd ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.02zjd)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ F. Scott Fitzgerald ] )",
        "gold_entity_map": {
            "m.02zjd": "F. Scott Fitzgerald"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    }
]