[
    {
        "ID": "WebQTrn-3106",
        "question": "who played lt uhura",
        "comp_type": null,
        "answer": [
            "m.012gl8",
            "m.05qg6g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012gkt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012gkt ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.012gkt))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Uhura ] ) )",
        "gold_entity_map": {
            "m.012gkt": "Uhura"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3111",
        "question": "where is the french alps located",
        "comp_type": null,
        "answer": [
            "m.0f8l9c",
            "m.0lcd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03tmzj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03tmzj ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.03tmzj)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ French Alps ] )",
        "gold_entity_map": {
            "m.03tmzj": "French Alps"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3112",
        "question": "what year was peyton manning 's rookie year",
        "comp_type": null,
        "answer": [
            "m.09gmwc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027jv8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027jv8 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.027jv8))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Peyton Manning ] ) )",
        "gold_entity_map": {
            "m.027jv8": "Peyton Manning"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3122",
        "question": "what kind of guitar does lindsey buckingham play",
        "comp_type": null,
        "answer": [
            "m.018vs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.094wr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.094wr ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.0342h .\n}\n",
        "sexpr": "(AND (JOIN music.instrument.family m.0342h) (JOIN (R music.group_member.instruments_played) m.094wr))",
        "normed_sexpr": "( AND ( JOIN [ music , instrument , family ] [ Guitar ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Lindsey Buckingham ] ) )",
        "gold_entity_map": {
            "m.0342h": "Guitar",
            "m.094wr": "Lindsey Buckingham"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played",
            "music.instrument.family": "music , instrument , family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3123",
        "question": "what college did joe namath attend",
        "comp_type": null,
        "answer": [
            "m.01wdl3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p_3k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p_3k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.01p_3k))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Joe Namath ] ) )",
        "gold_entity_map": {
            "m.01p_3k": "Joe Namath"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3127",
        "question": "what county is duluth minnesota in",
        "comp_type": null,
        "answer": [
            "m.0nh1v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h1k6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h1k6 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0h1k6)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Duluth ] )",
        "gold_entity_map": {
            "m.0h1k6": "Duluth"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3130",
        "question": "what did andrew johnson die from",
        "comp_type": null,
        "answer": [
            "m.02y0js"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rmg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rmg ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0rmg)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Andrew Johnson ] )",
        "gold_entity_map": {
            "m.0rmg": "Andrew Johnson"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3133",
        "question": "what is janelle monae famous for",
        "comp_type": null,
        "answer": [
            "m.016z4k",
            "m.01c72t",
            "m.01xr66",
            "m.02h6p92",
            "m.09jwl",
            "m.09l65",
            "m.0d1pc",
            "m.0dz3r",
            "m.0fq0t_c",
            "m.0n1h",
            "m.0nbcg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gktwr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gktwr ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0gktwr)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Janelle Monae ] )",
        "gold_entity_map": {
            "m.0gktwr": "Janelle Monae"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3134",
        "question": "what continent is mexico located on",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b90_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b90_r ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0b90_r)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Mexico ] )",
        "gold_entity_map": {
            "m.0b90_r": "Mexico"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3137",
        "question": "what does time warner own",
        "comp_type": null,
        "answer": [
            "m.09c2xk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0l8sx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0l8sx ns:broadcast.tv_station_owner.tv_stations ?x .\n}\n",
        "sexpr": "(JOIN (R broadcast.tv_station_owner.tv_stations) m.0l8sx)",
        "normed_sexpr": "( JOIN ( R [ broadcast , tv station owner , tv stations ] ) [ Time Warner ] )",
        "gold_entity_map": {
            "m.0l8sx": "Time Warner"
        },
        "gold_relation_map": {
            "broadcast.tv_station_owner.tv_stations": "broadcast , tv station owner , tv stations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3141",
        "question": "where was anne hathaway born",
        "comp_type": null,
        "answer": [
            "m.0cr3d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vntj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vntj ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02vntj)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Anne Hathaway ] )",
        "gold_entity_map": {
            "m.02vntj": "Anne Hathaway"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3145",
        "question": "who started twa airlines",
        "comp_type": null,
        "answer": [
            "m.03n93"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013w80)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013w80 ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.013w80)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Trans World Airlines ] )",
        "gold_entity_map": {
            "m.013w80": "Trans World Airlines"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3146",
        "question": "what are the two dialects of chinese",
        "comp_type": null,
        "answer": [
            "m.0653m",
            "m.0bpygy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r2l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r2l ns:language.human_language.dialects ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.dialects) m.01r2l)",
        "normed_sexpr": "( JOIN ( R [ language , human language , dialects ] ) [ Chinese language ] )",
        "gold_entity_map": {
            "m.01r2l": "Chinese language"
        },
        "gold_relation_map": {
            "language.human_language.dialects": "language , human language , dialects"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3148",
        "question": "where is washington dc located what state",
        "comp_type": null,
        "answer": [],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  FILTER (?x != ns:m.0rh6k)\n  ns:m.0rh6k ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.0kpys4 . # US State\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0rh6k": "Washington, D.C.",
            "m.0kpys4": "US State"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.0kpys4": "US State"
        }
    },
    {
        "ID": "WebQTrn-3150",
        "question": "what state in chicago in",
        "comp_type": null,
        "answer": [
            "m.03v0t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:base.biblioness.bibs_location.state ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.state) m.01_d4)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , state ] ) [ Chicago ] )",
        "gold_entity_map": {
            "m.01_d4": "Chicago"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.state": "base , biblioness , bibs location , state"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3152",
        "question": "who wrote luke bryan 's drunk on you",
        "comp_type": null,
        "answer": [
            "m.02qk17r",
            "m.05chlcv",
            "m.05cxfgy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j625w_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j625w_ ns:music.composition.composer ?x .\n}\n",
        "sexpr": "(JOIN (R music.composition.composer) m.0j625w_)",
        "normed_sexpr": "( JOIN ( R [ music , composition , composer ] ) [ Drunk on You ] )",
        "gold_entity_map": {
            "m.0j625w_": "Drunk on You"
        },
        "gold_relation_map": {
            "music.composition.composer": "music , composition , composer"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3158",
        "question": "what boudicca do",
        "comp_type": null,
        "answer": [
            "m.02h77nv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fz6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fz6 ns:common.topic.notable_types ?x .\n}\n",
        "sexpr": "(JOIN (R common.topic.notable_types) m.01fz6)",
        "normed_sexpr": "( JOIN ( R [ common , topic , notable types ] ) [ Boudica ] )",
        "gold_entity_map": {
            "m.01fz6": "Boudica"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3161",
        "question": "where did sir john a macdonald die",
        "comp_type": null,
        "answer": [
            "m.05ksh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041rh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041rh ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.041rh)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ John A. Macdonald ] )",
        "gold_entity_map": {
            "m.041rh": "John A. Macdonald"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3166",
        "question": "what is south korea 's capital city",
        "comp_type": null,
        "answer": [
            "m.0hsqf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06qd3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06qd3 ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.06qd3)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ South Korea ] )",
        "gold_entity_map": {
            "m.06qd3": "South Korea"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3169",
        "question": "what is the currency in the republic of congo",
        "comp_type": null,
        "answer": [
            "m.025sw2b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01rxw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01rxw ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.01rxw)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Congo ] )",
        "gold_entity_map": {
            "m.01rxw": "Congo"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3172",
        "question": "what country did giovanni da verrazano represent",
        "comp_type": null,
        "answer": [
            "m.03rjj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6d2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6d2 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.0k6d2)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Giovanni da Verrazzano ] )",
        "gold_entity_map": {
            "m.0k6d2": "Giovanni da Verrazzano"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3173",
        "question": "when was saint nicholas died",
        "comp_type": null,
        "answer": [
            "0343-12-06"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9q7 ns:people.deceased_person.date_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.date_of_death) m.0f9q7)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , date of death ] ) [ Saint Nicholas ] )",
        "gold_entity_map": {
            "m.0f9q7": "Saint Nicholas"
        },
        "gold_relation_map": {
            "people.deceased_person.date_of_death": "people , deceased person , date of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3175",
        "question": "what city is the jacksonville jaguars from",
        "comp_type": null,
        "answer": [
            "m.0ggh3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043vc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043vc ns:sports.sports_team.location ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.location) m.043vc)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , location ] ) [ Jacksonville Jaguars ] )",
        "gold_entity_map": {
            "m.043vc": "Jacksonville Jaguars"
        },
        "gold_relation_map": {
            "sports.sports_team.location": "sports , sports team , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3177",
        "question": "where is the time zone in florida",
        "comp_type": null,
        "answer": [
            "m.02_37z",
            "m.02fqwt",
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xry ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.02xry)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Florida ] )",
        "gold_entity_map": {
            "m.02xry": "Florida"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3179",
        "question": "what county is clearwater fl in",
        "comp_type": null,
        "answer": [
            "m.0jxgx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rqyx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rqyx ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0rqyx)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Clearwater ] )",
        "gold_entity_map": {
            "m.0rqyx": "Clearwater"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3183",
        "question": "what is the laguna beach theme song",
        "comp_type": null,
        "answer": [
            "m.07fprn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.048wfw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.048wfw ns:tv.tv_program.theme_song ?x .\n}\n",
        "sexpr": "(JOIN (R tv.tv_program.theme_song) m.048wfw)",
        "normed_sexpr": "( JOIN ( R [ tv , tv program , theme song ] ) [ Laguna Beach: The Real Orange County ] )",
        "gold_entity_map": {
            "m.048wfw": "Laguna Beach: The Real Orange County"
        },
        "gold_relation_map": {
            "tv.tv_program.theme_song": "tv , tv program , theme song"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3185",
        "question": "what is thomas edison 's most famous for",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.01d_h8",
            "m.02jknp",
            "m.03sbb",
            "m.06q2q",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07bty)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07bty ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.07bty)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Thomas Edison ] )",
        "gold_entity_map": {
            "m.07bty": "Thomas Edison"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3186",
        "question": "what does jennifer lopez do",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.015cjr",
            "m.0164xg",
            "m.01d_h8",
            "m.02h6n_q",
            "m.02h6nmf",
            "m.02h6p92",
            "m.02hqyhw",
            "m.02hrh1q",
            "m.03gjzk",
            "m.043tvhw",
            "m.04l1gwb",
            "m.064xm0",
            "m.09l65",
            "m.09x_r",
            "m.0dz3r",
            "m.0nbcg",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043zg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043zg ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.043zg)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Jennifer Lopez ] )",
        "gold_entity_map": {
            "m.043zg": "Jennifer Lopez"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3187",
        "question": "what country was dmitri mendeleev born",
        "comp_type": null,
        "answer": [
            "m.06bnz"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.0gglj ns:people.person.place_of_birth ?y . # Dmitri Mendeleev\n  ?y ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.01mp . # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.0gglj": "Dmitri Mendeleev"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-3189",
        "question": "what is the capital city of west germany",
        "comp_type": null,
        "answer": [
            "m.0150n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082fr ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.082fr)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ West Germany ] )",
        "gold_entity_map": {
            "m.082fr": "West Germany"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3191",
        "question": "when did herman cain run for president",
        "comp_type": null,
        "answer": [
            "m.0g5q039"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05972y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05972y ns:government.politician.election_campaigns ?x .\n}\n",
        "sexpr": "(JOIN (R government.politician.election_campaigns) m.05972y)",
        "normed_sexpr": "( JOIN ( R [ government , politician , election campaigns ] ) [ Herman Cain ] )",
        "gold_entity_map": {
            "m.05972y": "Herman Cain"
        },
        "gold_relation_map": {
            "government.politician.election_campaigns": "government , politician , election campaigns"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3198",
        "question": "what movies has selena gomez starred in",
        "comp_type": null,
        "answer": [
            "g.11b6y9tkn4",
            "g.11b7k0v3hq",
            "m.0118fw_v",
            "m.025s1wg",
            "m.026ykxv",
            "m.03h2kkl",
            "m.03y7209",
            "m.05mxz8m",
            "m.05zs3tp",
            "m.064qvcw",
            "m.07kb79v",
            "m.07xgs84",
            "m.0cr_ypd",
            "m.0d8n8lx",
            "m.0ds5_72",
            "m.0fk25m",
            "m.0gj96ln",
            "m.0hr256b",
            "m.0j_5r7f",
            "m.0jt0y88",
            "m.0jt6hrm",
            "m.0nfcm4h",
            "m.0nfvql0",
            "m.0vpj6d0",
            "m.0w03mr4",
            "m.0w03ph7",
            "m.0w03qlw",
            "m.0w03r9y",
            "m.0ydw9bg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0gs6vr))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Selena Gomez ] ) )",
        "gold_entity_map": {
            "m.0gs6vr": "Selena Gomez"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3206",
        "question": "what movies has angelina jolie in",
        "comp_type": null,
        "answer": [
            "m.011q46b6",
            "m.01n4z6",
            "m.01qbg5",
            "m.01xbxn",
            "m.0279ltv",
            "m.0287477",
            "m.0292qb",
            "m.02qr69m",
            "m.02vjp3",
            "m.02z9fb",
            "m.03b92p",
            "m.03ljpk",
            "m.03nfc4",
            "m.03qcvl",
            "m.03z9585",
            "m.049mql",
            "m.04dr_8_",
            "m.04j1wmp",
            "m.04lhqsh",
            "m.04z92b",
            "m.05pbl56",
            "m.05ppy",
            "m.05sns6",
            "m.06fwns",
            "m.06ztvyx",
            "m.07nxnw",
            "m.07nxvj",
            "m.089c83",
            "m.09146g",
            "m.098s2w",
            "m.09hj66",
            "m.09wwx0",
            "m.0bhj5f",
            "m.0bnx59",
            "m.0by4yw",
            "m.0by4zy",
            "m.0c03gcc",
            "m.0d6_s",
            "m.0fgm_l",
            "m.0fq0q4y",
            "m.0gd1d1",
            "m.0gg285",
            "m.0gwssc4",
            "m.0gwssls",
            "m.0gwssm9",
            "m.0hr6gzw",
            "m.0k0tq97",
            "m.0w17ngp",
            "m.0xnl4mm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f4vbz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f4vbz ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0f4vbz))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Angelina Jolie ] ) )",
        "gold_entity_map": {
            "m.0f4vbz": "Angelina Jolie"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    }
]