[
    {
        "ID": "WebQTrn-1568",
        "question": "where was the battle of verdun held",
        "comp_type": null,
        "answer": [
            "m.0ny95"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl4g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl4g ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0dl4g)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of Verdun ] )",
        "gold_entity_map": {
            "m.0dl4g": "Battle of Verdun"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1575",
        "question": "what religion is king henry viii",
        "comp_type": null,
        "answer": [
            "m.01spm",
            "m.0c8wxp",
            "m.0g9vs",
            "m.0n2g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03p77)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03p77 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.03p77)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Henry VIII of England ] )",
        "gold_entity_map": {
            "m.03p77": "Henry VIII of England"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1577",
        "question": "where did james baldwin go to school",
        "comp_type": null,
        "answer": [
            "m.06thjt",
            "m.09r4xx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017_pb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017_pb ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.017_pb))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ James Baldwin ] ) )",
        "gold_entity_map": {
            "m.017_pb": "James Baldwin"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1578",
        "question": "who was joseph pulitzer and what did he do",
        "comp_type": null,
        "answer": [
            "m.02h668d",
            "m.04gc2",
            "m.0d8qb",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019541)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019541 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.019541)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Joseph Pulitzer ] )",
        "gold_entity_map": {
            "m.019541": "Joseph Pulitzer"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1580",
        "question": "where did jane austen grow up",
        "comp_type": null,
        "answer": [
            "m.06ybhf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040dv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040dv ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.040dv)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jane Austen ] )",
        "gold_entity_map": {
            "m.040dv": "Jane Austen"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1581",
        "question": "what was basketball player michael jordan 's major in college",
        "comp_type": null,
        "answer": [
            "m.07xc_j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.major_field_of_study) (JOIN (R people.person.education) m.054c1))",
        "normed_sexpr": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Michael Jordan ] ) )",
        "gold_entity_map": {
            "m.054c1": "Michael Jordan"
        },
        "gold_relation_map": {
            "people.person.education": "people , person , education",
            "education.education.major_field_of_study": "education , education , major field of study"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1582",
        "question": "who made the american red cross",
        "comp_type": null,
        "answer": [
            "m.0bww9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0by8vb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0by8vb ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.0by8vb)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ American Red Cross ] )",
        "gold_entity_map": {
            "m.0by8vb": "American Red Cross"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1585",
        "question": "what did newton discover or invent",
        "comp_type": null,
        "answer": [
            "m.01kffn",
            "m.01nhc9",
            "m.079vqm"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\t{ \n\t  ns:m.03s9v ns:base.argumentmaps.innovator.original_ideas ?x .\n\t}\n\tUNION\n\t{\n\t  ns:m.03s9v ns:law.inventor.inventions ?x .\n\t}\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.03s9v": "Isaac Newton"
        },
        "gold_relation_map": {
            "base.argumentmaps.innovator.original_ideas": "base , argumentmaps , innovator , original ideas",
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1586",
        "question": "who played daniel larusso",
        "comp_type": null,
        "answer": [
            "m.02rv8m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fvbly3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fvbly3 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0fvbly3))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Daniel Larusso ] ) )",
        "gold_entity_map": {
            "m.0fvbly3": "Daniel Larusso"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1587",
        "question": "what happened to umaga wwe",
        "comp_type": null,
        "answer": [
            "m.0gk4g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03s95m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03s95m ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.03s95m)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Umaga ] )",
        "gold_entity_map": {
            "m.03s95m": "Umaga"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1591",
        "question": "what movies did jj abrams direct",
        "comp_type": null,
        "answer": [
            "m.05zysr7",
            "m.06fqlk",
            "m.08phg9",
            "m.0bwfwpj",
            "m.0hhqv27",
            "m.0nb2r_p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xndd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xndd ns:film.director.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.director.film) m.01xndd)",
        "normed_sexpr": "( JOIN ( R [ film , director , film ] ) [ J.J. Abrams ] )",
        "gold_entity_map": {
            "m.01xndd": "J.J. Abrams"
        },
        "gold_relation_map": {
            "film.director.film": "film , director , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1594",
        "question": "what two countries speak italian",
        "comp_type": null,
        "answer": [
            "m.03rjj",
            "m.06t8v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02bjrlw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02bjrlw ns:language.human_language.main_country ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.main_country) m.02bjrlw)",
        "normed_sexpr": "( JOIN ( R [ language , human language , main country ] ) [ Italian Language ] )",
        "gold_entity_map": {
            "m.02bjrlw": "Italian Language"
        },
        "gold_relation_map": {
            "language.human_language.main_country": "language , human language , main country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1598",
        "question": "where did macho camacho got shot at",
        "comp_type": null,
        "answer": [
            "m.0fw4v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lxcw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lxcw ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.0lxcw)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Héctor Camacho ] )",
        "gold_entity_map": {
            "m.0lxcw": "Héctor Camacho"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1601",
        "question": "who is andrew carnegie and what did he do",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.025spv",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vdk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vdk ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0vdk)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Andrew Carnegie ] )",
        "gold_entity_map": {
            "m.0vdk": "Andrew Carnegie"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1602",
        "question": "who plays lorne on angel",
        "comp_type": null,
        "answer": [
            "m.01vq3nl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03466b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03466b ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.03466b))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Lorne ] ) )",
        "gold_entity_map": {
            "m.03466b": "Lorne"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1604",
        "question": "what influenced abraham lincoln to become president",
        "comp_type": null,
        "answer": [
            "m.027549",
            "m.07kwl",
            "m.0ct18"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.0gzh)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Abraham Lincoln ] )",
        "gold_entity_map": {
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1605",
        "question": "who is jeremy sumpter",
        "comp_type": null,
        "answer": [
            "m.02hrh1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024xw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024xw1 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.024xw1)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Jeremy Sumpter ] )",
        "gold_entity_map": {
            "m.024xw1": "Jeremy Sumpter"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1612",
        "question": "what country was vasco nunez de balboa born in",
        "comp_type": null,
        "answer": [
            "m.06mkj"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.0cl9qq ns:people.person.place_of_birth ?y . # Vasco Núñez de Balboa\n  ?y ns:location.location.containedby ?x . \n  ?x ns:common.topic.notable_types ns:m.01mp .   # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.0cl9qq": "Vasco Núñez de Balboa"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-1614",
        "question": "where was san gabriel arcangel located",
        "comp_type": null,
        "answer": [
            "m.01n7q",
            "m.0r0xb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g8r5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g8r5 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0g8r5)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Mission San Gabriel Arcángel ] )",
        "gold_entity_map": {
            "m.0g8r5": "Mission San Gabriel Arcángel"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1615",
        "question": "who was the emperor before nero",
        "comp_type": null,
        "answer": [
            "m.01v34"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fc1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fc1 ns:user.robert.roman_empire.roman_emperor.prececessor ?x .\n}\n",
        "sexpr": "(JOIN (R user.robert.roman_empire.roman_emperor.prececessor) m.05fc1)",
        "normed_sexpr": "( JOIN ( R [ user , robert , roman empire , roman emperor , prececessor ] ) [ Nero ] )",
        "gold_entity_map": {
            "m.05fc1": "Nero"
        },
        "gold_relation_map": {
            "user.robert.roman_empire.roman_emperor.prececessor": "user , robert , roman empire , roman emperor , prececessor"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1617",
        "question": "what is gibby 's mom 's name",
        "comp_type": null,
        "answer": [
            "m.0j6c612"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07wy5s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07wy5s ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.parents) m.07wy5s))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Gibby Haynes ] ) )",
        "gold_entity_map": {
            "m.02zsn": "Female",
            "m.07wy5s": "Gibby Haynes"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1618",
        "question": "what type of music does ella fitzgerald sing",
        "comp_type": null,
        "answer": [
            "m.0155w",
            "m.015y_n",
            "m.01gjw",
            "m.03_d0",
            "m.08lpkq",
            "m.0cx6f",
            "m.0m40d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d9xq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d9xq ns:music.artist.genre ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.genre) m.0d9xq)",
        "normed_sexpr": "( JOIN ( R [ music , artist , genre ] ) [ Ella Fitzgerald ] )",
        "gold_entity_map": {
            "m.0d9xq": "Ella Fitzgerald"
        },
        "gold_relation_map": {
            "music.artist.genre": "music , artist , genre"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1621",
        "question": "what movies are directed by steven spielberg",
        "comp_type": null,
        "answer": [
            "m.011v6djn",
            "m.011wtv",
            "m.011xg5",
            "m.012mrr",
            "m.0130x37n",
            "m.01flv_",
            "m.01l5j2",
            "m.025rvx0",
            "m.0260bz",
            "m.0295sy",
            "m.02mmwk",
            "m.02rb84n",
            "m.02rml0k",
            "m.02rrfdw",
            "m.02ww_d1",
            "m.0315rp",
            "m.0322yj",
            "m.03gtd4",
            "m.04mcw4",
            "m.04sh80",
            "m.04t6fk",
            "m.05k8zz",
            "m.05p8qvv",
            "m.07024",
            "m.072x7s",
            "m.08xvpn",
            "m.0cc5qkt",
            "m.0f4yh",
            "m.0fgrln",
            "m.0fq8jmb",
            "m.0gmgwnv",
            "m.0h_b6x1",
            "m.0hfzr",
            "m.0hhghzl",
            "m.0hx4y",
            "m.0jqn5",
            "m.0jyb4",
            "m.0k_9j",
            "m.0kv8sl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06pj8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06pj8 ns:film.director.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.director.film) m.06pj8)",
        "normed_sexpr": "( JOIN ( R [ film , director , film ] ) [ Steven Spielberg ] )",
        "gold_entity_map": {
            "m.06pj8": "Steven Spielberg"
        },
        "gold_relation_map": {
            "film.director.film": "film , director , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1622",
        "question": "what instrument does mike huckabee play",
        "comp_type": null,
        "answer": [
            "m.018vs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01rxqd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01rxqd ns:music.group_member.instruments_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_member.instruments_played) m.01rxqd)",
        "normed_sexpr": "( JOIN ( R [ music , group member , instruments played ] ) [ Mike Huckabee ] )",
        "gold_entity_map": {
            "m.01rxqd": "Mike Huckabee"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1624",
        "question": "where is basque located",
        "comp_type": null,
        "answer": [
            "m.06mkj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dwvx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dwvx1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_parent) m.0dwvx1)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Basque Country ] )",
        "gold_entity_map": {
            "m.0dwvx1": "Basque Country"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_parent": "base , aareas , schema , administrative area , administrative parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1625",
        "question": "what movies does alyson stoner play in",
        "comp_type": null,
        "answer": [
            "m.01yzvd",
            "m.026k503",
            "m.02bqvs",
            "m.02w4by3",
            "m.047f43s",
            "m.04crzpz",
            "m.064016d",
            "m.066b_n",
            "m.080b54x",
            "m.09v9fw5",
            "m.0b73wst",
            "m.0bh9n8g",
            "m.0bnns7",
            "m.0by1x51",
            "m.0gj8r0x",
            "m.0gky0pl",
            "m.0wq4q7j",
            "m.0ztfxbv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02bwjv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02bwjv ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.02bwjv))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Alyson Stoner ] ) )",
        "gold_entity_map": {
            "m.02bwjv": "Alyson Stoner"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1628",
        "question": "what region is czech republic in",
        "comp_type": null,
        "answer": [
            "m.01lkr",
            "m.02j9z",
            "m.02qkt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mjq ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01mjq)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Czech Republic ] )",
        "gold_entity_map": {
            "m.01mjq": "Czech Republic"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1632",
        "question": "what to see in staten island new york",
        "comp_type": null,
        "answer": [
            "m.01q6lq",
            "m.02r7jcf",
            "m.02z0qbn",
            "m.02zt_l",
            "m.02zw2b",
            "m.04jd3v3",
            "m.04n4tlq",
            "m.06k8z8",
            "m.0ch45b0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0y62n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0y62n ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0y62n)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Staten Island ] )",
        "gold_entity_map": {
            "m.0y62n": "Staten Island"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1633",
        "question": "what continent is greenland located",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035v3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035v3 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mh) (JOIN (R location.location.containedby) m.035v3))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Greenland ] ) )",
        "gold_entity_map": {
            "m.035v3": "Greenland",
            "m.01mh": "Continent"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mh": "Continent"
        }
    },
    {
        "ID": "WebQTrn-1635",
        "question": "what teams did gretzky play on",
        "comp_type": null,
        "answer": [
            "m.0jnmj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0839s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0839s ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.0839s))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Wayne Gretzky ] ) )",
        "gold_entity_map": {
            "m.0839s": "Wayne Gretzky"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1645",
        "question": "where did the battle of new orleans start",
        "comp_type": null,
        "answer": [
            "m.01_gtcg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012vkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012vkj ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.012vkj)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of New Orleans ] )",
        "gold_entity_map": {
            "m.012vkj": "Battle of New Orleans"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1646",
        "question": "what does the dominican republic speak",
        "comp_type": null,
        "answer": [
            "m.02dhwl",
            "m.06jsg0",
            "m.06nm1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.027rn)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Dominican Republic ] )",
        "gold_entity_map": {
            "m.027rn": "Dominican Republic"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1648",
        "question": "who is paul revere and what did he do",
        "comp_type": null,
        "answer": [
            "g.125_hzb47",
            "m.012t_z",
            "m.01vs_x",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0db0x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0db0x ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0db0x)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Paul Revere ] )",
        "gold_entity_map": {
            "m.0db0x": "Paul Revere"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    }
]