[
    {
        "ID": "WebQTrn-2357",
        "question": "who was leonardo da vinci teacher",
        "comp_type": null,
        "answer": [
            "m.01fgbq",
            "m.04qj5",
            "m.0f87z0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.04lg6)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Leonardo da Vinci ] )",
        "gold_entity_map": {
            "m.04lg6": "Leonardo da Vinci"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2360",
        "question": "what football teams did emmitt smith play for",
        "comp_type": null,
        "answer": [
            "m.02896",
            "m.0ftf0f",
            "m.0ws7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01480y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01480y ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.01480y))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Emmitt Smith ] ) )",
        "gold_entity_map": {
            "m.01480y": "Emmitt Smith"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2362",
        "question": "what city is purdue university located",
        "comp_type": null,
        "answer": [
            "m.0sqd0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05x_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05x_5 ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R location.location.street_address) m.05x_5))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ location , location , street address ] ) [ Purdue University ] ) )",
        "gold_entity_map": {
            "m.05x_5": "Purdue University"
        },
        "gold_relation_map": {
            "location.location.street_address": "location , location , street address",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2367",
        "question": "what did emily bronte died of",
        "comp_type": null,
        "answer": [
            "m.07jwr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02nzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02nzw ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.02nzw)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Emily Brontë ] )",
        "gold_entity_map": {
            "m.02nzw": "Emily Brontë"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2368",
        "question": "what to do around krabi thailand",
        "comp_type": null,
        "answer": [
            "m.05_sdt",
            "m.07m1yw",
            "m.0k6zhbn",
            "m.0k6zhkl",
            "m.0k6zhn3",
            "m.0k6zhpt",
            "m.0k6zhtb",
            "m.0k6zjcg",
            "m.0k6zjqf",
            "m.0k6zm1_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q9ng)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q9ng ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.04q9ng)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Krabi ] )",
        "gold_entity_map": {
            "m.04q9ng": "Krabi"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2369",
        "question": "what country is george washington carver from",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djm ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.03djm)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ George Washington Carver ] )",
        "gold_entity_map": {
            "m.03djm": "George Washington Carver"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2375",
        "question": "what time zone is birmingham england",
        "comp_type": null,
        "answer": [
            "m.03bdv",
            "m.04q01dj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k33p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k33p ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0k33p)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Birmingham ] )",
        "gold_entity_map": {
            "m.0k33p": "Birmingham"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2376",
        "question": "what does andy warhol do",
        "comp_type": null,
        "answer": [
            "m.01d_h8",
            "m.020xn5",
            "m.02hrh1q",
            "m.02jknp",
            "m.02nxqmh",
            "m.03hz6vv",
            "m.03qsdp2",
            "m.0b7b55p",
            "m.0dgd_",
            "m.0dxtg",
            "m.0kyk",
            "m.0lgw7",
            "m.0n1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kc6 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0kc6)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Andy Warhol ] )",
        "gold_entity_map": {
            "m.0kc6": "Andy Warhol"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2377",
        "question": "where is colombia the country",
        "comp_type": null,
        "answer": [
            "m.06n3y",
            "m.07c5l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ls2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ls2 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01ls2)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Colombia ] )",
        "gold_entity_map": {
            "m.01ls2": "Colombia"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2380",
        "question": "where was karl marx buried",
        "comp_type": null,
        "answer": [
            "m.0j70p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.048cl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.048cl ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.048cl)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Karl Marx ] )",
        "gold_entity_map": {
            "m.048cl": "Karl Marx"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2382",
        "question": "what timezone is nevada in right now",
        "comp_type": null,
        "answer": [
            "m.02hczc",
            "m.02lcqs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059_c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059_c ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.059_c)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Nevada ] )",
        "gold_entity_map": {
            "m.059_c": "Nevada"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2384",
        "question": "what did dr carter g woodson do",
        "comp_type": null,
        "answer": [
            "m.03jgz",
            "m.0cbd2",
            "m.0d8qb",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042w00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042w00 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.042w00)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Carter G. Woodson ] )",
        "gold_entity_map": {
            "m.042w00": "Carter G. Woodson"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2385",
        "question": "who invented the ford motor company",
        "comp_type": null,
        "answer": [
            "m.03gxm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zs4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zs4 ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.02zs4)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Ford Motor Company ] )",
        "gold_entity_map": {
            "m.02zs4": "Ford Motor Company"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2386",
        "question": "what is ayrton senna",
        "comp_type": null,
        "answer": [
            "m.02h6nn_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012pxw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012pxw ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.012pxw)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Ayrton Senna ] )",
        "gold_entity_map": {
            "m.012pxw": "Ayrton Senna"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2387",
        "question": "where was stephen g. breyer born",
        "comp_type": null,
        "answer": [
            "m.0d6lp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016m0v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016m0v ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.016m0v)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Stephen Breyer ] )",
        "gold_entity_map": {
            "m.016m0v": "Stephen Breyer"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2389",
        "question": "what did charles dickens believe in",
        "comp_type": null,
        "answer": [
            "m.0n2g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01v9724)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01v9724 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.01v9724)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Charles Dickens ] )",
        "gold_entity_map": {
            "m.01v9724": "Charles Dickens"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2391",
        "question": "what religion is sammy davis jr",
        "comp_type": null,
        "answer": [
            "m.03_gx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bmlb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bmlb ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.01bmlb)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Sammy Davis, Jr. ] )",
        "gold_entity_map": {
            "m.01bmlb": "Sammy Davis, Jr."
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2393",
        "question": "who started google",
        "comp_type": null,
        "answer": [
            "m.0gjpq",
            "m.0gjq6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0387r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0387r ns:law.invention.inventor ?x .\n}\n",
        "sexpr": "(JOIN (R law.invention.inventor) m.0387r)",
        "normed_sexpr": "( JOIN ( R [ law , invention , inventor ] ) [ Google Search ] )",
        "gold_entity_map": {
            "m.0387r": "Google Search"
        },
        "gold_relation_map": {
            "law.invention.inventor": "law , invention , inventor"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2394",
        "question": "in what timezone is arizona",
        "comp_type": null,
        "answer": [
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vmt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vmt ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0vmt)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Arizona ] )",
        "gold_entity_map": {
            "m.0vmt": "Arizona"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2397",
        "question": "what year did arizona diamondbacks win the world series",
        "comp_type": null,
        "answer": [
            "m.018my"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x0d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x0d ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0x0d)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Arizona Diamondbacks ] )",
        "gold_entity_map": {
            "m.0x0d": "Arizona Diamondbacks"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2398",
        "question": "where was jesus born and raised",
        "comp_type": null,
        "answer": [
            "m.065sh7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045m1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045m1_ ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.045m1_)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jesus Christ ] )",
        "gold_entity_map": {
            "m.045m1_": "Jesus Christ"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2402",
        "question": "where is greyton western cape",
        "comp_type": null,
        "answer": [
            "m.01tjt2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09g125)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09g125 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.09g125)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Greyton, Western Cape ] )",
        "gold_entity_map": {
            "m.09g125": "Greyton, Western Cape"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2408",
        "question": "which jane austen books are movies",
        "comp_type": null,
        "answer": [
            "m.011yg9",
            "m.02q8r2w",
            "m.02q8r4y",
            "m.072zl1",
            "m.07tj4c",
            "m.07v8_d",
            "m.07v95y",
            "m.08m1s2",
            "m.09ncpg",
            "m.09rnxj",
            "m.0f98p_",
            "m.0fsd9t",
            "m.0qjzd"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\t?x ns:common.topic.notable_types ns:m.0jsg2m .\n        ?x ns:film.film.story_by ns:m.040dv .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0jsg2m": "Film",
            "m.040dv": "Jane Austen"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "film.film.story_by": "film , film , story by"
        },
        "gold_type_map": {
            "m.0jsg2m": "Film"
        }
    },
    {
        "ID": "WebQTrn-2410",
        "question": "where is lanzarote in a world map",
        "comp_type": null,
        "answer": [
            "m.0hzjwx2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s8wm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s8wm ns:geography.island.island_group ?x .\n}\n",
        "sexpr": "(JOIN (R geography.island.island_group) m.01s8wm)",
        "normed_sexpr": "( JOIN ( R [ geography , island , island group ] ) [ Lanzarote ] )",
        "gold_entity_map": {
            "m.01s8wm": "Lanzarote"
        },
        "gold_relation_map": {
            "geography.island.island_group": "geography , island , island group"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2414",
        "question": "who plays dante falconeri",
        "comp_type": null,
        "answer": [
            "m.04ndnk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06wc9fm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06wc9fm ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.06wc9fm))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Dante Falconeri ] ) )",
        "gold_entity_map": {
            "m.06wc9fm": "Dante Falconeri"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2417",
        "question": "who does northern ireland belong to",
        "comp_type": null,
        "answer": [
            "m.07ssc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bcl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bcl ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_parent) m.05bcl)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Northern Ireland ] )",
        "gold_entity_map": {
            "m.05bcl": "Northern Ireland"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_parent": "base , aareas , schema , administrative area , administrative parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2420",
        "question": "where do islamic people go to worship",
        "comp_type": null,
        "answer": [
            "m.04_xn",
            "m.0pc5qwj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.types_of_places_of_worship ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.types_of_places_of_worship) m.0flw86)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , types of places of worship ] ) [ Islam ] )",
        "gold_entity_map": {
            "m.0flw86": "Islam"
        },
        "gold_relation_map": {
            "religion.religion.types_of_places_of_worship": "religion , religion , types of places of worship"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2423",
        "question": "what god does taoism believe in",
        "comp_type": null,
        "answer": [
            "m.01g7jh",
            "m.01g7kl",
            "m.01g7ln",
            "m.01g7m0",
            "m.01g7rf",
            "m.01gcpc",
            "m.01gcpr",
            "m.01gcqh",
            "m.01tbmq",
            "m.0258q8",
            "m.025964",
            "m.02rj87h",
            "m.09n_d1",
            "m.0j626gb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gvx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gvx ns:religion.religion.deities ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.deities) m.07gvx)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , deities ] ) [ Taoism ] )",
        "gold_entity_map": {
            "m.07gvx": "Taoism"
        },
        "gold_relation_map": {
            "religion.religion.deities": "religion , religion , deities"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2424",
        "question": "what college did kris humphries play for",
        "comp_type": null,
        "answer": [
            "m.025v3k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0730b4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0730b4 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.school ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.school) (JOIN (R sports.drafted_athlete.drafted) m.0730b4))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , school ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Kris Humphries ] ) )",
        "gold_entity_map": {
            "m.0730b4": "Kris Humphries"
        },
        "gold_relation_map": {
            "sports.sports_league_draft_pick.school": "sports , sports league draft pick , school",
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2427",
        "question": "what do mali people speak",
        "comp_type": null,
        "answer": [
            "m.01gdq",
            "m.05n7jk",
            "m.064_8sq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v09)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v09 ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.04v09)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Mali ] )",
        "gold_entity_map": {
            "m.04v09": "Mali"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2428",
        "question": "who is john garcia",
        "comp_type": null,
        "answer": [
            "m.09jwl",
            "m.09l65"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_lpf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_lpf ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03_lpf)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ John Garcia ] )",
        "gold_entity_map": {
            "m.03_lpf": "John Garcia"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2432",
        "question": "what did lbj die of",
        "comp_type": null,
        "answer": [
            "m.0gk4g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f7fy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f7fy ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0f7fy)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Lyndon B. Johnson ] )",
        "gold_entity_map": {
            "m.0f7fy": "Lyndon B. Johnson"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2435",
        "question": "what does george soros believe",
        "comp_type": null,
        "answer": [
            "m.03_gx",
            "m.0kpl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gyk6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gyk6w ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.0gyk6w)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ George Soros ] )",
        "gold_entity_map": {
            "m.0gyk6w": "George Soros"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2436",
        "question": "on which river is paris",
        "comp_type": null,
        "answer": [
            "m.0f3vz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qtj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qtj ns:location.location.partially_contains ?x .\n?x ns:common.topic.notable_types ns:m.01xs05k .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01xs05k) (JOIN (R location.location.partially_contains) m.05qtj))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ River ] ) ( JOIN ( R [ location , location , partially contains ] ) [ Paris ] ) )",
        "gold_entity_map": {
            "m.05qtj": "Paris",
            "m.01xs05k": "River"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.partially_contains": "location , location , partially contains"
        },
        "gold_type_map": {
            "m.01xs05k": "River"
        }
    },
    {
        "ID": "WebQTrn-2437",
        "question": "who was sam houston answers",
        "comp_type": null,
        "answer": [
            "m.012qdp",
            "m.04gc2",
            "m.099md",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbjz ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0gbjz)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Sam Houston ] )",
        "gold_entity_map": {
            "m.0gbjz": "Sam Houston"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    }
]