[
    {
        "ID": "WebQTrn-3210",
        "question": "what country christopher columbus from",
        "comp_type": null,
        "answer": [
            "m.02q14r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pwz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pwz ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.01pwz)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Christopher Columbus ] )",
        "gold_entity_map": {
            "m.01pwz": "Christopher Columbus"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3211",
        "question": "who was michael j fox",
        "comp_type": null,
        "answer": [
            "m.01d_h8",
            "m.02hrh1q",
            "m.03gjzk",
            "m.0kyk",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hz_1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hz_1 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0hz_1)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Michael J. Fox ] )",
        "gold_entity_map": {
            "m.0hz_1": "Michael J. Fox"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3212",
        "question": "what movies did jenna dewan play in",
        "comp_type": null,
        "answer": [
            "m.01h3y_",
            "m.02z12dc",
            "m.047fjvq",
            "m.04gh5vv",
            "m.05c2tnq",
            "m.05p5j8t",
            "m.08_pq1",
            "m.09vw4f_",
            "m.0b_ztfh",
            "m.0b73wst",
            "m.0bwjrf5",
            "m.0c1_1c",
            "m.0crtsl8",
            "m.0fq33vs",
            "m.0g4zbk",
            "m.0gty278",
            "m.0h2cvd1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ck1l0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ck1l0 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0ck1l0))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Jenna Dewan ] ) )",
        "gold_entity_map": {
            "m.0ck1l0": "Jenna Dewan"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3214",
        "question": "what is father name of salman khan",
        "comp_type": null,
        "answer": [
            "m.07pwhm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s0l0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s0l0 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.01s0l0))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Salman Khan ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.01s0l0": "Salman Khan"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3215",
        "question": "where is shawn johnson gymnast from",
        "comp_type": null,
        "answer": [
            "m.02j3w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026sgt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026sgt0 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.026sgt0)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Shawn Johnson ] )",
        "gold_entity_map": {
            "m.026sgt0": "Shawn Johnson"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3216",
        "question": "what kind of money does the ivory coast use",
        "comp_type": null,
        "answer": [
            "m.025sw2q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fv4v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fv4v ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0fv4v)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Ivory Coast ] )",
        "gold_entity_map": {
            "m.0fv4v": "Ivory Coast"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3218",
        "question": "where is roger federer from sui",
        "comp_type": null,
        "answer": [
            "m.01k4f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01my95)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01my95 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01my95)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Roger Federer ] )",
        "gold_entity_map": {
            "m.01my95": "Roger Federer"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3220",
        "question": "what is michael buble 's style of music",
        "comp_type": null,
        "answer": [
            "m.0155w",
            "m.015y_n",
            "m.0161rf",
            "m.02dsz1",
            "m.02k_kn",
            "m.02qdgx",
            "m.02vjzr",
            "m.03_d0",
            "m.05bt6j",
            "m.064t9",
            "m.0h08p",
            "m.0m40d",
            "m.0y4f8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xkkq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xkkq ns:music.artist.genre ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.genre) m.02xkkq)",
        "normed_sexpr": "( JOIN ( R [ music , artist , genre ] ) [ Michael Bublé ] )",
        "gold_entity_map": {
            "m.02xkkq": "Michael Bublé"
        },
        "gold_relation_map": {
            "music.artist.genre": "music , artist , genre"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3227",
        "question": "what did skinner believe",
        "comp_type": null,
        "answer": [
            "m.0kpl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jv4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jv4 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.01jv4)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ B. F. Skinner ] )",
        "gold_entity_map": {
            "m.01jv4": "B. F. Skinner"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3231",
        "question": "what is the zip code for inglewood california",
        "comp_type": null,
        "answer": [
            "m.01zg2_k",
            "m.01zg2t2",
            "m.01zg2ty",
            "m.01zg2vs",
            "m.01zg30c",
            "m.01zg5dc",
            "m.07nq3_6",
            "m.07nq3_f",
            "m.07nq3z_",
            "m.07nq3zk",
            "m.07nq3zs",
            "m.07tn95v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r0f7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r0f7 ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0r0f7)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Inglewood ] )",
        "gold_entity_map": {
            "m.0r0f7": "Inglewood"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3235",
        "question": "what made roald dahl famous",
        "comp_type": null,
        "answer": [
            "m.02xhgwq",
            "m.05z96",
            "m.0cbd2",
            "m.0dxtg",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ff2k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ff2k ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0ff2k)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Roald Dahl ] )",
        "gold_entity_map": {
            "m.0ff2k": "Roald Dahl"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3240",
        "question": "what country did ponce de leon live in",
        "comp_type": null,
        "answer": [
            "m.06mkj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0123f1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0123f1 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.0123f1)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Juan Ponce de León ] )",
        "gold_entity_map": {
            "m.0123f1": "Juan Ponce de León"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3242",
        "question": "what does the name austin stand for",
        "comp_type": null,
        "answer": [
            "m.0hhsw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vzm ns:symbols.namesake.named_after ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.namesake.named_after) m.0vzm)",
        "normed_sexpr": "( JOIN ( R [ symbols , namesake , named after ] ) [ Austin ] )",
        "gold_entity_map": {
            "m.0vzm": "Austin"
        },
        "gold_relation_map": {
            "symbols.namesake.named_after": "symbols , namesake , named after"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3246",
        "question": "what to do today in birmingham uk",
        "comp_type": null,
        "answer": [
            "m.01ynw8",
            "m.021qw_",
            "m.02v6xh",
            "m.02z8kp",
            "m.0374rv",
            "m.04y0c7",
            "m.05crkh",
            "m.063cph",
            "m.07_4t5",
            "m.07tpyx",
            "m.0g9yjs_",
            "m.0gvrs63"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k33p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k33p ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0k33p)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Birmingham ] )",
        "gold_entity_map": {
            "m.0k33p": "Birmingham"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3249",
        "question": "what show does tamera mowry play on",
        "comp_type": null,
        "answer": [
            "m.02rr9jc",
            "m.04xrnb",
            "m.05h2jn_",
            "m.0706t_",
            "m.08l81_",
            "m.08lsjw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.075kfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.075kfb ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.075kfb))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Tamera Mowry ] ) )",
        "gold_entity_map": {
            "m.075kfb": "Tamera Mowry"
        },
        "gold_relation_map": {
            "tv.tv_actor.starring_roles": "tv , tv actor , starring roles",
            "tv.regular_tv_appearance.series": "tv , regular tv appearance , series"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3251",
        "question": "what college is in greeley colorado",
        "comp_type": null,
        "answer": [
            "m.01_k7f",
            "m.0407qbq",
            "m.0clw8vv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rczx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rczx ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01y2hnl .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01y2hnl) (JOIN (R location.location.contains) m.0rczx))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ College/University ] ) ( JOIN ( R [ location , location , contains ] ) [ Greeley ] ) )",
        "gold_entity_map": {
            "m.0rczx": "Greeley",
            "m.01y2hnl": "College/University"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01y2hnl": "College/University"
        }
    },
    {
        "ID": "WebQTrn-3252",
        "question": "what countries does the niger river flow through",
        "comp_type": null,
        "answer": [
            "m.0164v",
            "m.03676",
            "m.04v09",
            "m.05cc1",
            "m.05cgv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05csx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05csx ns:geography.river.basin_countries ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.basin_countries) m.05csx)",
        "normed_sexpr": "( JOIN ( R [ geography , river , basin countries ] ) [ Niger River ] )",
        "gold_entity_map": {
            "m.05csx": "Niger River"
        },
        "gold_relation_map": {
            "geography.river.basin_countries": "geography , river , basin countries"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3255",
        "question": "where is pyramids located in egypt",
        "comp_type": null,
        "answer": [
            "m.02k54"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jmj1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jmj1 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.03jmj1)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Egyptian pyramids ] )",
        "gold_entity_map": {
            "m.03jmj1": "Egyptian pyramids"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3256",
        "question": "what games did bungie make",
        "comp_type": null,
        "answer": [
            "m.02_5m4d",
            "m.02hl36h",
            "m.02hl4g1",
            "m.02hl7gm",
            "m.02hl7q3",
            "m.02hl81g",
            "m.02hl9p6",
            "m.02hlczs",
            "m.02hldps",
            "m.02hlknf",
            "m.02hll5w",
            "m.02hm22b",
            "m.02hm6f9",
            "m.02hm6sf",
            "m.02hmc8n",
            "m.02hmf94",
            "m.02hmnts",
            "m.02hmrp5",
            "m.040qs85",
            "m.05nsphn",
            "m.0kyn_zb",
            "m.0kyny5f",
            "m.0kyq2t6",
            "m.0kyq53c",
            "m.0kyr83h",
            "m.0kyrc3g",
            "m.0kyrw35",
            "m.0kys0mb",
            "m.0kys0zq",
            "m.0kys2h1",
            "m.0kyw665",
            "m.0kyxmvv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09h57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09h57 ns:cvg.cvg_developer.game_versions_developed ?x .\n}\n",
        "sexpr": "(JOIN (R cvg.cvg_developer.game_versions_developed) m.09h57)",
        "normed_sexpr": "( JOIN ( R [ cvg , cvg developer , game versions developed ] ) [ Bungie ] )",
        "gold_entity_map": {
            "m.09h57": "Bungie"
        },
        "gold_relation_map": {
            "cvg.cvg_developer.game_versions_developed": "cvg , cvg developer , game versions developed"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3267",
        "question": "where was ancient carthage located",
        "comp_type": null,
        "answer": [
            "m.07fj_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xpg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xpg ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01xpg)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Carthage ] )",
        "gold_entity_map": {
            "m.01xpg": "Carthage"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3272",
        "question": "what were frederick douglass achievements",
        "comp_type": null,
        "answer": [
            "m.016fc2",
            "m.02h668d",
            "m.080ntlp",
            "m.0cbd2",
            "m.0hpjt",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zg0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zg0 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02zg0)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Frederick Douglass ] )",
        "gold_entity_map": {
            "m.02zg0": "Frederick Douglass"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3275",
        "question": "what is zip code for davenport iowa",
        "comp_type": null,
        "answer": [
            "m.03dqrd_",
            "m.03dqrfd",
            "m.03dqrft",
            "m.03dqrg6",
            "m.03dqrgm",
            "m.03dqrh0",
            "m.07nqqx8",
            "m.07nqqxh",
            "m.07nqqxq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02d6c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02d6c ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.02d6c)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Davenport ] )",
        "gold_entity_map": {
            "m.02d6c": "Davenport"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3278",
        "question": "what was the name of william shakespeare 's children",
        "comp_type": null,
        "answer": [
            "m.026db4d",
            "m.02rqr_w",
            "m.0c0xwb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.children ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.children) m.081k8)",
        "normed_sexpr": "( JOIN ( R [ people , person , children ] ) [ William Shakespeare ] )",
        "gold_entity_map": {
            "m.081k8": "William Shakespeare"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3279",
        "question": "what organization did dr. carter g. woodson found",
        "comp_type": null,
        "answer": [
            "m.08lhk3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042w00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042w00 ns:organization.organization_founder.organizations_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization_founder.organizations_founded) m.042w00)",
        "normed_sexpr": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ Carter G. Woodson ] )",
        "gold_entity_map": {
            "m.042w00": "Carter G. Woodson"
        },
        "gold_relation_map": {
            "organization.organization_founder.organizations_founded": "organization , organization founder , organizations founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3284",
        "question": "what inventions did leonardo da vinci made",
        "comp_type": null,
        "answer": [
            "m.05my_3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n",
        "sexpr": "(JOIN (R base.argumentmaps.innovator.original_ideas) m.04lg6)",
        "normed_sexpr": "( JOIN ( R [ base , argumentmaps , innovator , original ideas ] ) [ Leonardo da Vinci ] )",
        "gold_entity_map": {
            "m.04lg6": "Leonardo da Vinci"
        },
        "gold_relation_map": {
            "base.argumentmaps.innovator.original_ideas": "base , argumentmaps , innovator , original ideas"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3286",
        "question": "where is eric cantor from",
        "comp_type": null,
        "answer": [
            "m.0dzt9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027z_f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027z_f ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.027z_f)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Eric Cantor ] )",
        "gold_entity_map": {
            "m.027z_f": "Eric Cantor"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3287",
        "question": "what is the currency of sweden called",
        "comp_type": null,
        "answer": [
            "m.0485n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0vqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0vqn ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0d0vqn)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Sweden ] )",
        "gold_entity_map": {
            "m.0d0vqn": "Sweden"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3289",
        "question": "where did tim mcgraw grew up",
        "comp_type": null,
        "answer": [
            "m.0tl_z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lk95)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lk95 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02lk95)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Tim McGraw ] )",
        "gold_entity_map": {
            "m.02lk95": "Tim McGraw"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3291",
        "question": "when did kerry run for president",
        "comp_type": null,
        "answer": [
            "m.02jnr7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3qd0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3qd0 ns:government.politician.election_campaigns ?x .\n}\n",
        "sexpr": "(JOIN (R government.politician.election_campaigns) m.0d3qd0)",
        "normed_sexpr": "( JOIN ( R [ government , politician , election campaigns ] ) [ John Kerry ] )",
        "gold_entity_map": {
            "m.0d3qd0": "John Kerry"
        },
        "gold_relation_map": {
            "government.politician.election_campaigns": "government , politician , election campaigns"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3300",
        "question": "where is rihanna from ethnically",
        "comp_type": null,
        "answer": [
            "m.09c8kp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:people.person.ethnicity ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.ethnicity) m.06mt91)",
        "normed_sexpr": "( JOIN ( R [ people , person , ethnicity ] ) [ Rihanna ] )",
        "gold_entity_map": {
            "m.06mt91": "Rihanna"
        },
        "gold_relation_map": {
            "people.person.ethnicity": "people , person , ethnicity"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3301",
        "question": "where was the assyrian civilization located",
        "comp_type": null,
        "answer": [
            "m.04wsz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wmn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wmn ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0wmn)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Assyria ] )",
        "gold_entity_map": {
            "m.0wmn": "Assyria"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3302",
        "question": "what did baron de montesquieu die from",
        "comp_type": null,
        "answer": [
            "m.0cjf0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9wd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9wd ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0f9wd)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Montesquieu ] )",
        "gold_entity_map": {
            "m.0f9wd": "Montesquieu"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3304",
        "question": "what do do in nashville tn",
        "comp_type": null,
        "answer": [
            "m.01r0x4",
            "m.0289mp6",
            "m.02q1jxj",
            "m.02z1wcp",
            "m.02z6zt",
            "m.03cq2l6",
            "m.03cwct",
            "m.03smg2",
            "m.04041r",
            "m.047vmqj",
            "m.04jhkzc",
            "m.04k8jf",
            "m.04n4m_c",
            "m.04q29_0",
            "m.04x2jb",
            "m.05hs17",
            "m.05yhxg",
            "m.05zm4lr",
            "m.061gsk",
            "m.06c2l0",
            "m.06j9j7",
            "m.07t4nd",
            "m.0b8fz5",
            "m.0bh7wr",
            "m.0cx8by",
            "m.0fpc2gp",
            "m.0k0n9s_",
            "m.0k3d2jj",
            "m.0k4wxyc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jbn ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.05jbn)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Nashville ] )",
        "gold_entity_map": {
            "m.05jbn": "Nashville"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    }
]