[
    {
        "ID": "WebQTrn-1199",
        "question": "what do people in south africa speak",
        "comp_type": null,
        "answer": [
            "m.0121sr",
            "m.02bv9",
            "m.02h40lc",
            "m.02hwn8h",
            "m.02hxcvy",
            "m.0349s",
            "m.03hkp",
            "m.03k50",
            "m.04306rv",
            "m.05zjd",
            "m.06x06",
            "m.070gc6",
            "m.070gkn",
            "m.071dl",
            "m.07c9s",
            "m.09s02",
            "m.0jzc",
            "m.0nl8g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0hzlz)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ South Africa ] )",
        "gold_entity_map": {
            "m.0hzlz": "South Africa"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1200",
        "question": "where great britain located",
        "comp_type": null,
        "answer": [
            "m.02j9z",
            "m.07ssc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034cm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034cm ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.034cm)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Great Britain ] )",
        "gold_entity_map": {
            "m.034cm": "Great Britain"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1204",
        "question": "what cities are in oakland county michigan",
        "comp_type": null,
        "answer": [
            "m.01_n1z_",
            "m.01_sd2f",
            "m.01_sdrk",
            "m.01_srp0",
            "m.01_wrzy",
            "m.013f50",
            "m.01m8tz",
            "m.01m8vb",
            "m.03gygh",
            "m.048myk",
            "m.048n0x",
            "m.049__g_",
            "m.049_1l3",
            "m.049_5lr",
            "m.049_6ys",
            "m.049_8yl",
            "m.049_d6j",
            "m.049_ffc",
            "m.049_gwb",
            "m.049_j2k",
            "m.049_j41",
            "m.049_j51",
            "m.049_j7k",
            "m.049_k6c",
            "m.049_kjf",
            "m.049_kl_",
            "m.049_lg0",
            "m.049_lv8",
            "m.049_mht",
            "m.049_nd8",
            "m.049_p0h",
            "m.049_pr8",
            "m.049_qgf",
            "m.049_qyz",
            "m.049_rdr",
            "m.049_rh9",
            "m.049_rlv",
            "m.049_skq",
            "m.049_slz",
            "m.049_tgq",
            "m.049_v2c",
            "m.049_v5g",
            "m.049_xf8",
            "m.049_xrz",
            "m.049_xzm",
            "m.049_y2x",
            "m.049_y4d",
            "m.049_ylm",
            "m.049_z1y",
            "m.049z__5",
            "m.049z_3g",
            "m.049z_j_",
            "m.049zysb",
            "m.049zzmp",
            "m.049zzpq",
            "m.049zzyd",
            "m.04b0194",
            "m.0nr3p",
            "m.0vg6f",
            "m.0vg6s",
            "m.0vg74",
            "m.0vg7h",
            "m.0vg8j",
            "m.0vg8x",
            "m.0vg97",
            "m.0vg9l",
            "m.0vg9y",
            "m.0vgb8",
            "m.0vgbm",
            "m.0vgbz",
            "m.0vgc_",
            "m.0vgc9",
            "m.0vgcn",
            "m.0vgdb",
            "m.0vgdp",
            "m.0vgf0",
            "m.0vgfc",
            "m.0vgfq",
            "m.0vl_5",
            "m.0vl_j",
            "m.0vl_w",
            "m.0vlzh",
            "m.0vm06",
            "m.0vm0k",
            "m.0vm17",
            "m.0vm1l",
            "m.0vm1y",
            "m.0vm28",
            "m.0vm2m",
            "m.0vm2z",
            "m.0vm39",
            "m.0vm3r",
            "m.0vm42",
            "m.0vm4f",
            "m.0vm53",
            "m.0vm5g",
            "m.0vm5t",
            "m.0vm64",
            "m.0vm6h",
            "m.0vm75",
            "m.0vm7k",
            "m.0vm7x",
            "m.0vm87",
            "m.0vm8l",
            "m.0vm8y",
            "m.0vm98",
            "m.0xc0s",
            "m.0xc13"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nj7b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nj7b ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R location.location.contains) m.0nj7b))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ location , location , contains ] ) [ Oakland County ] ) )",
        "gold_entity_map": {
            "m.01m9": "City/Town/Village",
            "m.0nj7b": "Oakland County"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-1208",
        "question": "when did the 7th harry potter book come out",
        "comp_type": null,
        "answer": [
            "2007-07-21"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bkkv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bkkv ns:book.written_work.date_of_first_publication ?x .\n}\n",
        "sexpr": "(JOIN (R book.written_work.date_of_first_publication) m.03bkkv)",
        "normed_sexpr": "( JOIN ( R [ book , written work , date of first publication ] ) [ Harry Potter and the Deathly Hallows ] )",
        "gold_entity_map": {
            "m.03bkkv": "Harry Potter and the Deathly Hallows"
        },
        "gold_relation_map": {
            "book.written_work.date_of_first_publication": "book , written work , date of first publication"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1210",
        "question": "where is south carolina located",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06yxd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06yxd ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_parent) m.06yxd)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ South Carolina ] )",
        "gold_entity_map": {
            "m.06yxd": "South Carolina"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_parent": "base , aareas , schema , administrative area , administrative parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1211",
        "question": "who are paul revere 's parents",
        "comp_type": null,
        "answer": [
            "m.0qd6j_b",
            "m.0qd6jv4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0db0x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0db0x ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.0db0x)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Paul Revere ] )",
        "gold_entity_map": {
            "m.0db0x": "Paul Revere"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1214",
        "question": "who is the current coach of the chicago bulls",
        "comp_type": null,
        "answer": [
            "m.043jv80"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm74)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm74 ns:basketball.basketball_team.head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R basketball.basketball_team.head_coach) m.0jm74)",
        "normed_sexpr": "( JOIN ( R [ basketball , basketball team , head coach ] ) [ Chicago Bulls ] )",
        "gold_entity_map": {
            "m.0jm74": "Chicago Bulls"
        },
        "gold_relation_map": {
            "basketball.basketball_team.head_coach": "basketball , basketball team , head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1216",
        "question": "what awards has morgan freeman won",
        "comp_type": null,
        "answer": [
            "m.019f7x",
            "m.025j12",
            "m.027b9j5",
            "m.027c95y",
            "m.02f2hd",
            "m.02f2kw",
            "m.02spb2",
            "m.02x73k6",
            "m.02x8n1n",
            "m.054ky1",
            "m.07n939s",
            "m.09sdmz",
            "m.09tly71",
            "m.0gkmcgj",
            "m.0gqy2",
            "m.0hj8khy",
            "m.0lyxb7f",
            "m.0zbhqxc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055c8 ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n",
        "sexpr": "(JOIN (R award.award_honor.award) (JOIN (R award.award_winner.awards_won) m.055c8))",
        "normed_sexpr": "( JOIN ( R [ award , award honor , award ] ) ( JOIN ( R [ award , award winner , awards won ] ) [ Morgan Freeman ] ) )",
        "gold_entity_map": {
            "m.055c8": "Morgan Freeman"
        },
        "gold_relation_map": {
            "award.award_honor.award": "award , award honor , award",
            "award.award_winner.awards_won": "award , award winner , awards won"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1219",
        "question": "who were michael jackson 's brothers and sisters",
        "comp_type": null,
        "answer": [
            "m.013v5j",
            "m.01s993",
            "m.01s9b9",
            "m.01zmpg",
            "m.023_5s",
            "m.0247h4",
            "m.04_70v",
            "m.0598rr3",
            "m.0gbwp",
            "m.0nf3l7y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\n",
        "sexpr": "(JOIN (R people.sibling_relationship.sibling) (JOIN (R people.person.sibling_s) m.09889g))",
        "normed_sexpr": "( JOIN ( R [ people , sibling relationship , sibling ] ) ( JOIN ( R [ people , person , sibling s ] ) [ Michael Jackson ] ) )",
        "gold_entity_map": {
            "m.09889g": "Michael Jackson"
        },
        "gold_relation_map": {
            "people.sibling_relationship.sibling": "people , sibling relationship , sibling",
            "people.person.sibling_s": "people , person , sibling s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1223",
        "question": "what teams did george steinbrenner own",
        "comp_type": null,
        "answer": [
            "m.0cqt41"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q5t3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q5t3 ns:sports.sports_team_owner.teams_owned ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_owner.teams_owned) m.01q5t3)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team owner , teams owned ] ) [ George Steinbrenner ] )",
        "gold_entity_map": {
            "m.01q5t3": "George Steinbrenner"
        },
        "gold_relation_map": {
            "sports.sports_team_owner.teams_owned": "sports , sports team owner , teams owned"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1225",
        "question": "what to see and do in revelstoke",
        "comp_type": null,
        "answer": [
            "m.01gznn",
            "m.057pc4",
            "m.06ygx0",
            "m.079rx0",
            "m.0bmy6_",
            "m.0bnkzr",
            "m.0bx3_5",
            "m.0kc5m6f",
            "m.0kc5m6n",
            "m.0kc5m6w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qrmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qrmp ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.02qrmp)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Revelstoke ] )",
        "gold_entity_map": {
            "m.02qrmp": "Revelstoke"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1227",
        "question": "what guitar did andres segovia use",
        "comp_type": null,
        "answer": [
            "m.0342h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jg34)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jg34 ns:music.group_member.instruments_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_member.instruments_played) m.0jg34)",
        "normed_sexpr": "( JOIN ( R [ music , group member , instruments played ] ) [ Andrés Segovia ] )",
        "gold_entity_map": {
            "m.0jg34": "Andrés Segovia"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1228",
        "question": "what style of art did vincent van gogh do",
        "comp_type": null,
        "answer": [
            "m.015xrq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m2 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
        "sexpr": "(JOIN (R visual_art.visual_artist.associated_periods_or_movements) m.07_m2)",
        "normed_sexpr": "( JOIN ( R [ visual art , visual artist , associated periods or movements ] ) [ Vincent van Gogh ] )",
        "gold_entity_map": {
            "m.07_m2": "Vincent van Gogh"
        },
        "gold_relation_map": {
            "visual_art.visual_artist.associated_periods_or_movements": "visual art , visual artist , associated periods or movements"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1230",
        "question": "where did the tutsi come from",
        "comp_type": null,
        "answer": [
            "m.06dfg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hnv0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hnv0 ns:people.ethnicity.geographic_distribution ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.geographic_distribution) m.0hnv0)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Tutsi ] )",
        "gold_entity_map": {
            "m.0hnv0": "Tutsi"
        },
        "gold_relation_map": {
            "people.ethnicity.geographic_distribution": "people , ethnicity , geographic distribution"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1231",
        "question": "what country did osama bin laden live in",
        "comp_type": null,
        "answer": [
            "m.01z215",
            "m.05sb1",
            "m.06tw8",
            "m.0jdd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mg9 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.05mg9))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Osama bin Laden ] ) )",
        "gold_entity_map": {
            "m.05mg9": "Osama bin Laden"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1232",
        "question": "where was the roman empire centered",
        "comp_type": null,
        "answer": [
            "m.01q0l",
            "m.06c62",
            "m.09b93"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.06cmp)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Roman Empire ] )",
        "gold_entity_map": {
            "m.06cmp": "Roman Empire"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1234",
        "question": "which ocean does the murray river flow into",
        "comp_type": null,
        "answer": [
            "m.06nqw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_4l ns:geography.river.mouth ?x .\n?x ns:geography.geographical_feature.category ns:m.05kq4 .\n}\n",
        "sexpr": "(AND (JOIN geography.geographical_feature.category m.05kq4) (JOIN (R geography.river.mouth) m.04_4l))",
        "normed_sexpr": "( AND ( JOIN [ geography , geographical feature , category ] [ Ocean ] ) ( JOIN ( R [ geography , river , mouth ] ) [ Murray River ] ) )",
        "gold_entity_map": {
            "m.04_4l": "Murray River",
            "m.05kq4": "Ocean"
        },
        "gold_relation_map": {
            "geography.geographical_feature.category": "geography , geographical feature , category",
            "geography.river.mouth": "geography , river , mouth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1235",
        "question": "what time zone is cincinnati oh in",
        "comp_type": null,
        "answer": [
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01snm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01snm ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.01snm)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Cincinnati ] )",
        "gold_entity_map": {
            "m.01snm": "Cincinnati"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1238",
        "question": "what are west african countries",
        "comp_type": null,
        "answer": [
            "m.0164v",
            "m.01699",
            "m.02fdq",
            "m.035dk",
            "m.03676",
            "m.036b_",
            "m.04hzj",
            "m.04v09",
            "m.04vjh",
            "m.05cgv",
            "m.06s_2",
            "m.06srk",
            "m.07f5x",
            "m.0c3fp",
            "m.0fsfyj",
            "m.0fv4v",
            "m.0hdx8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hqjh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hqjh ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.0hqjh))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ West Africa ] ) )",
        "gold_entity_map": {
            "m.0hqjh": "West Africa",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-1240",
        "question": "where is mallorca",
        "comp_type": null,
        "answer": [
            "m.04swx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g52z ns:geography.island.body_of_water ?x .\n}\n",
        "sexpr": "(JOIN (R geography.island.body_of_water) m.0g52z)",
        "normed_sexpr": "( JOIN ( R [ geography , island , body of water ] ) [ Majorca ] )",
        "gold_entity_map": {
            "m.0g52z": "Majorca"
        },
        "gold_relation_map": {
            "geography.island.body_of_water": "geography , island , body of water"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1242",
        "question": "what years have the cubs been in the world series",
        "comp_type": null,
        "answer": [
            "m.04tg8s",
            "m.04tg9h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yjl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yjl ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.01yjl)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Chicago Cubs ] )",
        "gold_entity_map": {
            "m.01yjl": "Chicago Cubs"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1243",
        "question": "what car companies does ford motor company own",
        "comp_type": null,
        "answer": [
            "m.018ff1",
            "m.01q0ll",
            "m.02k_k3t",
            "m.098k2y",
            "m.0h5z7_s",
            "m.0vv3w28"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zs4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zs4 ns:automotive.company.make_s ?x .\n}\n",
        "sexpr": "(JOIN (R automotive.company.make_s) m.02zs4)",
        "normed_sexpr": "( JOIN ( R [ automotive , company , make s ] ) [ Ford Motor Company ] )",
        "gold_entity_map": {
            "m.02zs4": "Ford Motor Company"
        },
        "gold_relation_map": {
            "automotive.company.make_s": "automotive , company , make s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1245",
        "question": "what type of government does the bahamas",
        "comp_type": null,
        "answer": [
            "m.018wl5",
            "m.01fpfn",
            "m.01q20"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.0160w)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Bahamas ] )",
        "gold_entity_map": {
            "m.0160w": "Bahamas"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1249",
        "question": "what language do the people in ghana speak",
        "comp_type": null,
        "answer": [
            "m.02h40lc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035dk ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.035dk)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Ghana ] )",
        "gold_entity_map": {
            "m.035dk": "Ghana"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1250",
        "question": "where is luke afb arizona",
        "comp_type": null,
        "answer": [
            "m.0qplq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04twg5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04twg5 ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R location.location.street_address) m.04twg5))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ location , location , street address ] ) [ Luke Air Force Base ] ) )",
        "gold_entity_map": {
            "m.04twg5": "Luke Air Force Base"
        },
        "gold_relation_map": {
            "location.location.street_address": "location , location , street address",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1251",
        "question": "what language people speak in belgium",
        "comp_type": null,
        "answer": [
            "m.02bv9",
            "m.02drlb",
            "m.02y3v",
            "m.04306rv",
            "m.064_8sq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0154j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0154j ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0154j)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Belgium ] )",
        "gold_entity_map": {
            "m.0154j": "Belgium"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1255",
        "question": "what was lincoln 's wife 's name",
        "comp_type": null,
        "answer": [
            "m.01ypl0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.marriage.spouse) (JOIN (R people.person.spouse_s) m.0gzh)))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , marriage , spouse ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Abraham Lincoln ] ) ) )",
        "gold_entity_map": {
            "m.02zsn": "Female",
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "people.person.spouse_s": "people , person , spouse s",
            "people.person.gender": "people , person , gender",
            "people.marriage.spouse": "people , marriage , spouse"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1257",
        "question": "what did king george vi die of",
        "comp_type": null,
        "answer": [
            "m.04p3w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cm83)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cm83 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0cm83)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ George VI ] )",
        "gold_entity_map": {
            "m.0cm83": "George VI"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1258",
        "question": "what type of currency is used in the united kingdom",
        "comp_type": null,
        "answer": [
            "m.01nv4h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.07ssc)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ United Kingdom ] )",
        "gold_entity_map": {
            "m.07ssc": "United Kingdom"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    }
]