[
    {
        "ID": "WebQTrn-981",
        "question": "what does latin america consist of",
        "comp_type": null,
        "answer": [
            "m.0164b",
            "m.0165v",
            "m.016wzw",
            "m.01p1v",
            "m.01p8s",
            "m.027rn",
            "m.02k8k",
            "m.0345_",
            "m.03gyl",
            "m.03h2c",
            "m.05c74",
            "m.05qx1",
            "m.05r7t",
            "m.05v10",
            "m.07twz",
            "m.07ylj",
            "m.0b90_r",
            "m.0d04z6",
            "m.0jgd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04pnx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04pnx ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.04pnx))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Latin America ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.04pnx": "Latin America"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-982",
        "question": "who is the manager of the st louis cardinals",
        "comp_type": null,
        "answer": [
            "m.046gb9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06x68)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06x68 ns:baseball.baseball_team.current_manager ?x .\n}\n",
        "sexpr": "(JOIN (R baseball.baseball_team.current_manager) m.06x68)",
        "normed_sexpr": "( JOIN ( R [ baseball , baseball team , current manager ] ) [ St. Louis Cardinals ] )",
        "gold_entity_map": {
            "m.06x68": "St. Louis Cardinals"
        },
        "gold_relation_map": {
            "baseball.baseball_team.current_manager": "baseball , baseball team , current manager"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-983",
        "question": "where in oregon was stand by me filmed",
        "comp_type": null,
        "answer": [
            "m.05kj_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0m2kd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0m2kd ns:film.film.featured_film_locations ?x .\n}\n",
        "sexpr": "(JOIN (R film.film.featured_film_locations) m.0m2kd)",
        "normed_sexpr": "( JOIN ( R [ film , film , featured film locations ] ) [ Stand by Me ] )",
        "gold_entity_map": {
            "m.0m2kd": "Stand by Me"
        },
        "gold_relation_map": {
            "film.film.featured_film_locations": "film , film , featured film locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-985",
        "question": "what did writers of the harlem renaissance write about",
        "comp_type": null,
        "answer": [
            "m.0h2x8v6",
            "m.0hnx0cj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019y_2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019y_2 ns:book.book_subject.works ?x .\n?x ns:common.topic.notable_types ns:m.03jz7ls .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.03jz7ls) (JOIN (R book.book_subject.works) m.019y_2))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Written Work ] ) ( JOIN ( R [ book , book subject , works ] ) [ Harlem Renaissance ] ) )",
        "gold_entity_map": {
            "m.03jz7ls": "Written Work",
            "m.019y_2": "Harlem Renaissance"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "book.book_subject.works": "book , book subject , works"
        },
        "gold_type_map": {
            "m.03jz7ls": "Written Work"
        }
    },
    {
        "ID": "WebQTrn-989",
        "question": "where did prophet daniel died",
        "comp_type": null,
        "answer": [
            "m.01cyh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cts)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cts ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.02cts)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Daniel ] )",
        "gold_entity_map": {
            "m.02cts": "Daniel"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-990",
        "question": "what state was theodore roosevelt from",
        "comp_type": null,
        "answer": [
            "m.059rby"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.07hyk ns:people.person.place_of_birth ?y .\n\t?y ns:location.location.containedby ?x .\n\t?x ns:common.topic.notable_types ns:m.0kpys4 .  #US State\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0kpys4": "US State"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.0kpys4": "US State"
        }
    },
    {
        "ID": "WebQTrn-993",
        "question": "where did lebron james go to highschool",
        "comp_type": null,
        "answer": [
            "m.0gpg1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jz6d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jz6d ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.01jz6d))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ LeBron James ] ) )",
        "gold_entity_map": {
            "m.01jz6d": "LeBron James"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-995",
        "question": "where do the fla marlins play",
        "comp_type": null,
        "answer": [
            "m.04m_xv0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02__x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02__x ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.02__x)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Miami Marlins ] )",
        "gold_entity_map": {
            "m.02__x": "Miami Marlins"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-998",
        "question": "who was arthur miller father",
        "comp_type": null,
        "answer": [
            "m.0j72h2b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yfp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yfp ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.0yfp))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Arthur Miller ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.0yfp": "Arthur Miller"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-999",
        "question": "what influenced william morris to be an artist",
        "comp_type": null,
        "answer": [
            "m.0k5mt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08304)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08304 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.08304)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ William Morris ] )",
        "gold_entity_map": {
            "m.08304": "William Morris"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1001",
        "question": "what super bowls have the giants won",
        "comp_type": null,
        "answer": [
            "m.043t_rh",
            "m.04myq1",
            "m.076sw",
            "m.076v7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gg4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gg4 ns:sports.sports_team.championships ?x .\n?x ns:common.topic.notable_types ns:m.01xljv1 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01xljv1) (JOIN (R sports.sports_team.championships) m.05gg4))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Super bowl ] ) ( JOIN ( R [ sports , sports team , championships ] ) [ New York Giants ] ) )",
        "gold_entity_map": {
            "m.05gg4": "New York Giants",
            "m.01xljv1": "Super bowl"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {
            "m.01xljv1": "Super bowl"
        }
    },
    {
        "ID": "WebQTrn-1002",
        "question": "where was rod stewart born",
        "comp_type": null,
        "answer": [
            "m.0n9_t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qf11)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qf11 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0qf11)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Rod Stewart ] )",
        "gold_entity_map": {
            "m.0qf11": "Rod Stewart"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1006",
        "question": "who played eowyn in the lord of the rings movies",
        "comp_type": null,
        "answer": [
            "m.0294fd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gynx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gynx ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0gynx))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Éowyn ] ) )",
        "gold_entity_map": {
            "m.0gynx": "Éowyn"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1012",
        "question": "what timezone is minneapolis in",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fpzwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fpzwf ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0fpzwf)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Minneapolis ] )",
        "gold_entity_map": {
            "m.0fpzwf": "Minneapolis"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1013",
        "question": "who is aidan davis",
        "comp_type": null,
        "answer": [
            "m.015cjr",
            "m.02h6p92"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080p6xw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.080p6xw ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.080p6xw)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Aidan Davis ] )",
        "gold_entity_map": {
            "m.080p6xw": "Aidan Davis"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1015",
        "question": "what was nicolaus copernicus occupation",
        "comp_type": null,
        "answer": [
            "m.04s2z",
            "m.05t4q",
            "m.080ntlp",
            "m.0frz0",
            "m.0h9c",
            "m.0n1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vvm4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vvm4 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01vvm4)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Nicolaus Copernicus ] )",
        "gold_entity_map": {
            "m.01vvm4": "Nicolaus Copernicus"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1016",
        "question": "what did richard arkwright contribute to the industrial revolution",
        "comp_type": null,
        "answer": [
            "m.03lqnn",
            "m.052wmn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tglh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tglh ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.01tglh)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ Richard Arkwright ] )",
        "gold_entity_map": {
            "m.01tglh": "Richard Arkwright"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1017",
        "question": "what kind of currency does greece have",
        "comp_type": null,
        "answer": [
            "m.02l6h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.035qy)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Greece ] )",
        "gold_entity_map": {
            "m.035qy": "Greece"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1019",
        "question": "where is the mozambique located",
        "comp_type": null,
        "answer": [
            "m.0dg3n1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wlh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wlh ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.04wlh)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Mozambique ] )",
        "gold_entity_map": {
            "m.04wlh": "Mozambique"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1022",
        "question": "where is azerbaijan",
        "comp_type": null,
        "answer": [
            "m.02qkt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jhd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jhd ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0jhd)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Azerbaijan ] )",
        "gold_entity_map": {
            "m.0jhd": "Azerbaijan"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1023",
        "question": "what is the money of argentina called",
        "comp_type": null,
        "answer": [
            "m.024nzm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgd ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0jgd)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Argentina ] )",
        "gold_entity_map": {
            "m.0jgd": "Argentina"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1025",
        "question": "what did bella abzug do",
        "comp_type": null,
        "answer": [
            "m.02hrh1q",
            "m.04gc2",
            "m.04hx60",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02dqgj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02dqgj ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02dqgj)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Bella Abzug ] )",
        "gold_entity_map": {
            "m.02dqgj": "Bella Abzug"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1029",
        "question": "what films did hans zimmer wrote music for",
        "comp_type": null,
        "answer": [
            "m.010ql3wb",
            "m.011q3zfx",
            "m.011yn5",
            "m.011ysn",
            "m.0134tnr7",
            "m.01dr_t",
            "m.01h7bb",
            "m.01sbv9",
            "m.01sr58",
            "m.01xbxn",
            "m.02_nsc",
            "m.025hhq",
            "m.026390q",
            "m.026t9c8",
            "m.026x6wh",
            "m.027q4dg",
            "m.027wss6",
            "m.028xq_",
            "m.02b61v",
            "m.02ctc6",
            "m.02d6rv",
            "m.02fqrf",
            "m.02g_hn",
            "m.02lgqm",
            "m.02ndy4",
            "m.02qm12w",
            "m.02t9_q",
            "m.02vpqrg",
            "m.02vqsll",
            "m.02vws41",
            "m.02wz4gh",
            "m.02xs6_",
            "m.032kr9",
            "m.033t6r",
            "m.034c5l",
            "m.034r25",
            "m.034scm",
            "m.03cqk46",
            "m.03czjgz",
            "m.03mbdgx",
            "m.03qn9mh",
            "m.03r6q1",
            "m.03y0pn",
            "m.03ydlnj",
            "m.03zq94",
            "m.03zyv4",
            "m.0404hcg",
            "m.043frw",
            "m.048r2p",
            "m.04ld_2x",
            "m.04n52p6",
            "m.04p7q_",
            "m.04sg0b",
            "m.04w6zk",
            "m.04y973w",
            "m.050f0s",
            "m.050r7y",
            "m.050t99",
            "m.05229c_",
            "m.05351g",
            "m.057hp_",
            "m.05c26ss",
            "m.05msvb",
            "m.05my6fq",
            "m.05nlx4",
            "m.05p0r3",
            "m.05p7w6k",
            "m.05zmvfm",
            "m.065dc4",
            "m.0661ql3",
            "m.06kt1h",
            "m.06w3k_d",
            "m.06w99h3",
            "m.06ztvyx",
            "m.076tq0z",
            "m.07799g",
            "m.07bx6",
            "m.07dvy7",
            "m.07g_0c",
            "m.07m8jl",
            "m.07q36g",
            "m.0830vk",
            "m.08fgrq",
            "m.09146g",
            "m.09jqv1",
            "m.09q5w2",
            "m.09v8clw",
            "m.0b3n61",
            "m.0bcyw8",
            "m.0bdtgcx",
            "m.0bf2sc2",
            "m.0blfnd",
            "m.0bpm4yw",
            "m.0bq8tr",
            "m.0btpm6",
            "m.0bys_y",
            "m.0c03gcc",
            "m.0c1srs",
            "m.0c3_662",
            "m.0c3nc",
            "m.0cxk__",
            "m.0db1b1",
            "m.0dfs0g",
            "m.0dgn_m8",
            "m.0dgnshx",
            "m.0dllh33",
            "m.0dlngsd",
            "m.0dsf7lf",
            "m.0dz1fd",
            "m.0f4_2k",
            "m.0fb9lq",
            "m.0fkf28",
            "m.0fq0q4y",
            "m.0fq0sz9",
            "m.0fz8lt",
            "m.0gg93m9",
            "m.0gjc4d3",
            "m.0gxsh2h",
            "m.0gy0n",
            "m.0gy75pd",
            "m.0gygd3k",
            "m.0h_9d31",
            "m.0h32y7j",
            "m.0h3x7zx",
            "m.0hr6gzw",
            "m.0j8k5p0",
            "m.0jwqy50",
            "m.0k8s6n5",
            "m.0m63c",
            "m.0ndw6pb",
            "m.0nffcbb",
            "m.0pc62",
            "m.0qkv9wb",
            "m.0qm8b",
            "m.0v93qv0",
            "m.0wrshm2",
            "m.0x0v5mf",
            "m.0x2b7sf",
            "m.0ywyv3z",
            "m.0yx_w",
            "m.0yyts"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0150t6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0150t6 ns:film.music_contributor.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.music_contributor.film) m.0150t6)",
        "normed_sexpr": "( JOIN ( R [ film , music contributor , film ] ) [ Hans Zimmer ] )",
        "gold_entity_map": {
            "m.0150t6": "Hans Zimmer"
        },
        "gold_relation_map": {
            "film.music_contributor.film": "film , music contributor , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1030",
        "question": "where was alice paul born",
        "comp_type": null,
        "answer": [
            "m.0xl8s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lp71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lp71 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02lp71)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Alice Stokes Paul ] )",
        "gold_entity_map": {
            "m.02lp71": "Alice Stokes Paul"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1031",
        "question": "what did john quincy adams died of",
        "comp_type": null,
        "answer": [
            "m.08g5q7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_nq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_nq ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.03_nq)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ John Quincy Adams ] )",
        "gold_entity_map": {
            "m.03_nq": "John Quincy Adams"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1037",
        "question": "who is raquel welch 's daughter",
        "comp_type": null,
        "answer": [
            "m.03tgq6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012s5j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012s5j ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.children) m.012s5j))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , children ] ) [ Raquel Welch ] ) )",
        "gold_entity_map": {
            "m.02zsn": "Female",
            "m.012s5j": "Raquel Welch"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1041",
        "question": "what money is used in the maldives",
        "comp_type": null,
        "answer": [
            "m.02gsxf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ty8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ty8 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.04ty8)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Maldives ] )",
        "gold_entity_map": {
            "m.04ty8": "Maldives"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1043",
        "question": "where does mike leach coach",
        "comp_type": null,
        "answer": [
            "m.026cmdc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08gnpj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08gnpj ns:american_football.football_coach.current_team_head_coached ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_coach.current_team_head_coached) m.08gnpj)",
        "normed_sexpr": "( JOIN ( R [ american football , football coach , current team head coached ] ) [ Mike Leach ] )",
        "gold_entity_map": {
            "m.08gnpj": "Mike Leach"
        },
        "gold_relation_map": {
            "american_football.football_coach.current_team_head_coached": "american football , football coach , current team head coached"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1045",
        "question": "what condition does michael j fox have",
        "comp_type": null,
        "answer": [
            "m.0g02vk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hz_1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hz_1 ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.0hz_1)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Michael J. Fox ] )",
        "gold_entity_map": {
            "m.0hz_1": "Michael J. Fox"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1046",
        "question": "where did jrr tolkien live",
        "comp_type": null,
        "answer": [
            "m.0k33p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041h0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041h0 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.041h0))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ J. R. R. Tolkien ] ) )",
        "gold_entity_map": {
            "m.041h0": "J. R. R. Tolkien"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    }
]