[
    {
        "ID": "WebQTrn-1134",
        "question": "where is port lavaca tx",
        "comp_type": null,
        "answer": [
            "m.0msd9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_z4x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_z4x ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0_z4x)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Port Lavaca ] )",
        "gold_entity_map": {
            "m.0_z4x": "Port Lavaca"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1136",
        "question": "what kind of books does nicholas sparks wrote",
        "comp_type": null,
        "answer": [
            "m.014dfn",
            "m.01qxvh",
            "m.02822",
            "m.02xlf",
            "m.05hgj",
            "m.082gq",
            "m.0c3351",
            "m.0fx2s",
            "m.0hc1z"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  ns:m.0328bl ns:book.author.works_written ?y . # Nicholas Sparks\n  ?y ns:book.book.genre ?x . \n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0328bl": "Nicholas Sparks"
        },
        "gold_relation_map": {
            "book.book.genre": "book , book , genre",
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1138",
        "question": "what countries has spanish as their official language",
        "comp_type": null,
        "answer": [
            "m.0165v",
            "m.016wzw",
            "m.01ls2",
            "m.01p1v",
            "m.01p8s",
            "m.01s47p",
            "m.027rn",
            "m.02k1b",
            "m.02k8k",
            "m.02kcz",
            "m.0345_",
            "m.03h2c",
            "m.0417l2t",
            "m.04lglk0",
            "m.05byy",
            "m.05c74",
            "m.05qx1",
            "m.05r7t",
            "m.05v10",
            "m.06mkj",
            "m.07twz",
            "m.07ylj",
            "m.0d04z6",
            "m.0gn8n",
            "m.0jgd"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ?x ns:location.country.official_language ns:m.06nm1 . # Spanish language\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.06nm1": "Spanish Language"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1141",
        "question": "what business does raj kundra do",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.01d_h8",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09k687g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09k687g ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.09k687g)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Raj Kundra ] )",
        "gold_entity_map": {
            "m.09k687g": "Raj Kundra"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1142",
        "question": "what movies is molly ringwald in",
        "comp_type": null,
        "answer": [
            "m.0_yhrr2",
            "m.010cn719",
            "m.011v9f35",
            "m.0131kchr",
            "m.01mr4c",
            "m.027lcnq",
            "m.027p1_v",
            "m.02bg6w",
            "m.02z1r_c",
            "m.02z4r3w",
            "m.032xrj",
            "m.03bxbk",
            "m.03cc4f1",
            "m.03hnq1p",
            "m.03j0jy",
            "m.04bb7p",
            "m.04j0xrf",
            "m.04j1g1n",
            "m.04j1xh2",
            "m.04j28vl",
            "m.04j2trm",
            "m.04j2xz3",
            "m.0502pc",
            "m.057jzt",
            "m.05mkgd",
            "m.069stz",
            "m.06vgnr",
            "m.07cfg",
            "m.082l0k",
            "m.08wry6",
            "m.09fc83",
            "m.0b80p38",
            "m.0cfw7m_",
            "m.0cprpb",
            "m.0crt1yx",
            "m.0crvk7p",
            "m.0f3wxj",
            "m.0gkrfsx",
            "m.0gksbfh",
            "m.0h12vrm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wq0_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wq0_s ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.01wq0_s))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Molly Ringwald ] ) )",
        "gold_entity_map": {
            "m.01wq0_s": "Molly Ringwald"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1148",
        "question": "what is the northeast of the united states",
        "comp_type": null,
        "answer": [
            "m.0248gz",
            "m.029jpy",
            "m.050ks",
            "m.059f4",
            "m.06btq",
            "m.0hz35",
            "m.0n5yh",
            "m.0xhjk",
            "m.0xhkl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rjr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rjr ns:location.location.contains ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.contains) m.027rjr)",
        "normed_sexpr": "( JOIN ( R [ location , location , contains ] ) [ Northeastern United States ] )",
        "gold_entity_map": {
            "m.027rjr": "Northeastern United States"
        },
        "gold_relation_map": {
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1156",
        "question": "what state did george washington live in",
        "comp_type": null,
        "answer": [
            "m.059rby",
            "m.05tbn",
            "m.07z1m"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  ns:m.034rd ns:people.person.places_lived ?y .\n  ?y ns:people.place_lived.location ?z .\n  ?z ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.0kpys4 .  #US State\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0kpys4": "US State",
            "m.034rd": "George Washington"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {
            "m.0kpys4": "US State"
        }
    },
    {
        "ID": "WebQTrn-1157",
        "question": "where is mount vernon virginia",
        "comp_type": null,
        "answer": [
            "m.0mnz0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.010m5w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.010m5w ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.010m5w)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Mount Vernon ] )",
        "gold_entity_map": {
            "m.010m5w": "Mount Vernon"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1158",
        "question": "where is kia car from",
        "comp_type": null,
        "answer": [
            "m.06qd3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cytr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cytr ns:organization.organization.place_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.place_founded) m.01cytr)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , place founded ] ) [ Kia Motors ] )",
        "gold_entity_map": {
            "m.01cytr": "Kia Motors"
        },
        "gold_relation_map": {
            "organization.organization.place_founded": "organization , organization , place founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1161",
        "question": "where do the kansas city chiefs play",
        "comp_type": null,
        "answer": [
            "m.04f_d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0487_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0487_ ns:sports.sports_team.location ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.location) m.0487_)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , location ] ) [ Kansas City Chiefs ] )",
        "gold_entity_map": {
            "m.0487_": "Kansas City Chiefs"
        },
        "gold_relation_map": {
            "sports.sports_team.location": "sports , sports team , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1162",
        "question": "what countries does the mississippi river run through",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yf_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yf_ ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.containedby) m.04yf_))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , containedby ] ) [ Mississippi River ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.04yf_": "Mississippi River"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-1163",
        "question": "in what modern country is the yucatan peninsula located",
        "comp_type": null,
        "answer": [
            "m.0b90_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lzs8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lzs8 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.containedby) m.04lzs8))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , containedby ] ) [ Yucatán Peninsula ] ) )",
        "gold_entity_map": {
            "m.04lzs8": "Yucatán Peninsula",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-1164",
        "question": "what does starbucks sell",
        "comp_type": null,
        "answer": [
            "m.01_6hg",
            "m.01fb_0",
            "m.01z1bzt",
            "m.01z1jf2",
            "m.02wv6th"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.018c_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.018c_r ns:dining.restaurant.cuisine ?x .\n}\n",
        "sexpr": "(JOIN (R dining.restaurant.cuisine) m.018c_r)",
        "normed_sexpr": "( JOIN ( R [ dining , restaurant , cuisine ] ) [ Starbucks ] )",
        "gold_entity_map": {
            "m.018c_r": "Starbucks"
        },
        "gold_relation_map": {
            "dining.restaurant.cuisine": "dining , restaurant , cuisine"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1165",
        "question": "who is lincoln steffens",
        "comp_type": null,
        "answer": [
            "m.0d8qb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bw1c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bw1c ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01bw1c)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Lincoln Steffens ] )",
        "gold_entity_map": {
            "m.01bw1c": "Lincoln Steffens"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1168",
        "question": "what are all the movies channing tatum has been in",
        "comp_type": null,
        "answer": [
            "m.0_4654w",
            "m.0125kvm9",
            "m.028bfsc",
            "m.02mmwk",
            "m.02r4475",
            "m.02z242q",
            "m.03gwvd7",
            "m.03qcfvw",
            "m.04xx9s",
            "m.05b08zq",
            "m.05b2s45",
            "m.06z1ht",
            "m.07k88kp",
            "m.07mj6x",
            "m.0818gg",
            "m.0b_rqq",
            "m.0b73wst",
            "m.0bq8tmw",
            "m.0c3_662",
            "m.0c40vxk",
            "m.0czcycf",
            "m.0dscrwf",
            "m.0f93zm",
            "m.0fq33vs",
            "m.0g3zrd",
            "m.0g55blx",
            "m.0gwlfnb",
            "m.0gy_8n",
            "m.0h_f20b",
            "m.0h63gl9",
            "m.0hz4j2j",
            "m.0kd0k5k",
            "m.0n4blqr",
            "m.0n4g1dj",
            "m.0n8yg3l",
            "m.0t513_x",
            "m.0v_w91n",
            "m.0v_w9cw",
            "m.0y4jvvn",
            "m.0ynxx40"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06lvlf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06lvlf ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.06lvlf))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Channing Tatum ] ) )",
        "gold_entity_map": {
            "m.06lvlf": "Channing Tatum"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1169",
        "question": "where is the country of panama located",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qx1 ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.05qx1)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Panama ] )",
        "gold_entity_map": {
            "m.05qx1": "Panama"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1172",
        "question": "where is university of alabama located",
        "comp_type": null,
        "answer": [
            "m.09c7w0",
            "m.0gyh",
            "m.0qc7l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wdl3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wdl3 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01wdl3)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ University of Alabama ] )",
        "gold_entity_map": {
            "m.01wdl3": "University of Alabama"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1173",
        "question": "who was arthur miller influenced by",
        "comp_type": null,
        "answer": [
            "m.03pm9",
            "m.06pzl",
            "m.081k8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yfp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yfp ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.0yfp)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Arthur Miller ] )",
        "gold_entity_map": {
            "m.0yfp": "Arthur Miller"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1175",
        "question": "where is el salvador located",
        "comp_type": null,
        "answer": [
            "m.01tzh",
            "m.04pnx",
            "m.059g4",
            "m.07c5l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k8k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k8k ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.02k8k)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ El Salvador ] )",
        "gold_entity_map": {
            "m.02k8k": "El Salvador"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1176",
        "question": "what year was kevin durant drafted",
        "comp_type": null,
        "answer": [
            "m.0f4vx0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gxrc1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gxrc1 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.0gxrc1))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Kevin Durant ] ) )",
        "gold_entity_map": {
            "m.0gxrc1": "Kevin Durant"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1179",
        "question": "what happened to nina simone",
        "comp_type": null,
        "answer": [
            "m.0j8hd",
            "m.0qcr0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03f3_p3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03f3_p3 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.03f3_p3)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Nina Simone ] )",
        "gold_entity_map": {
            "m.03f3_p3": "Nina Simone"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1180",
        "question": "where is wellsville missouri",
        "comp_type": null,
        "answer": [
            "m.04ych",
            "m.09c7w0",
            "m.0fwvj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wy41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wy41 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0wy41)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Wellsville ] )",
        "gold_entity_map": {
            "m.0wy41": "Wellsville"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1182",
        "question": "who is the current queen of australia",
        "comp_type": null,
        "answer": [
            "m.0d1_f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:royalty.kingdom.rulers ?x .\n?x ns:common.topic.notable_types ns:m.04fnrhx .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.04fnrhx) (JOIN (R royalty.kingdom.rulers) m.0chghy))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Monarch ] ) ( JOIN ( R [ royalty , kingdom , rulers ] ) [ Australia ] ) )",
        "gold_entity_map": {
            "m.04fnrhx": "Monarch",
            "m.0chghy": "Australia"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "royalty.kingdom.rulers": "royalty , kingdom , rulers"
        },
        "gold_type_map": {
            "m.04fnrhx": "Monarch"
        }
    },
    {
        "ID": "WebQTrn-1183",
        "question": "where did galileo go to school",
        "comp_type": null,
        "answer": [
            "m.02bbyw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034ks)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034ks ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.034ks))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Galileo Galilei ] ) )",
        "gold_entity_map": {
            "m.034ks": "Galileo Galilei"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1185",
        "question": "who did david villa play for",
        "comp_type": null,
        "answer": [
            "m.0270my1",
            "m.02w64f",
            "m.03wftzq",
            "m.07kbtr4",
            "m.080_y",
            "m.0hvgt",
            "m.0kr10",
            "m.0lg7v",
            "m.0lhp1",
            "m.0t_f17t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08zpzz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08zpzz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.08zpzz))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ David Villa ] ) )",
        "gold_entity_map": {
            "m.08zpzz": "David Villa"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1187",
        "question": "what 's jamaica country code",
        "comp_type": null,
        "answer": [
            "jm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_r3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_r3 ns:base.aareas.schema.administrative_area.short_name ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.short_name) m.03_r3)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , short name ] ) [ Jamaica ] )",
        "gold_entity_map": {
            "m.03_r3": "Jamaica"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.short_name": "base , aareas , schema , administrative area , short name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1188",
        "question": "where robert frost went to school",
        "comp_type": null,
        "answer": [
            "m.02bqy",
            "m.03ksy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06gq_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06gq_ ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.06gq_))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Robert Frost ] ) )",
        "gold_entity_map": {
            "m.06gq_": "Robert Frost"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1191",
        "question": "what county is plainfield il in",
        "comp_type": null,
        "answer": [
            "m.0l3kx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sjdw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sjdw ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0sjdw)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Plainfield ] )",
        "gold_entity_map": {
            "m.0sjdw": "Plainfield"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1192",
        "question": "what country is the mekong river located in",
        "comp_type": null,
        "answer": [
            "m.01crd5",
            "m.01xbgx",
            "m.04hhv",
            "m.04xn_",
            "m.07f1x",
            "m.0d05w3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j0g5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j0g5 ns:location.location.partially_containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.partially_containedby) m.0j0g5)",
        "normed_sexpr": "( JOIN ( R [ location , location , partially containedby ] ) [ Mekong ] )",
        "gold_entity_map": {
            "m.0j0g5": "Mekong"
        },
        "gold_relation_map": {
            "location.location.partially_containedby": "location , location , partially containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1193",
        "question": "who founded the sisters of saint joseph",
        "comp_type": null,
        "answer": [
            "m.06jb6m",
            "m.06jc3_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06jc5d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06jc5d ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.06jc5d)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Sisters of St. Joseph ] )",
        "gold_entity_map": {
            "m.06jc5d": "Sisters of St. Joseph"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1194",
        "question": "who shot and killed president john f kennedy",
        "comp_type": null,
        "answer": [
            "m.04gwy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n",
        "sexpr": "(JOIN (R user.alexander.misc.murdered_person.murdered_by) m.0d3k14)",
        "normed_sexpr": "( JOIN ( R [ user , alexander , misc , murdered person , murdered by ] ) [ John F. Kennedy ] )",
        "gold_entity_map": {
            "m.0d3k14": "John F. Kennedy"
        },
        "gold_relation_map": {
            "user.alexander.misc.murdered_person.murdered_by": "user , alexander , misc , murdered person , murdered by"
        },
        "gold_type_map": {}
    }
]