[
    {
        "ID": "WebQTrn-1970",
        "question": "what did samuel de champlain",
        "comp_type": null,
        "answer": [
            "m.016wtf",
            "m.023nrw",
            "m.099md"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09r57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09r57 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.09r57)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Samuel de Champlain ] )",
        "gold_entity_map": {
            "m.09r57": "Samuel de Champlain"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1971",
        "question": "what was william faulkner known for",
        "comp_type": null,
        "answer": [
            "m.02xhgwq",
            "m.0cbd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084w8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084w8 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.084w8)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ William Faulkner ] )",
        "gold_entity_map": {
            "m.084w8": "William Faulkner"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1972",
        "question": "what language did the miwok indians speak",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.05tbtz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02l_wv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02l_wv ns:people.ethnicity.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.languages_spoken) m.02l_wv)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Miwok ] )",
        "gold_entity_map": {
            "m.02l_wv": "Miwok"
        },
        "gold_relation_map": {
            "people.ethnicity.languages_spoken": "people , ethnicity , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1974",
        "question": "who were queen elizabeth 1 parents",
        "comp_type": null,
        "answer": [
            "m.03p77",
            "m.09sxn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rg_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rg_ ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.02rg_)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Elizabeth I of England ] )",
        "gold_entity_map": {
            "m.02rg_": "Elizabeth I of England"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1976",
        "question": "what did robert koch do",
        "comp_type": null,
        "answer": [
            "m.05t4q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03kpt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03kpt ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03kpt)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Robert Koch ] )",
        "gold_entity_map": {
            "m.03kpt": "Robert Koch"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1979",
        "question": "who 's betty white",
        "comp_type": null,
        "answer": [
            "m.015cjr",
            "m.018gz8",
            "m.02hrh1q",
            "m.03gjzk",
            "m.09l65",
            "m.0cbd2",
            "m.0dypbr",
            "m.0kyk",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.025mb_)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Betty White ] )",
        "gold_entity_map": {
            "m.025mb_": "Betty White"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1981",
        "question": "who is lleyton hewitt",
        "comp_type": null,
        "answer": [
            "m.02xhr73"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04k1p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04k1p ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.04k1p)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Lleyton Hewitt ] )",
        "gold_entity_map": {
            "m.04k1p": "Lleyton Hewitt"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1982",
        "question": "what movies did quentin tarantino star in",
        "comp_type": null,
        "answer": [
            "m.01rxyb",
            "m.0234j5",
            "m.026tqdb",
            "m.026zsft",
            "m.027tf87",
            "m.029k4p",
            "m.02h4658",
            "m.02pg45",
            "m.02qb14n",
            "m.02yvct",
            "m.02zkjw",
            "m.03bxrfl",
            "m.03bxrfz",
            "m.03z20c",
            "m.04j1mv4",
            "m.04jr__",
            "m.04jryv",
            "m.04jrzl",
            "m.051rk5c",
            "m.0569lx",
            "m.084qpk",
            "m.0b6j4zh",
            "m.0cs1gzj",
            "m.0f4_l",
            "m.0gjtfm",
            "m.0gwjw0c",
            "m.0gyv0b4",
            "m.0rph0cf",
            "m.0w29lz2",
            "m.0w4hwpv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0693l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0693l ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0693l))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Quentin Tarantino ] ) )",
        "gold_entity_map": {
            "m.0693l": "Quentin Tarantino"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1983",
        "question": "what language does the new zealand speak",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.03t17x",
            "m.0dds9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ctw_b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ctw_b ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.0ctw_b)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ New Zealand ] )",
        "gold_entity_map": {
            "m.0ctw_b": "New Zealand"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1987",
        "question": "what county is sacramento located in",
        "comp_type": null,
        "answer": [
            "m.0bxqq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07bcn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07bcn ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.07bcn)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Sacramento ] )",
        "gold_entity_map": {
            "m.07bcn": "Sacramento"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1988",
        "question": "what did audrey hepburn died of",
        "comp_type": null,
        "answer": [
            "m.0fb2z2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dqcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dqcm ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0dqcm)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Audrey Hepburn ] )",
        "gold_entity_map": {
            "m.0dqcm": "Audrey Hepburn"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1989",
        "question": "what country was the treaty of versailles written",
        "comp_type": null,
        "answer": [
            "m.05qtj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07d4d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07d4d ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.07d4d)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Treaty of Versailles ] )",
        "gold_entity_map": {
            "m.07d4d": "Treaty of Versailles"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1990",
        "question": "what is st mary mascot",
        "comp_type": null,
        "answer": [
            "m.05k68lf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tntf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tntf ns:education.educational_institution.mascot ?x .\n}\n",
        "sexpr": "(JOIN (R education.educational_institution.mascot) m.01tntf)",
        "normed_sexpr": "( JOIN ( R [ education , educational institution , mascot ] ) [ Saint Mary's College of California ] )",
        "gold_entity_map": {
            "m.01tntf": "Saint Mary's College of California"
        },
        "gold_relation_map": {
            "education.educational_institution.mascot": "education , educational institution , mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1991",
        "question": "who was irving berlin and what did he do",
        "comp_type": null,
        "answer": [
            "m.01c72t",
            "m.025352",
            "m.02hrh1q",
            "m.04l1gwb",
            "m.0nbcg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cyhq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cyhq ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0cyhq)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Irving Berlin ] )",
        "gold_entity_map": {
            "m.0cyhq": "Irving Berlin"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1992",
        "question": "who shot j lennon",
        "comp_type": null,
        "answer": [
            "m.01p64f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n",
        "sexpr": "(JOIN (R user.alexander.misc.murdered_person.murdered_by) m.01vsl3_)",
        "normed_sexpr": "( JOIN ( R [ user , alexander , misc , murdered person , murdered by ] ) [ John Lennon ] )",
        "gold_entity_map": {
            "m.01vsl3_": "John Lennon"
        },
        "gold_relation_map": {
            "user.alexander.misc.murdered_person.murdered_by": "user , alexander , misc , murdered person , murdered by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1994",
        "question": "where is the denver broncos stadium located",
        "comp_type": null,
        "answer": [
            "m.02hxv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0289q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0289q ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.0289q)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Denver Broncos ] )",
        "gold_entity_map": {
            "m.0289q": "Denver Broncos"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1995",
        "question": "where did sir ernest shackleton live",
        "comp_type": null,
        "answer": [
            "m.0ng8v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbcz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbcz ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0gbcz))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Sir Ernest Shackleton ] ) )",
        "gold_entity_map": {
            "m.0gbcz": "Sir Ernest Shackleton"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1997",
        "question": "where did the welsh language originate from",
        "comp_type": null,
        "answer": [
            "m.05tjlvr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083tk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083tk ns:base.rosetta.languoid.parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.rosetta.languoid.parent) m.083tk)",
        "normed_sexpr": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Welsh Language ] )",
        "gold_entity_map": {
            "m.083tk": "Welsh Language"
        },
        "gold_relation_map": {
            "base.rosetta.languoid.parent": "base , rosetta , languoid , parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2002",
        "question": "what was theodore roosevelt 's political party",
        "comp_type": null,
        "answer": [
            "m.07wbk",
            "m.0b9lfp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hyk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hyk ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.07hyk))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Theodore Roosevelt ] ) )",
        "gold_entity_map": {
            "m.07hyk": "Theodore Roosevelt"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2003",
        "question": "what year were the cincinnati reds founded",
        "comp_type": null,
        "answer": [
            "1881"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ypc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ypc ns:sports.sports_team.founded ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.founded) m.01ypc)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , founded ] ) [ Cincinnati Reds ] )",
        "gold_entity_map": {
            "m.01ypc": "Cincinnati Reds"
        },
        "gold_relation_map": {
            "sports.sports_team.founded": "sports , sports team , founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2004",
        "question": "where ulysses s grant go to school",
        "comp_type": null,
        "answer": [
            "m.07x4c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07t2k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07t2k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.07t2k))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Ulysses S. Grant ] ) )",
        "gold_entity_map": {
            "m.07t2k": "Ulysses S. Grant"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2006",
        "question": "what magazine did edgar allan poe work for",
        "comp_type": null,
        "answer": [
            "m.0282h9k",
            "m.0285kdq",
            "m.028b1d9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lt8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lt8 ns:book.periodical_editor.periodicals_edited ?y .\n?y ns:book.editorial_tenure.periodical ?x .\n}\n",
        "sexpr": "(JOIN (R book.editorial_tenure.periodical) (JOIN (R book.periodical_editor.periodicals_edited) m.02lt8))",
        "normed_sexpr": "( JOIN ( R [ book , editorial tenure , periodical ] ) ( JOIN ( R [ book , periodical editor , periodicals edited ] ) [ Edgar Allan Poe ] ) )",
        "gold_entity_map": {
            "m.02lt8": "Edgar Allan Poe"
        },
        "gold_relation_map": {
            "book.editorial_tenure.periodical": "book , editorial tenure , periodical",
            "book.periodical_editor.periodicals_edited": "book , periodical editor , periodicals edited"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2008",
        "question": "where did chickasaw indians live",
        "comp_type": null,
        "answer": [
            "m.05mph"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0n0y5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0n0y5 ns:people.ethnicity.geographic_distribution ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.geographic_distribution) m.0n0y5)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Chickasaw ] )",
        "gold_entity_map": {
            "m.0n0y5": "Chickasaw"
        },
        "gold_relation_map": {
            "people.ethnicity.geographic_distribution": "people , ethnicity , geographic distribution"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2012",
        "question": "what is the timezone in vancouver",
        "comp_type": null,
        "answer": [
            "m.02lcqs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ckhc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ckhc ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0ckhc)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Vancouver ] )",
        "gold_entity_map": {
            "m.0ckhc": "Vancouver"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2013",
        "question": "what time is world cup soccer",
        "comp_type": null,
        "answer": [
            "m.02sjt6q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.030q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.030q7 ns:user.gogza.default_domain.recurring_event.recurrance_period ?x .\n}\n",
        "sexpr": "(JOIN (R user.gogza.default_domain.recurring_event.recurrance_period) m.030q7)",
        "normed_sexpr": "( JOIN ( R [ user , gogza , default domain , recurring event , recurrance period ] ) [ FIFA World Cup ] )",
        "gold_entity_map": {
            "m.030q7": "FIFA World Cup"
        },
        "gold_relation_map": {
            "user.gogza.default_domain.recurring_event.recurrance_period": "user , gogza , default domain , recurring event , recurrance period"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2014",
        "question": "what county is stockton ca located in",
        "comp_type": null,
        "answer": [
            "m.0l2sr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pc56)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pc56 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0pc56)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Stockton ] )",
        "gold_entity_map": {
            "m.0pc56": "Stockton"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2015",
        "question": "what did ronnie radke do",
        "comp_type": null,
        "answer": [
            "m.016z4k",
            "m.09jwl",
            "m.0hpcdn2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ql6bk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ql6bk ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02ql6bk)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Ronnie Radke ] )",
        "gold_entity_map": {
            "m.02ql6bk": "Ronnie Radke"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2018",
        "question": "what form of government does czech republic have",
        "comp_type": null,
        "answer": [
            "m.0glnsx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mjq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mjq ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.01mjq)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Czech Republic ] )",
        "gold_entity_map": {
            "m.01mjq": "Czech Republic"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2020",
        "question": "what was eli whitney education",
        "comp_type": null,
        "answer": [
            "m.01fpvz",
            "m.05zxrds"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.02ncr))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Eli Whitney ] ) )",
        "gold_entity_map": {
            "m.02ncr": "Eli Whitney"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2021",
        "question": "what movies has renee zellweger been in",
        "comp_type": null,
        "answer": [
            "g.11b6dw34dy",
            "m.0114j189",
            "m.011ykb",
            "m.01cmp9",
            "m.01xbxn",
            "m.01z7v5",
            "m.027nr4g",
            "m.0288083",
            "m.02cbhg",
            "m.02j69w",
            "m.02qqs_k",
            "m.03_njz",
            "m.036qtd",
            "m.03cp2z2",
            "m.03hl_76",
            "m.03m71s1",
            "m.03nnsy",
            "m.040044",
            "m.04b7hj",
            "m.04c11j",
            "m.04f46k7",
            "m.04jw07",
            "m.04ycv_f",
            "m.050gkf",
            "m.057hp_",
            "m.05cbyms",
            "m.05mq_gq",
            "m.05vxdh",
            "m.06039f",
            "m.080bbt",
            "m.087m22",
            "m.09z8d1",
            "m.0b3_lr",
            "m.0b921t",
            "m.0bb20p",
            "m.0cdnx1",
            "m.0dy2m2",
            "m.0nfvs0m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01c_zw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01c_zw ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.01c_zw))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Renée Zellweger ] ) )",
        "gold_entity_map": {
            "m.01c_zw": "Renée Zellweger"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2022",
        "question": "what other writers influenced charles dickens",
        "comp_type": null,
        "answer": [
            "m.01gr2w",
            "m.01vh096",
            "m.03j7p",
            "m.04kpk",
            "m.04xjp",
            "m.06y8v",
            "m.072dv",
            "m.081k8",
            "m.084y3",
            "m.085wn",
            "m.0bmjw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01v9724)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01v9724 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.01v9724)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Charles Dickens ] )",
        "gold_entity_map": {
            "m.01v9724": "Charles Dickens"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2023",
        "question": "where jay z was raised",
        "comp_type": null,
        "answer": [
            "m.0cr3d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vw20h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vw20h ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01vw20h)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jay-Z ] )",
        "gold_entity_map": {
            "m.01vw20h": "Jay-Z"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2034",
        "question": "what language do iraqi people speak",
        "comp_type": null,
        "answer": [
            "m.01m3f7",
            "m.032f6",
            "m.03y86gf",
            "m.04w042",
            "m.0b1g2",
            "m.0g5tm",
            "m.0jzc",
            "m.0xrg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05q4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05q4 ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0d05q4)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Iraq ] )",
        "gold_entity_map": {
            "m.0d05q4": "Iraq"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    }
]