[
    {
        "ID": "WebQTrn-1489",
        "question": "what movies has michael clarke duncan been in",
        "comp_type": null,
        "answer": [
            "m.0137wc",
            "m.016rw2",
            "m.01ztp8",
            "m.02772bj",
            "m.027tdtt",
            "m.02pym58",
            "m.02rd7cn",
            "m.02v8kmz",
            "m.02x0srr",
            "m.03s9kp",
            "m.03t95n",
            "m.03tbg6",
            "m.03w9fwk",
            "m.03wccpk",
            "m.0435vm",
            "m.047wh1",
            "m.048vhl",
            "m.04b4pq",
            "m.04j2sl_",
            "m.04n1s9m",
            "m.04tqtl",
            "m.04xx51",
            "m.05zn3t_",
            "m.064nstb",
            "m.072hxn",
            "m.08952r",
            "m.08f3y0",
            "m.08zjv6",
            "m.09146g",
            "m.099p23",
            "m.09c_s1",
            "m.0bh8yn3",
            "m.0bk2k2",
            "m.0bk2pk",
            "m.0c4yqd4",
            "m.0crs593",
            "m.0crwmhk",
            "m.0crzh7b",
            "m.0d1dcw",
            "m.0dgq12n",
            "m.0ds33",
            "m.0dsb4b",
            "m.0fk5t4",
            "m.0fzz_c",
            "m.0g_1sj",
            "m.0g5qvj",
            "m.0gfzfj",
            "m.0gjs8p",
            "m.0gwz12g",
            "m.0gy5rt9",
            "m.0h15c4x",
            "m.0h2cyp5",
            "m.0h646fd",
            "m.0hntz2g",
            "m.0kv36n",
            "m.0y7tq_4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lkcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lkcc ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.02lkcc))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Michael Clarke Duncan ] ) )",
        "gold_entity_map": {
            "m.02lkcc": "Michael Clarke Duncan"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1492",
        "question": "what is jessica ennis sport",
        "comp_type": null,
        "answer": [
            "m.059846g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b7nrg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b7nrg ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0b7nrg)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Jessica Ennis-Hill ] )",
        "gold_entity_map": {
            "m.0b7nrg": "Jessica Ennis-Hill"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1493",
        "question": "where is tahiti bora bora",
        "comp_type": null,
        "answer": [
            "m.02wzv",
            "m.05fp6n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hb6g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hb6g ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0hb6g)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Tahiti ] )",
        "gold_entity_map": {
            "m.0hb6g": "Tahiti"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1495",
        "question": "where did joe namath live",
        "comp_type": null,
        "answer": [
            "m.02_3xy",
            "m.0zj_2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p_3k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p_3k ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.01p_3k))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Joe Namath ] ) )",
        "gold_entity_map": {
            "m.01p_3k": "Joe Namath"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1498",
        "question": "where do samsung lions play",
        "comp_type": null,
        "answer": [
            "m.0cmd6s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08bbzt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08bbzt ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.08bbzt)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Samsung Lions ] )",
        "gold_entity_map": {
            "m.08bbzt": "Samsung Lions"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1500",
        "question": "what does annie leibovitz do",
        "comp_type": null,
        "answer": [
            "m.03hz6vv",
            "m.0lgw7",
            "m.0n1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015m2c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015m2c ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.015m2c)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Annie Leibovitz ] )",
        "gold_entity_map": {
            "m.015m2c": "Annie Leibovitz"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1502",
        "question": "who did mike tomlin play for",
        "comp_type": null,
        "answer": [
            "m.07s4hxr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c5f_j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c5f_j ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.0c5f_j))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Mike Tomlin ] ) )",
        "gold_entity_map": {
            "m.0c5f_j": "Mike Tomlin"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1504",
        "question": "who is ben roethlisberger parents",
        "comp_type": null,
        "answer": [
            "m.0j2jy4g",
            "m.0j2jy4n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033t8w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033t8w ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.033t8w)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Ben Roethlisberger ] )",
        "gold_entity_map": {
            "m.033t8w": "Ben Roethlisberger"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1506",
        "question": "what are the zoroastrian scriptures called",
        "comp_type": null,
        "answer": [
            "m.0g_f2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025sr3l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025sr3l ns:religion.religion.texts ?x .\n?x ns:common.topic.notable_types ns:m.02knxyp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.02knxyp) (JOIN (R religion.religion.texts) m.025sr3l))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Religious Text ] ) ( JOIN ( R [ religion , religion , texts ] ) [ Zoroastrianism ] ) )",
        "gold_entity_map": {
            "m.025sr3l": "Zoroastrianism",
            "m.02knxyp": "Religious Text"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "religion.religion.texts": "religion , religion , texts"
        },
        "gold_type_map": {
            "m.02knxyp": "Religious Text"
        }
    },
    {
        "ID": "WebQTrn-1508",
        "question": "what organization did martin luther king lead",
        "comp_type": null,
        "answer": [
            "m.027mt4",
            "m.0829gl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:organization.organization_founder.organizations_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization_founder.organizations_founded) m.051cc)",
        "normed_sexpr": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ Martin Luther King, Jr. ] )",
        "gold_entity_map": {
            "m.051cc": "Martin Luther King, Jr."
        },
        "gold_relation_map": {
            "organization.organization_founder.organizations_founded": "organization , organization founder , organizations founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1513",
        "question": "what kind of guitar does jemaine clement play",
        "comp_type": null,
        "answer": [
            "m.018vs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bg539)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bg539 ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.0342h .\n}\n",
        "sexpr": "(AND (JOIN music.instrument.family m.0342h) (JOIN (R music.group_member.instruments_played) m.0bg539))",
        "normed_sexpr": "( AND ( JOIN [ music , instrument , family ] [ Guitar ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Jemaine Clement ] ) )",
        "gold_entity_map": {
            "m.0bg539": "Jemaine Clement",
            "m.0342h": "Guitar"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played",
            "music.instrument.family": "music , instrument , family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1515",
        "question": "where was lance armstrong born and in what year",
        "comp_type": null,
        "answer": [
            "m.013m4v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hfwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hfwb ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0hfwb)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Lance Armstrong ] )",
        "gold_entity_map": {
            "m.0hfwb": "Lance Armstrong"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1516",
        "question": "what kind of money is used in israel",
        "comp_type": null,
        "answer": [
            "m.01jcw8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.03spz)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Israel ] )",
        "gold_entity_map": {
            "m.03spz": "Israel"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1520",
        "question": "what is the zip code for trenton ohio",
        "comp_type": null,
        "answer": [
            "m.03dw2gg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ytcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ytcc ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0ytcc)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Trenton ] )",
        "gold_entity_map": {
            "m.0ytcc": "Trenton"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1521",
        "question": "what is north dakota state 's mascot",
        "comp_type": null,
        "answer": [
            "m.07g61_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xysf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xysf ns:education.educational_institution.mascot ?x .\n}\n",
        "sexpr": "(JOIN (R education.educational_institution.mascot) m.01xysf)",
        "normed_sexpr": "( JOIN ( R [ education , educational institution , mascot ] ) [ North Dakota State University ] )",
        "gold_entity_map": {
            "m.01xysf": "North Dakota State University"
        },
        "gold_relation_map": {
            "education.educational_institution.mascot": "education , educational institution , mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1522",
        "question": "what is the work of charles darwin",
        "comp_type": null,
        "answer": [
            "m.04t22yt",
            "m.04t35dh",
            "m.04w2xy1",
            "m.04w3np9",
            "m.04w6lm1",
            "m.04w841r",
            "m.04wfcd6",
            "m.0502mx",
            "m.050mcx",
            "m.05bmx95",
            "m.05bmxdr",
            "m.05bmxf0",
            "m.05bpx4f",
            "m.05bpx8z",
            "m.066lp33",
            "m.066lv1x",
            "m.066lvpj",
            "m.066lwd0",
            "m.0b736dx",
            "m.0bhh_cw",
            "m.0bhhzsp",
            "m.0bhhzt5",
            "m.0fhpn5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwx ns:book.book_subject.works ?x .\n}\n",
        "sexpr": "(JOIN (R book.book_subject.works) m.01lwx)",
        "normed_sexpr": "( JOIN ( R [ book , book subject , works ] ) [ Charles Darwin ] )",
        "gold_entity_map": {
            "m.01lwx": "Charles Darwin"
        },
        "gold_relation_map": {
            "book.book_subject.works": "book , book subject , works"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1527",
        "question": "what does duffy sing",
        "comp_type": null,
        "answer": [
            "m.0_61gwm",
            "m.03cq02g",
            "m.0d_3jv6",
            "m.0dm71jf",
            "m.0dm9yv1",
            "m.0dmrn14",
            "m.0dn5vkf",
            "m.0dnsmxf",
            "m.0dp6x9z",
            "m.0dpls1s",
            "m.0dq004p",
            "m.0dqq94w",
            "m.0dr4wgj",
            "m.0dt2rm0",
            "m.0dt9xnq",
            "m.0dtmm44",
            "m.0dtp4_j",
            "m.0dw_vlf",
            "m.0dw2qd0",
            "m.0dw7t06",
            "m.0dwqqgb",
            "m.0dxdqpz",
            "m.0dxjjx9",
            "m.0dzrbsm",
            "m.0dzt3c5",
            "m.0f_0w_g",
            "m.0f_0x03",
            "m.0f_0x07",
            "m.0f0hhml",
            "m.0f0qgk6",
            "m.0f0s4km",
            "m.0f13y3g",
            "m.0f2svtk",
            "m.0f2xbbj",
            "m.0f2xbvj",
            "m.0f3hfs7",
            "m.0f5lfzy",
            "m.0f6cxxm",
            "m.0f6cxyc",
            "m.0f7pmb8",
            "m.0f996ym",
            "m.0fhrfhf",
            "m.0fjrccz",
            "m.0fk0dsx",
            "m.0fr71xw",
            "m.0frj7pf",
            "m.0fs4tvr",
            "m.0ftb1x4",
            "m.0ftg7pt",
            "m.0ftwvbd",
            "m.0fvbd13",
            "m.0fw6v5p",
            "m.0fwcc1w",
            "m.0fxd3hr",
            "m.0fyz4cq",
            "m.0fyz4cz",
            "m.0fyz4d1",
            "m.0fyz4d5",
            "m.0fyz4dc",
            "m.0g1fcb6",
            "m.0g6fmd2",
            "m.0nnnmfn",
            "m.0nnyt4r",
            "m.0ws_sns",
            "m.0ws_v00",
            "m.0ws_v7k",
            "m.0ws_y5g",
            "m.0wsysy3",
            "m.0wt00hx",
            "m.0wt03_5",
            "m.0wt08z8",
            "m.0wt0gzk",
            "m.0wt0hr2",
            "m.0wt0jht",
            "m.0wt0jwp",
            "m.0yt9xxh",
            "m.0ytkm8v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h3y8v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h3y8v ns:music.artist.track ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.track) m.03h3y8v)",
        "normed_sexpr": "( JOIN ( R [ music , artist , track ] ) [ Duffy ] )",
        "gold_entity_map": {
            "m.03h3y8v": "Duffy"
        },
        "gold_relation_map": {
            "music.artist.track": "music , artist , track"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1528",
        "question": "what school did tupac go to",
        "comp_type": null,
        "answer": [
            "m.0269lqm",
            "m.03jl5b",
            "m.06cbpm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.07pzc))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Tupac Shakur ] ) )",
        "gold_entity_map": {
            "m.07pzc": "Tupac Shakur"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1529",
        "question": "what does guyana speak",
        "comp_type": null,
        "answer": [
            "m.026ztd1",
            "m.02h40lc",
            "m.02hwv5d",
            "m.02hxg9j",
            "m.02hxgv4",
            "m.02hxhnv",
            "m.02hxq7p",
            "m.048dyk",
            "m.05zjd",
            "m.06nm1",
            "m.0hc2x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034m8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034m8 ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.034m8)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Guyana ] )",
        "gold_entity_map": {
            "m.034m8": "Guyana"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1534",
        "question": "what county is minneapolis mn in",
        "comp_type": null,
        "answer": [
            "m.0nhmw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fpzwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fpzwf ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0fpzwf)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Minneapolis ] )",
        "gold_entity_map": {
            "m.0fpzwf": "Minneapolis"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1536",
        "question": "who is queen elizabeth 1 father",
        "comp_type": null,
        "answer": [
            "m.03p77"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rg_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rg_ ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.02rg_))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Elizabeth I of England ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.02rg_": "Elizabeth I of England"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1546",
        "question": "what are the names of all the countries in africa",
        "comp_type": null,
        "answer": [
            "m.0164v",
            "m.0166v",
            "m.01699",
            "m.0169t",
            "m.019pcs",
            "m.019rg5",
            "m.01n6c",
            "m.01nln",
            "m.01nqj",
            "m.01nyl",
            "m.01p1b",
            "m.01rxw",
            "m.027jk",
            "m.02k54",
            "m.02kcz",
            "m.02khs",
            "m.03548",
            "m.035dk",
            "m.03676",
            "m.036b_",
            "m.04gqr",
            "m.04hvw",
            "m.04hzj",
            "m.04sj3",
            "m.04tr1",
            "m.04v09",
            "m.04vjh",
            "m.04vs9",
            "m.04wgh",
            "m.04wlh",
            "m.05bmq",
            "m.05cc1",
            "m.05cgv",
            "m.05rznz",
            "m.06dfg",
            "m.06s_2",
            "m.06srk",
            "m.06sw9",
            "m.06tgw",
            "m.06tw8",
            "m.06v36",
            "m.07dzf",
            "m.07f5x",
            "m.07fj_",
            "m.07tp2",
            "m.088q4",
            "m.088vb",
            "m.088xp",
            "m.0fv4v",
            "m.0h3y",
            "m.0hdx8",
            "m.0hzlz",
            "m.0j4b",
            "m.0j681"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dg3n1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dg3n1 ns:base.locations.continents.countries_within ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.continents.countries_within) m.0dg3n1)",
        "normed_sexpr": "( JOIN ( R [ base , locations , continents , countries within ] ) [ Africa ] )",
        "gold_entity_map": {
            "m.0dg3n1": "Africa"
        },
        "gold_relation_map": {
            "base.locations.continents.countries_within": "base , locations , continents , countries within"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1550",
        "question": "where was nicki minaj born",
        "comp_type": null,
        "answer": [
            "m.0gplfm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.047sxrj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.047sxrj ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.047sxrj)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Nicki Minaj ] )",
        "gold_entity_map": {
            "m.047sxrj": "Nicki Minaj"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1552",
        "question": "who plays spike in buffy the vampire slayer",
        "comp_type": null,
        "answer": [
            "m.01f9mq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jz06)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jz06 ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.tv_guest_role.actor) (JOIN (R tv.tv_character.appeared_in_tv_episodes) m.0jz06))",
        "normed_sexpr": "( JOIN ( R [ tv , tv guest role , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv episodes ] ) [ Spike ] ) )",
        "gold_entity_map": {
            "m.0jz06": "Spike"
        },
        "gold_relation_map": {
            "tv.tv_character.appeared_in_tv_episodes": "tv , tv character , appeared in tv episodes",
            "tv.tv_guest_role.actor": "tv , tv guest role , actor"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1553",
        "question": "where was emperor hadrian born",
        "comp_type": null,
        "answer": [
            "m.05dn72"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jxc ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.03jxc)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Hadrian ] )",
        "gold_entity_map": {
            "m.03jxc": "Hadrian"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1556",
        "question": "where did martin luther king went to school",
        "comp_type": null,
        "answer": [
            "m.01_r9k",
            "m.0479w_2",
            "m.06yr21",
            "m.0gl5_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.051cc))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Martin Luther King, Jr. ] ) )",
        "gold_entity_map": {
            "m.051cc": "Martin Luther King, Jr."
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1565",
        "question": "what airport is closest to ithaca ny",
        "comp_type": null,
        "answer": [
            "m.01vs0p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03v_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03v_5 ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.03v_5)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Ithaca ] )",
        "gold_entity_map": {
            "m.03v_5": "Ithaca"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1566",
        "question": "where did kurt cobain die",
        "comp_type": null,
        "answer": [
            "m.0d9jr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0484q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0484q ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.0484q)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Kurt Cobain ] )",
        "gold_entity_map": {
            "m.0484q": "Kurt Cobain"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1567",
        "question": "what county is jackson michigan in",
        "comp_type": null,
        "answer": [
            "m.043z0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042tq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042tq ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.042tq)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Jackson ] )",
        "gold_entity_map": {
            "m.042tq": "Jackson"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    }
]