[
    {
        "ID": "WebQTrn-2302",
        "question": "what continent is australia in",
        "comp_type": null,
        "answer": [
            "m.05nrg",
            "m.09pkq0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mh) (JOIN (R location.location.containedby) m.0chghy))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Australia ] ) )",
        "gold_entity_map": {
            "m.0chghy": "Australia",
            "m.01mh": "Continent"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mh": "Continent"
        }
    },
    {
        "ID": "WebQTrn-2303",
        "question": "what is roshon fegan 's heritage",
        "comp_type": null,
        "answer": [
            "m.0x67"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jq2yz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jq2yz ns:people.person.ethnicity ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.ethnicity) m.04jq2yz)",
        "normed_sexpr": "( JOIN ( R [ people , person , ethnicity ] ) [ Roshon Fegan ] )",
        "gold_entity_map": {
            "m.04jq2yz": "Roshon Fegan"
        },
        "gold_relation_map": {
            "people.person.ethnicity": "people , person , ethnicity"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2304",
        "question": "where is spanish springs nv",
        "comp_type": null,
        "answer": [
            "m.0n6mc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xdbn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xdbn ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpym_ .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.0kpym_) (JOIN (R location.location.containedby) m.0xdbn))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ US County ] ) ( JOIN ( R [ location , location , containedby ] ) [ Spanish Springs ] ) )",
        "gold_entity_map": {
            "m.0kpym_": "US County",
            "m.0xdbn": "Spanish Springs"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.0kpym_": "US County"
        }
    },
    {
        "ID": "WebQTrn-2306",
        "question": "what is the name of the sacred text of islam",
        "comp_type": null,
        "answer": [
            "m.02q8xdw",
            "m.03hf62",
            "m.045_sj",
            "m.0482d5",
            "m.04b286",
            "m.04b297",
            "m.04b29y",
            "m.04b3hq",
            "m.04fvry",
            "m.04g0_k",
            "m.04vm2_",
            "m.04vm29",
            "m.04vm2n",
            "m.04vm51",
            "m.04vpdh",
            "m.04vpfj",
            "m.04vqkh",
            "m.04vy82",
            "m.04vy9w",
            "m.04vyhl",
            "m.04vyms",
            "m.04vyn3",
            "m.052nbg",
            "m.0539s0",
            "m.05jlpz",
            "m.074jc",
            "m.096tx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0flw86)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0flw86 ns:religion.religion.texts ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.texts) m.0flw86)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , texts ] ) [ Islam ] )",
        "gold_entity_map": {
            "m.0flw86": "Islam"
        },
        "gold_relation_map": {
            "religion.religion.texts": "religion , religion , texts"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2308",
        "question": "who stars in the movie fred claus",
        "comp_type": null,
        "answer": [
            "m.014x77",
            "m.018yhr",
            "m.01ppx3y",
            "m.01vw37m",
            "m.025_dd9",
            "m.0272ndr",
            "m.02kxwk",
            "m.02qh8t4",
            "m.02ws5y4",
            "m.0315q3",
            "m.03gh163",
            "m.03gh16t",
            "m.03gh1q4",
            "m.03xfbt",
            "m.03y9w53",
            "m.048lv",
            "m.051_j70",
            "m.0525b",
            "m.063_8bk",
            "m.0716t2",
            "m.07kbjh6",
            "m.07y8l9",
            "m.08w3r6",
            "m.09gd973",
            "m.0b1q7c",
            "m.0bfm8zf",
            "m.0bj704q",
            "m.0bj709x",
            "m.0bv74_7",
            "m.0bv74z0",
            "m.0bv74zd",
            "m.0bv74zl",
            "m.0cz5jr",
            "m.0dly00",
            "m.0f9pq6",
            "m.0g3q_y",
            "m.0gbxgtc",
            "m.0gc007n",
            "m.0gc0pxm",
            "m.0gc3743",
            "m.0gcbf41",
            "m.0gcjnj3",
            "m.0gcjsml",
            "m.0gd2wd8",
            "m.0gdkpjg",
            "m.0gvqzsh",
            "m.0hh47jg",
            "m.0j5d74k",
            "m.0k22v_",
            "m.0k3qlry",
            "m.0kdy2xn",
            "m.0n22hp9",
            "m.0ngwnpv",
            "m.0pdswyx",
            "m.0r40qwl",
            "m.0t_rc4s",
            "m.0tl2hpw",
            "m.0tlcz16",
            "m.0tlhsth",
            "m.0tlmpn5",
            "m.0v2dfl3",
            "m.0v2gfpj",
            "m.0v2hrt5",
            "m.0v4q56z",
            "m.0v4ql2k",
            "m.0v4ynyp",
            "m.0vt1_tf",
            "m.0vtj3fw",
            "m.0vx15s6",
            "m.0vx433t",
            "m.0vxdkkp",
            "m.0vxxkyv",
            "m.0w2jkr9",
            "m.0y__b55",
            "m.0y__tqn",
            "m.0y_wytl",
            "m.0y_xlpl",
            "m.0y_yt24",
            "m.0y_yynn",
            "m.0y_z2md",
            "m.0y_z8q4",
            "m.0y5545f",
            "m.0y84k_g",
            "m.0ynd6d4",
            "m.0ywk6h9",
            "m.0ywp0k2",
            "m.0ywpl5c",
            "m.0yxc5r4",
            "m.0yxd4_r",
            "m.0yz7bgn",
            "m.0yz99jh",
            "m.0yzc0sy",
            "m.0yzg7cn",
            "m.0yzk10q",
            "m.0z00ky1",
            "m.0z00yyd",
            "m.0z01f40",
            "m.0z020lf",
            "m.0z03lb6",
            "m.0z04dmc",
            "m.0z0517n",
            "m.0z05dck",
            "m.0z06qxm",
            "m.0z085vz",
            "m.0z0bk9n",
            "m.0z0c0nh",
            "m.0z0d8kn",
            "m.0z0dzk5",
            "m.0z0f4xg",
            "m.0z0fcbk",
            "m.0z0ffly",
            "m.0z0fwhf",
            "m.0z0g0rp",
            "m.0z0g6h_",
            "m.0z0gmwy",
            "m.0z0h3m8",
            "m.0z0hqqv",
            "m.0z0jcf0",
            "m.0z0jnc4",
            "m.0z0jpvj",
            "m.0z0kgzh",
            "m.0z0kn8z",
            "m.0z0lhrn",
            "m.0z0lp7_",
            "m.0z0md82",
            "m.0z0mm5j",
            "m.0z0mz2y",
            "m.0z0nccl",
            "m.0z0njfb",
            "m.0z0np5c",
            "m.0z0nspt",
            "m.0z0nxdk",
            "m.0z0p16k",
            "m.0z0p6jf",
            "m.0z0p9cc",
            "m.0z0qc4k",
            "m.0z0qnsm",
            "m.0z0qv6h",
            "m.0z22bwg",
            "m.0z7dgsw",
            "m.0zb1986",
            "m.0zb1r36",
            "m.0zb1t67",
            "m.0zbdyz5",
            "m.0zbf0wf",
            "m.0zbf1w7",
            "m.0zcbl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kvf6s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kvf6s ns:film.film.starring ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film.starring) m.0kvf6s))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film , starring ] ) [ Fred Claus ] ) )",
        "gold_entity_map": {
            "m.0kvf6s": "Fred Claus"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film.starring": "film , film , starring"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2310",
        "question": "where did madoff live",
        "comp_type": null,
        "answer": [
            "m.0cc56",
            "m.0ccvx",
            "m.0f8l9c",
            "m.0rqf1",
            "m.0y34j",
            "m.0y8vm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051znky)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051znky ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.051znky))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Bernard Madoff ] ) )",
        "gold_entity_map": {
            "m.051znky": "Bernard Madoff"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2312",
        "question": "where to hang out in chicago",
        "comp_type": null,
        "answer": [
            "m.01dlzc",
            "m.021czc",
            "m.025v4fb",
            "m.027hqc_",
            "m.02jw0z",
            "m.02rvwrv",
            "m.02vv_6w",
            "m.03y4l3",
            "m.04h9qj",
            "m.05zv09",
            "m.06_7k",
            "m.07qbm4",
            "m.094154",
            "m.0b0sh",
            "m.0b28z",
            "m.0bl8mx",
            "m.0c7ln",
            "m.0d9wz",
            "m.0g_8d0",
            "m.0j2m3px",
            "m.0n4_xtw",
            "m.0n8yyvt",
            "m.0w7m2x9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.01_d4)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Chicago ] )",
        "gold_entity_map": {
            "m.01_d4": "Chicago"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2316",
        "question": "what influenced jackson pollock 's work",
        "comp_type": null,
        "answer": [
            "m.01ny1z",
            "m.02gcyb",
            "m.060_7",
            "m.0bk5r",
            "m.0bqb_",
            "m.0c241_",
            "m.0g_6k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04510)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04510 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.04510)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Jackson Pollock ] )",
        "gold_entity_map": {
            "m.04510": "Jackson Pollock"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2321",
        "question": "what songs did duane allman sing",
        "comp_type": null,
        "answer": [
            "m.010j02n8",
            "m.018qx62",
            "m.0ffgh6q",
            "m.0m4ctt",
            "m.0rjzm0",
            "m.0rjznb",
            "m.0rqckq5",
            "m.0rqckqv",
            "m.0rqckrk",
            "m.0rqckrt",
            "m.0rqckwf",
            "m.0rqcm2_",
            "m.0rqcm3s",
            "m.0rqcm4b",
            "m.0rqcm4r",
            "m.0rqcm5w",
            "m.0rqcm6b",
            "m.0rqcm77",
            "m.0rqcm7x",
            "m.0rqcm89",
            "m.0rqcm96",
            "m.0rqcmb7",
            "m.0rqcmbr",
            "m.0rqcq9y",
            "m.0rqcqbt",
            "m.0rqcqc_",
            "m.0rqcqcb",
            "m.0rqcqdn",
            "m.0rqcqf_",
            "m.0rqcqf4",
            "m.0rqcqg7",
            "m.0rqcqgz",
            "m.0rqcqj_",
            "m.0rqcqjh",
            "m.0rqcqky",
            "m.0rqcqlw",
            "m.0rqcqnf",
            "m.0rqcqpl",
            "m.0rqcqqp",
            "m.0rqcqry",
            "m.0rqcqs_",
            "m.0rqcqsq",
            "m.0rqcqv6",
            "m.0rqcqw3",
            "m.0rqcw_3",
            "m.0rqcw_m",
            "m.0rqcwbn",
            "m.0rqcwd_",
            "m.0rqcwgg",
            "m.0rqcwhf",
            "m.0rqcwjq",
            "m.0rqcwn9",
            "m.0rqcwqb",
            "m.0rqcwsb",
            "m.0rqcwth",
            "m.0rqcwvx",
            "m.0rqcwy8",
            "m.0rqcwzl",
            "m.0rqcx02",
            "m.0rqcx0n",
            "m.0rqcx16",
            "m.0rqczgf",
            "m.0rqczh4",
            "m.0rqczj4",
            "m.0rqczjq",
            "m.0rqczk3",
            "m.0rqczlb",
            "m.0rqczlx",
            "m.0rqczpv",
            "m.0rqczqf",
            "m.0rqczqp",
            "m.0rqczrv",
            "m.0rqczt5",
            "m.0rqcztv",
            "m.0rqczy1",
            "m.0rqczzb",
            "m.0rqg5dc",
            "m.0rqg5dp",
            "m.0rqg5dw",
            "m.0rqg5fh",
            "m.0rqg5fs",
            "m.0rqg5g0",
            "m.0rqg5g8",
            "m.0rqg5h9",
            "m.0yhd46"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qyy3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qyy3 ns:music.artist.track ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.track) m.01qyy3)",
        "normed_sexpr": "( JOIN ( R [ music , artist , track ] ) [ Duane Allman ] )",
        "gold_entity_map": {
            "m.01qyy3": "Duane Allman"
        },
        "gold_relation_map": {
            "music.artist.track": "music , artist , track"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2326",
        "question": "what team did doug williams play for",
        "comp_type": null,
        "answer": [
            "m.01n_xh",
            "m.07l24",
            "m.084l5",
            "m.0gj8lsd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443ql)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443ql ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.0443ql))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Doug Williams ] ) )",
        "gold_entity_map": {
            "m.0443ql": "Doug Williams"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2327",
        "question": "what are the different sports in the philippines",
        "comp_type": null,
        "answer": [
            "m.04k3r_",
            "m.07k3_n0",
            "m.0ll4ndn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.05v8c)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ Philippines ] )",
        "gold_entity_map": {
            "m.05v8c": "Philippines"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2329",
        "question": "where did willy wonka take place",
        "comp_type": null,
        "answer": [
            "m.04rn2rz",
            "m.0fv9n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0347sv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0347sv ns:fictional_universe.fictional_character.appears_in_these_fictional_universes ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.appears_in_these_fictional_universes) m.0347sv)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , appears in these fictional universes ] ) [ Willy Wonka ] )",
        "gold_entity_map": {
            "m.0347sv": "Willy Wonka"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.appears_in_these_fictional_universes": "fictional universe , fictional character , appears in these fictional universes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2332",
        "question": "what books has elie wiesel written",
        "comp_type": null,
        "answer": [
            "m.028xwsh",
            "m.028y1sf",
            "m.04tpl_8",
            "m.04tpl_j",
            "m.04tplgb",
            "m.04tplh0",
            "m.04tplhg",
            "m.04tplhx",
            "m.04tplj4",
            "m.04tpljl",
            "m.04tplk0",
            "m.04tplk8",
            "m.04tplkq",
            "m.04tpll4",
            "m.04tplld",
            "m.04tplln",
            "m.04tpllw",
            "m.04tplm9",
            "m.04tplmk",
            "m.04tplmt",
            "m.04tpln0",
            "m.04tplng",
            "m.04tplnp",
            "m.04tplp_",
            "m.04tplp3",
            "m.04tplpk",
            "m.04tplq7",
            "m.04tplqg",
            "m.04tplqx",
            "m.04tplrb",
            "m.04tplrs",
            "m.04tpls6",
            "m.04tplsn",
            "m.04tplt2",
            "m.04tpltj",
            "m.04tplts",
            "m.04tplv6",
            "m.04tplvf",
            "m.04tplvw",
            "m.04tplw_",
            "m.04tplw3",
            "m.04tplwk",
            "m.04tplx6",
            "m.04tplxg",
            "m.04tplxx",
            "m.04tply9",
            "m.04tplyq",
            "m.04tplz4",
            "m.04tplzd",
            "m.04tplzv",
            "m.04vcmmw",
            "m.04vcmn_",
            "m.04vcmn3",
            "m.04vcmnh",
            "m.04vcmpd",
            "m.04vcmpp",
            "m.04vcmq1",
            "m.04vcmqm",
            "m.04vcmr5",
            "m.04vcmrx",
            "m.04vcms4",
            "m.04vcmsd",
            "m.04vcmsx",
            "m.04vcmt4",
            "m.04vcmtd",
            "m.04vcmtt",
            "m.04vcp2t",
            "m.04vcp3n",
            "m.04vcp4b",
            "m.04vcp56",
            "m.04vcp5n",
            "m.04vcp7h",
            "m.04vk5dj",
            "m.04vk5fb",
            "m.04vk5g4",
            "m.04vk5gf",
            "m.04vl4vp",
            "m.04vl4xv",
            "m.04vlt_7",
            "m.04vlt_j",
            "m.04vlt_v",
            "m.04vlt52",
            "m.04vlt66",
            "m.04vlt6j",
            "m.04vlt9c",
            "m.04vltb1",
            "m.04vltbt",
            "m.04vltdl",
            "m.04vltf4",
            "m.04vltfm",
            "m.04vltgv",
            "m.04vltlc",
            "m.04vltlw",
            "m.04vltmm",
            "m.04vltpc",
            "m.04vltpp",
            "m.04vltq4",
            "m.04vltqr",
            "m.04vltr0",
            "m.04vltrd",
            "m.04vltrw",
            "m.04vltsc",
            "m.04vltsv",
            "m.04vltt2",
            "m.04vlttd",
            "m.04vlttp",
            "m.04vlttz",
            "m.04vltv9",
            "m.04vltvs",
            "m.04vltw9",
            "m.04vltwr",
            "m.04vltx6",
            "m.04vltxp",
            "m.04vltxy",
            "m.04vlty7",
            "m.04vltyh",
            "m.04vltyz",
            "m.04vltzh",
            "m.04vltzs",
            "m.04vlv08",
            "m.04vlv0k",
            "m.04vlv10",
            "m.04vlv1l",
            "m.04vlv1w",
            "m.04vlv2_",
            "m.04vlv25",
            "m.04vlv2f",
            "m.04vlv2q",
            "m.04vlv8j",
            "m.04vlv90",
            "m.04vlv9h",
            "m.04vlvbx",
            "m.04vlvcf",
            "m.04w0qfs",
            "m.04w0qg0",
            "m.04w0qgr",
            "m.04w0qjl",
            "m.04w0qjv",
            "m.04yl7mn",
            "m.04yl7n5",
            "m.04yl7ng",
            "m.04yl7nr",
            "m.04yl7p0",
            "m.04yl7p9",
            "m.04yl7pm",
            "m.04yl7qh",
            "m.04yl7r_",
            "m.04yl7r0",
            "m.04yl7rn",
            "m.04yl7sw",
            "m.04yl7t8",
            "m.04yl7tk",
            "m.04yl7tv",
            "m.04yl7v9",
            "m.04yl7vr",
            "m.04yl7w5",
            "m.04yl7wp",
            "m.04yl7x8",
            "m.04yl7y_",
            "m.04yl7yc",
            "m.04yl7z9",
            "m.05bqdxp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vsp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vsp ns:book.author.book_editions_published ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.book_editions_published) m.02vsp)",
        "normed_sexpr": "( JOIN ( R [ book , author , book editions published ] ) [ Elie Wiesel ] )",
        "gold_entity_map": {
            "m.02vsp": "Elie Wiesel"
        },
        "gold_relation_map": {
            "book.author.book_editions_published": "book , author , book editions published"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2334",
        "question": "who is cameron crowe",
        "comp_type": null,
        "answer": [
            "m.01d_h8",
            "m.02h6676",
            "m.02hrh1q",
            "m.02jknp",
            "m.0cbd2",
            "m.0d8qb",
            "m.0dxtg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vb6z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vb6z ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01vb6z)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Cameron Crowe ] )",
        "gold_entity_map": {
            "m.01vb6z": "Cameron Crowe"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2337",
        "question": "what films did liam neeson star in",
        "comp_type": null,
        "answer": [
            "m.01_0f7",
            "m.010hct98",
            "m.012y5v",
            "m.019vhk",
            "m.01dh6f",
            "m.01hdzl3",
            "m.01l63z",
            "m.020bv3",
            "m.027rkbd",
            "m.027v2lz",
            "m.02fqrf",
            "m.02ll45",
            "m.02pm8zp",
            "m.02pnb78",
            "m.02prwdh",
            "m.02pxhgv",
            "m.02q88q8",
            "m.02rq8k8",
            "m.02w7c9c",
            "m.02xhkvz",
            "m.02xhkwb",
            "m.033_m2",
            "m.035s95",
            "m.03c2h8h",
            "m.03m4mj",
            "m.03mgw2v",
            "m.03mgx6z",
            "m.03t79f",
            "m.046f3p",
            "m.04dx7g",
            "m.04j1b7x",
            "m.04j2qhy",
            "m.04ydvzd",
            "m.05p4097",
            "m.05sjt9",
            "m.05szq8z",
            "m.060hk0",
            "m.0639bg",
            "m.063fh9",
            "m.0642ykh",
            "m.06p361",
            "m.07_k0c0",
            "m.07l4yp8",
            "m.080p93d",
            "m.092cdq",
            "m.095k_x",
            "m.09g96w7",
            "m.09k5kmz",
            "m.09lcsj",
            "m.0b1c19",
            "m.0b7b7v4",
            "m.0bb2g9p",
            "m.0bh5v1y",
            "m.0bh8tgs",
            "m.0blvtr",
            "m.0bmch_x",
            "m.0bpm4yw",
            "m.0bw20",
            "m.0cd3kf",
            "m.0crdxqs",
            "m.0crrmnr",
            "m.0crrtl8",
            "m.0crscqh",
            "m.0cs17mf",
            "m.0cs1dh7",
            "m.0ddhlx3",
            "m.0ddt_",
            "m.0dmnww",
            "m.0gwys7m",
            "m.0gxs87f",
            "m.0hfzr",
            "m.0hhggmy",
            "m.0j27q89",
            "m.0jws4d1",
            "m.0n4g1dj",
            "m.0ng4tdd",
            "m.0ng5055",
            "m.0ngxr4w",
            "m.0pbw9qb",
            "m.0pmfg28",
            "m.0pv54",
            "m.0vnltcd",
            "m.0vps74l",
            "m.0w4fbhm",
            "m.0wry9ll"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h5g_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h5g_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0h5g_))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Liam Neeson ] ) )",
        "gold_entity_map": {
            "m.0h5g_": "Liam Neeson"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2339",
        "question": "what does tim gunn do for a living",
        "comp_type": null,
        "answer": [
            "m.02hrh1q",
            "m.02jknp",
            "m.02n9jv",
            "m.03gjzk",
            "m.0dxtg",
            "m.0dypbr",
            "m.0kyk",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bslxh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bslxh ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0bslxh)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Tim Gunn ] )",
        "gold_entity_map": {
            "m.0bslxh": "Tim Gunn"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2340",
        "question": "what was eli whitney job",
        "comp_type": null,
        "answer": [
            "m.01d30f",
            "m.03sbb",
            "m.09j9h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02ncr)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Eli Whitney ] )",
        "gold_entity_map": {
            "m.02ncr": "Eli Whitney"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2346",
        "question": "what does taiwan people speak",
        "comp_type": null,
        "answer": [
            "m.03115z",
            "m.09q16b",
            "m.0dxj6",
            "m.0g1jw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06f32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06f32 ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.06f32)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Taiwan ] )",
        "gold_entity_map": {
            "m.06f32": "Taiwan"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2351",
        "question": "where was governor cuomo born",
        "comp_type": null,
        "answer": [
            "m.0ccvx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pjpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pjpd ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02pjpd)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Andrew Cuomo ] )",
        "gold_entity_map": {
            "m.02pjpd": "Andrew Cuomo"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2355",
        "question": "what money to take to sri lanka",
        "comp_type": null,
        "answer": [
            "m.02gsxw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06m_5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06m_5 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.06m_5)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Sri Lanka ] )",
        "gold_entity_map": {
            "m.06m_5": "Sri Lanka"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    }
]