[
    {
        "ID": "WebQTrn-168",
        "question": "what was the name of the original seattle baseball team",
        "comp_type": null,
        "answer": [
            "Seattle Pilots"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fq2vj2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fq2vj2 ns:type.object.name ?x .\n}\n",
        "sexpr": "(JOIN (R type.object.name) m.0fq2vj2)",
        "normed_sexpr": "( JOIN ( R [ type , object , name ] ) [ Seattle Pilots ] )",
        "gold_entity_map": {
            "m.0fq2vj2": "Seattle Pilots"
        },
        "gold_relation_map": {
            "type.object.name": "type , object , name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-171",
        "question": "when were the texas rangers started",
        "comp_type": null,
        "answer": [
            "1972"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07l8x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07l8x ns:sports.sports_team.founded ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.founded) m.07l8x)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , founded ] ) [ Texas Rangers ] )",
        "gold_entity_map": {
            "m.07l8x": "Texas Rangers"
        },
        "gold_relation_map": {
            "sports.sports_team.founded": "sports , sports team , founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-172",
        "question": "where did the houston oilers football team go",
        "comp_type": null,
        "answer": [
            "m.06f2k5d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nmxtk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nmxtk ns:sports.defunct_sports_team.later_known_as ?x .\n}\n",
        "sexpr": "(JOIN (R sports.defunct_sports_team.later_known_as) m.04nmxtk)",
        "normed_sexpr": "( JOIN ( R [ sports , defunct sports team , later known as ] ) [ Houston Oilers ] )",
        "gold_entity_map": {
            "m.04nmxtk": "Houston Oilers"
        },
        "gold_relation_map": {
            "sports.defunct_sports_team.later_known_as": "sports , defunct sports team , later known as"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-175",
        "question": "where does niles crane live",
        "comp_type": null,
        "answer": [
            "m.0d9jr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02c81m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02c81m ns:fictional_universe.fictional_character.places_lived ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.places_lived) m.02c81m)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , places lived ] ) [ Niles Crane ] )",
        "gold_entity_map": {
            "m.02c81m": "Niles Crane"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.places_lived": "fictional universe , fictional character , places lived"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-176",
        "question": "where was gabriel faure born",
        "comp_type": null,
        "answer": [
            "m.063bzq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jn7y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jn7y ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0jn7y)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Gabriel Fauré ] )",
        "gold_entity_map": {
            "m.0jn7y": "Gabriel Fauré"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-179",
        "question": "where did the massive allied invasion of northern france take place in june 1944",
        "comp_type": null,
        "answer": [
            "m.05g56"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chhs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chhs ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0chhs)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Invasion of Normandy ] )",
        "gold_entity_map": {
            "m.0chhs": "Invasion of Normandy"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-180",
        "question": "which countries are part of the united kingdom",
        "comp_type": null,
        "answer": [
            "m.02jx1",
            "m.0366c",
            "m.05bcl",
            "m.06q1r",
            "m.0j5g9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.07ssc))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ United Kingdom ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.07ssc": "United Kingdom"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-181",
        "question": "what is the postcode for london",
        "comp_type": null,
        "answer": [
            "m.09rzxp9",
            "m.09sfglt",
            "m.0cvp88j",
            "m.0cxn7ws",
            "m.0cxsp04",
            "m.0cxss5g",
            "m.0cy0j66",
            "m.0cy1q47",
            "m.0cy1sy5",
            "m.0cy1z55",
            "m.0cy1ztb",
            "m.0cy6s01",
            "m.0cy8plg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04jpl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04jpl ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.04jpl)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ London ] )",
        "gold_entity_map": {
            "m.04jpl": "London"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-185",
        "question": "what language does fiji",
        "comp_type": null,
        "answer": [
            "m.020gps",
            "m.02h40lc",
            "m.02hwsll"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wt0 ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.02wt0)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Fiji ] )",
        "gold_entity_map": {
            "m.02wt0": "Fiji"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-189",
        "question": "where is mitsubishi headquarters",
        "comp_type": null,
        "answer": [
            "m.07dfk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0czgc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0czgc ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.0czgc))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Mitsubishi Group ] ) )",
        "gold_entity_map": {
            "m.0czgc": "Mitsubishi Group"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-198",
        "question": "who are betty white 's parents",
        "comp_type": null,
        "answer": [
            "m.0gy8d8n",
            "m.0gy8d8z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.025mb_)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Betty White ] )",
        "gold_entity_map": {
            "m.025mb_": "Betty White"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-199",
        "question": "where did jeff dunham go to school",
        "comp_type": null,
        "answer": [
            "m.01tx9m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ch_0g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ch_0g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0ch_0g))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jeff Dunham ] ) )",
        "gold_entity_map": {
            "m.0ch_0g": "Jeff Dunham"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-203",
        "question": "what movies did diana ross play in",
        "comp_type": null,
        "answer": [
            "m.01295rtw",
            "m.01gvpz",
            "m.027fwmt",
            "m.04l7z_",
            "m.05n1_9",
            "m.067zjb",
            "m.07bdfb",
            "m.0crt8tb",
            "m.0crtmx7",
            "m.0crv8zq",
            "m.0crvchf",
            "m.0h0zm10"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wrcxr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wrcxr ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.01wrcxr))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Diana Ross ] ) )",
        "gold_entity_map": {
            "m.01wrcxr": "Diana Ross"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-204",
        "question": "what is the zip code for minneapolis",
        "comp_type": null,
        "answer": [
            "m.01_x_4z",
            "m.01_x_8g",
            "m.01_x_qk",
            "m.01_y0_0",
            "m.01_y0gq",
            "m.01_y0jp",
            "m.01_y0kh",
            "m.01_y0ms",
            "m.01_y0q_",
            "m.01_y1yp",
            "m.01_y3_x",
            "m.01_y3h3",
            "m.01_y3j5",
            "m.01_y41c",
            "m.01_y467",
            "m.01_y48c",
            "m.01_y7w7",
            "m.01_y83k",
            "m.01_y89x",
            "m.01_y9z4",
            "m.01_yd4v",
            "m.01_ydb4",
            "m.01_ydmy",
            "m.01_yhvb",
            "m.01_yjfc",
            "m.01_yjgp",
            "m.01_yjjm",
            "m.01_yjqc",
            "m.01_yqg4",
            "m.01_yr_z",
            "m.01_yrfl",
            "m.01_yrgm",
            "m.01_yrlg",
            "m.01_yrpq",
            "m.01_yry4",
            "m.01_ys37",
            "m.01_ys66",
            "m.01_ysl3",
            "m.01_yszb",
            "m.01_ytb1",
            "m.01_ytcq",
            "m.01_yv9p",
            "m.01_yvfs",
            "m.01_yxn1",
            "m.01_yxyn",
            "m.01_yycq",
            "m.01_zhy6",
            "m.01_znb8",
            "m.01_zp8l",
            "m.02wvhc5",
            "m.03ds9j3",
            "m.07nqpnj",
            "m.07nqpnr",
            "m.07nqpnz",
            "m.07nqpp5",
            "m.07nqppd",
            "m.07nqppm",
            "m.07nqppv",
            "m.07nqpq_",
            "m.07nqpq1",
            "m.07nqpq8",
            "m.07nqpqh",
            "m.07nqpqq",
            "m.07nqpr6",
            "m.07nqprf",
            "m.07nqprn",
            "m.07nqprw",
            "m.07nqps2",
            "m.07nqps9",
            "m.09rzq2n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fpzwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fpzwf ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0fpzwf)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Minneapolis ] )",
        "gold_entity_map": {
            "m.0fpzwf": "Minneapolis"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-205",
        "question": "what country is the west bank located in",
        "comp_type": null,
        "answer": [
            "m.0604m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082pc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082pc ns:base.biblioness.bibs_location.country ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.country) m.082pc)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ West Bank ] )",
        "gold_entity_map": {
            "m.082pc": "West Bank"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.country": "base , biblioness , bibs location , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-206",
        "question": "who won golden boot",
        "comp_type": null,
        "answer": [
            "m.02xt6q",
            "m.04j7c7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0by030z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0by030z ns:award.award_category.winners ?y .\n?y ns:award.award_honor.award_winner ?x .\n}\n",
        "sexpr": "(JOIN (R award.award_honor.award_winner) (JOIN (R award.award_category.winners) m.0by030z))",
        "normed_sexpr": "( JOIN ( R [ award , award honor , award winner ] ) ( JOIN ( R [ award , award category , winners ] ) [ Premier League Golden Boot ] ) )",
        "gold_entity_map": {
            "m.0by030z": "Premier League Golden Boot"
        },
        "gold_relation_map": {
            "award.award_honor.award_winner": "award , award honor , award winner",
            "award.award_category.winners": "award , award category , winners"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-207",
        "question": "where did jane mansfield die",
        "comp_type": null,
        "answer": [
            "m.0tmsj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024y6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024y6w ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.024y6w)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Jayne Mansfield ] )",
        "gold_entity_map": {
            "m.024y6w": "Jayne Mansfield"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-208",
        "question": "where is the thames river located",
        "comp_type": null,
        "answer": [
            "m.02j9z",
            "m.02jx1",
            "m.07ssc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d2kt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d2kt ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0d2kt)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ River Thames ] )",
        "gold_entity_map": {
            "m.0d2kt": "River Thames"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-210",
        "question": "what school did william shakespeare attend",
        "comp_type": null,
        "answer": [
            "m.08p297"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.081k8))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ William Shakespeare ] ) )",
        "gold_entity_map": {
            "m.081k8": "William Shakespeare"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-211",
        "question": "what money do they use in chile",
        "comp_type": null,
        "answer": [
            "m.0172zs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.01p1v)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Chile ] )",
        "gold_entity_map": {
            "m.01p1v": "Chile"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-219",
        "question": "what does nick cannon play in",
        "comp_type": null,
        "answer": [
            "m.0125f1",
            "m.02pzsft",
            "m.02vrvv",
            "m.0cnyxtv",
            "m.0d4x_3",
            "m.0m_921m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d1st)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d1st ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.01d1st))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Nick Cannon ] ) )",
        "gold_entity_map": {
            "m.01d1st": "Nick Cannon"
        },
        "gold_relation_map": {
            "tv.tv_actor.starring_roles": "tv , tv actor , starring roles",
            "tv.regular_tv_appearance.series": "tv , regular tv appearance , series"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-222",
        "question": "where did matthias schleiden go to school",
        "comp_type": null,
        "answer": [
            "m.0pmcz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dd3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dd3q ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0dd3q))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Matthias Jakob Schleiden ] ) )",
        "gold_entity_map": {
            "m.0dd3q": "Matthias Jakob Schleiden"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-223",
        "question": "what county is rihanna from",
        "comp_type": null,
        "answer": [
            "m.0162v"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.06mt91 ns:people.person.place_of_birth ?y .\n\t?y ns:location.location.containedby ?x .\n\t?x ns:common.topic.notable_types ns:m.01mp .  #Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-224",
        "question": "what happened to daddy yankee",
        "comp_type": null,
        "answer": [
            "m.032s66"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wbl_r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wbl_r ns:base.disaster2.injured_person.injuries ?y .\n?y ns:base.disaster2.injury.type_of_event ?x .\n}\n",
        "sexpr": "(JOIN (R base.disaster2.injury.type_of_event) (JOIN (R base.disaster2.injured_person.injuries) m.01wbl_r))",
        "normed_sexpr": "( JOIN ( R [ base , disaster2 , injury , type of event ] ) ( JOIN ( R [ base , disaster2 , injured person , injuries ] ) [ Daddy Yankee ] ) )",
        "gold_entity_map": {
            "m.01wbl_r": "Daddy Yankee"
        },
        "gold_relation_map": {
            "base.disaster2.injury.type_of_event": "base , disaster2 , injury , type of event",
            "base.disaster2.injured_person.injuries": "base , disaster2 , injured person , injuries"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-229",
        "question": "what language do they speak in thai",
        "comp_type": null,
        "answer": [
            "m.0c_v2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07f1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07f1x ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.07f1x)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Thailand ] )",
        "gold_entity_map": {
            "m.07f1x": "Thailand"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-236",
        "question": "where was princess leia raised",
        "comp_type": null,
        "answer": [
            "g.120mc0gk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ddqw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ddqw ns:fictional_universe.fictional_character.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.place_of_birth) m.0ddqw)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , place of birth ] ) [ Leia Organa ] )",
        "gold_entity_map": {
            "m.0ddqw": "Leia Organa"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.place_of_birth": "fictional universe , fictional character , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-237",
        "question": "what is the name of the pittsburgh steelers head coach",
        "comp_type": null,
        "answer": [
            "m.0c5f_j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:american_football.football_team.current_head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.current_head_coach) m.05tfm)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , current head coach ] ) [ Pittsburgh Steelers ] )",
        "gold_entity_map": {
            "m.05tfm": "Pittsburgh Steelers"
        },
        "gold_relation_map": {
            "american_football.football_team.current_head_coach": "american football , football team , current head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-239",
        "question": "when did the lakers win the championship",
        "comp_type": null,
        "answer": [
            "m.04gg8b0",
            "m.08x9_6",
            "m.08x9ff",
            "m.08x9gt",
            "m.08x9hh",
            "m.08x9v9",
            "m.08x9w1",
            "m.08x9x3",
            "m.08x9z5",
            "m.0bx_x85",
            "m.0cs1ny",
            "m.0cs2tz",
            "m.0cs2wc",
            "m.0cs2z5",
            "m.0ct7_g",
            "m.0ct81k",
            "m.0n4cn6w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmk7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmk7 ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0jmk7)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Los Angeles Lakers ] )",
        "gold_entity_map": {
            "m.0jmk7": "Los Angeles Lakers"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-242",
        "question": "what did patrick swayze sing",
        "comp_type": null,
        "answer": [
            "m.010fyfc",
            "m.0fhpy55",
            "m.0g0szh8",
            "m.0g7rg7k",
            "m.0g93m8p",
            "m.0lr1bk",
            "m.0lr1c6",
            "m.0nn3wj9",
            "m.0q19z6",
            "m.0rsh2gn",
            "m.0sjjh13",
            "m.0x4dsp",
            "m.0yhl4q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h3tp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h3tp ns:music.artist.track ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.track) m.02h3tp)",
        "normed_sexpr": "( JOIN ( R [ music , artist , track ] ) [ Patrick Swayze ] )",
        "gold_entity_map": {
            "m.02h3tp": "Patrick Swayze"
        },
        "gold_relation_map": {
            "music.artist.track": "music , artist , track"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-243",
        "question": "what style of art is salvador dali",
        "comp_type": null,
        "answer": [
            "m.02csf",
            "m.05qdh",
            "m.05wkw",
            "m.06msq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09_xn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09_xn ns:visual_art.visual_artist.art_forms ?x .\n}\n",
        "sexpr": "(JOIN (R visual_art.visual_artist.art_forms) m.09_xn)",
        "normed_sexpr": "( JOIN ( R [ visual art , visual artist , art forms ] ) [ Salvador Domingo Felipe Jacinto Dalí i Domènech ] )",
        "gold_entity_map": {
            "m.09_xn": "Salvador Domingo Felipe Jacinto Dalí i Domènech"
        },
        "gold_relation_map": {
            "visual_art.visual_artist.art_forms": "visual art , visual artist , art forms"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-244",
        "question": "what city was leonardo da vinci from",
        "comp_type": null,
        "answer": [
            "m.032kkn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.04lg6)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Leonardo da Vinci ] )",
        "gold_entity_map": {
            "m.04lg6": "Leonardo da Vinci"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    }
]