[
    {
        "ID": "WebQTrn-2105",
        "question": "where 's wayne state",
        "comp_type": null,
        "answer": [
            "m.05fhy",
            "m.09c7w0",
            "m.0xbqg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.065n9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.065n9c ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.065n9c)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Wayne State College ] )",
        "gold_entity_map": {
            "m.065n9c": "Wayne State College"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2112",
        "question": "which country is gaza city located",
        "comp_type": null,
        "answer": [
            "m.01k0p4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0357_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0357_ ns:location.administrative_division.country ?x .\n}\n",
        "sexpr": "(JOIN (R location.administrative_division.country) m.0357_)",
        "normed_sexpr": "( JOIN ( R [ location , administrative division , country ] ) [ Gaza Strip ] )",
        "gold_entity_map": {
            "m.0357_": "Gaza Strip"
        },
        "gold_relation_map": {
            "location.administrative_division.country": "location , administrative division , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2114",
        "question": "what country did james watt come from",
        "comp_type": null,
        "answer": [
            "m.014tss",
            "m.06q1r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043rm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043rm ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.043rm)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ James Watt ] )",
        "gold_entity_map": {
            "m.043rm": "James Watt"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2121",
        "question": "what are the two houses in congress",
        "comp_type": null,
        "answer": [
            "m.07t58",
            "m.0b3wk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07t31)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07t31 ns:government.governmental_body.component_bodies ?x .\n}\n",
        "sexpr": "(JOIN (R government.governmental_body.component_bodies) m.07t31)",
        "normed_sexpr": "( JOIN ( R [ government , governmental body , component bodies ] ) [ United States Congress ] )",
        "gold_entity_map": {
            "m.07t31": "United States Congress"
        },
        "gold_relation_map": {
            "government.governmental_body.component_bodies": "government , governmental body , component bodies"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2123",
        "question": "what is the major language spoken in canada",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.064_8sq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.0d060g)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Canada ] )",
        "gold_entity_map": {
            "m.0d060g": "Canada"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2124",
        "question": "what did camille grammer do for a living",
        "comp_type": null,
        "answer": [
            "m.01d_h8",
            "m.02h6p92",
            "m.02hrh1q",
            "m.0d1pc",
            "m.0dxtg",
            "m.0dypbr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06x0s_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06x0s_ ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.06x0s_)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Camille Grammer ] )",
        "gold_entity_map": {
            "m.06x0s_": "Camille Grammer"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2127",
        "question": "who did georgia o'keeffe inspired",
        "comp_type": null,
        "answer": [
            "m.06hzym"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01t807)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01t807 ns:influence.influence_node.influenced ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced) m.01t807)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced ] ) [ Georgia O'Keeffe ] )",
        "gold_entity_map": {
            "m.01t807": "Georgia O'Keeffe"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced": "influence , influence node , influenced"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2130",
        "question": "who was queen elizabeth the first 's mother",
        "comp_type": null,
        "answer": [
            "m.09sxn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rg_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rg_ ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.parents) m.02rg_))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Elizabeth I of England ] ) )",
        "gold_entity_map": {
            "m.02zsn": "Female",
            "m.02rg_": "Elizabeth I of England"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2135",
        "question": "who played heath barkley",
        "comp_type": null,
        "answer": [
            "m.02vz7q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05psqzd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05psqzd ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.05psqzd))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Heath Barkley ] ) )",
        "gold_entity_map": {
            "m.05psqzd": "Heath Barkley"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2138",
        "question": "what did edward jenner do for a living",
        "comp_type": null,
        "answer": [
            "m.05t4q",
            "m.06q2q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ljb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ljb ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02ljb)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Edward Jenner ] )",
        "gold_entity_map": {
            "m.02ljb": "Edward Jenner"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2140",
        "question": "what did brittany murphy died of",
        "comp_type": null,
        "answer": [
            "m.02q7n0v",
            "m.0dq9p",
            "m.0lcdk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0168dy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0168dy ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0168dy)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Brittany Murphy ] )",
        "gold_entity_map": {
            "m.0168dy": "Brittany Murphy"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2146",
        "question": "where is amsterdam ohio",
        "comp_type": null,
        "answer": [
            "m.0n25q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yyzd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yyzd ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0yyzd)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Amsterdam ] )",
        "gold_entity_map": {
            "m.0yyzd": "Amsterdam"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2149",
        "question": "who did stephenie meyer play in twilight",
        "comp_type": null,
        "answer": [
            "m.0hq8yww"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c4_9m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c4_9m ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.character) (JOIN (R film.actor.film) m.0c4_9m))",
        "normed_sexpr": "( JOIN ( R [ film , performance , character ] ) ( JOIN ( R [ film , actor , film ] ) [ Stephenie Meyer ] ) )",
        "gold_entity_map": {
            "m.0c4_9m": "Stephenie Meyer"
        },
        "gold_relation_map": {
            "film.performance.character": "film , performance , character",
            "film.actor.film": "film , actor , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2152",
        "question": "what teams are in the american league west",
        "comp_type": null,
        "answer": [
            "m.04wmvz",
            "m.05kmnv1",
            "m.05kmp0g",
            "m.05m_8",
            "m.06wpc",
            "m.07l8x",
            "m.0fq2vj2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07fbnf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07fbnf ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_participation.team) (JOIN (R sports.sports_league.teams) m.07fbnf))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league participation , team ] ) ( JOIN ( R [ sports , sports league , teams ] ) [ American League West ] ) )",
        "gold_entity_map": {
            "m.07fbnf": "American League West"
        },
        "gold_relation_map": {
            "sports.sports_league.teams": "sports , sports league , teams",
            "sports.sports_league_participation.team": "sports , sports league participation , team"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2153",
        "question": "what books did robert burns wrote",
        "comp_type": null,
        "answer": [
            "m.027lmtz",
            "m.027lnn3",
            "m.02p8h3t",
            "m.02qt8h",
            "m.02w0mx1",
            "m.066_9kw",
            "m.0669zx",
            "m.067_bxw",
            "m.0677wg6",
            "m.0678xhf",
            "m.067b07j",
            "m.067f5fh",
            "m.067fpvf",
            "m.067h7v0",
            "m.067qh4d",
            "m.067qvj5",
            "m.068_8zd",
            "m.06822w2",
            "m.068b6vf",
            "m.068l879",
            "m.069_n63",
            "m.0695571",
            "m.0696zbz",
            "m.069nqbq",
            "m.069y65k",
            "m.06b124w",
            "m.06b8lrh",
            "m.06bmsf2",
            "m.06c_nl7",
            "m.06c4s0z",
            "m.06c90nz",
            "m.06c90p6",
            "m.06ctfkv",
            "m.06cv4qh",
            "m.06dky53",
            "m.06dsmy0",
            "m.06f181s",
            "m.06f5fk7",
            "m.06f5x4r",
            "m.06f6ng9",
            "m.06fb3tc",
            "m.06fgfpj",
            "m.06fnpdg",
            "m.06ft0jd",
            "m.06fvg4v",
            "m.06fw7t0",
            "m.06fzzbs",
            "m.06g0_s_",
            "m.06g525x",
            "m.06g5rhg",
            "m.06g62qf",
            "m.06gkj5f",
            "m.06h09xn",
            "m.06h3ts3",
            "m.06h3ttc",
            "m.06h6c5k",
            "m.06hhvth",
            "m.06hlcyx",
            "m.06hn3z_",
            "m.06hn6fd",
            "m.06hppk1",
            "m.06hpr43",
            "m.06hv2pk",
            "m.06jbdfs",
            "m.06jc109",
            "m.06jfd8t",
            "m.06jgxj_",
            "m.06jld_b",
            "m.06jvgj3",
            "m.06jy9mh",
            "m.06k1xyd",
            "m.06kcll_",
            "m.06kcp3s",
            "m.06krdf2",
            "m.06kx2xq",
            "m.06l_wm2",
            "m.06l3d1v",
            "m.06lcg50",
            "m.06m0z4",
            "m.06mjn2m",
            "m.06mlc5k",
            "m.06mq4ff",
            "m.06mq4hn",
            "m.06n_h05",
            "m.06n3sc6",
            "m.06n3t08",
            "m.06nd6yp",
            "m.06ngbc2",
            "m.06npbgn",
            "m.06nt4qr",
            "m.06nxy20",
            "m.06p1fvw",
            "m.06p9fy2",
            "m.06pyz7x",
            "m.06qlv9c",
            "m.06qn7ny",
            "m.06qp04m",
            "m.06qq42c",
            "m.06qqmzw",
            "m.06qsrwv",
            "m.06qtwf3",
            "m.06r856p",
            "m.06r8cl6",
            "m.06rsh3d",
            "m.06rwgsk",
            "m.06ryqtm",
            "m.06s2vfr",
            "m.06sdgr8",
            "m.06smswh",
            "m.06sshd5",
            "m.06thbrs",
            "m.06tsn05",
            "m.06tvl9k",
            "m.06txwyr",
            "m.06vmx77",
            "m.0776cx",
            "m.09xx2c",
            "m.0b1x44",
            "m.0bbgtt_",
            "m.0bbh361",
            "m.0bbhjd4",
            "m.0bbhqhv",
            "m.0bnf0m",
            "m.0bqr0mt",
            "m.0bqz4_4",
            "m.0bqz4_c",
            "m.0c1tbv_",
            "m.0c1tbvt",
            "m.0c1tbvx",
            "m.0c1tbw2",
            "m.0c1tbw5",
            "m.0c1tbw8",
            "m.0c1tbwg",
            "m.0c1tbwk",
            "m.0c1tbwr",
            "m.0c1tbwv",
            "m.0c1tbwy",
            "m.0c1tbx0",
            "m.0c1tbx3",
            "m.0c1tbx6",
            "m.0c1tbx9",
            "m.0c1tbxd",
            "m.0c1tbxh",
            "m.0c1tbxl",
            "m.0c1tbxp",
            "m.0c1tbxs",
            "m.0cwm6k",
            "m.0fq1fcz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09482)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09482 ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.09482)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Robert Burns ] )",
        "gold_entity_map": {
            "m.09482": "Robert Burns"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2156",
        "question": "what are the name of mitt romney sons",
        "comp_type": null,
        "answer": [
            "m.02kvkl_",
            "m.02kvkmn",
            "m.02kvkmy",
            "m.03m5dk9",
            "m.03qj3pv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0271_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0271_s ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.children) m.0271_s))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Mitt Romney ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.0271_s": "Mitt Romney"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2160",
        "question": "what was robert hooke 's contributions to science",
        "comp_type": null,
        "answer": [
            "m.012d66",
            "m.04j8js",
            "m.056jh0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6j4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6j4 ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.0d6j4)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ Robert Hooke ] )",
        "gold_entity_map": {
            "m.0d6j4": "Robert Hooke"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2166",
        "question": "who is nick grimshaw",
        "comp_type": null,
        "answer": [
            "m.015cjr",
            "m.02dsz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03cly4v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03cly4v ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03cly4v)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Nick Grimshaw ] )",
        "gold_entity_map": {
            "m.03cly4v": "Nick Grimshaw"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2167",
        "question": "what did florence sabin do",
        "comp_type": null,
        "answer": [
            "m.05t4q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033_w4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033_w4 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.033_w4)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Florence R. Sabin ] )",
        "gold_entity_map": {
            "m.033_w4": "Florence R. Sabin"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2171",
        "question": "where did audie murphy grow up",
        "comp_type": null,
        "answer": [
            "m.04bwqsw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_nh0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_nh0 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01_nh0)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Audie Murphy ] )",
        "gold_entity_map": {
            "m.01_nh0": "Audie Murphy"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2172",
        "question": "what school does bart simpson go to",
        "comp_type": null,
        "answer": [
            "m.0h2m5t_",
            "m.0h8cb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h6cb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h6cb ns:fictional_universe.fictional_character.education ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.education) m.0h6cb)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , education ] ) [ Bart Simpson ] )",
        "gold_entity_map": {
            "m.0h6cb": "Bart Simpson"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.education": "fictional universe , fictional character , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2176",
        "question": "where is okemos michigan",
        "comp_type": null,
        "answer": [
            "m.0njlp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0v7_g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0v7_g ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0v7_g)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Okemos ] )",
        "gold_entity_map": {
            "m.0v7_g": "Okemos"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2177",
        "question": "where did caroline kennedy go to school",
        "comp_type": null,
        "answer": [
            "m.01k7xz",
            "m.01mpwj",
            "m.01n951",
            "m.03ksy",
            "m.0bf5w5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y603)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y603 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.01y603))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Caroline Kennedy ] ) )",
        "gold_entity_map": {
            "m.01y603": "Caroline Kennedy"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2181",
        "question": "who is the ravens coach",
        "comp_type": null,
        "answer": [
            "m.0c2fvr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:american_football.football_team.current_head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.current_head_coach) m.01ct6)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , current head coach ] ) [ Baltimore Ravens ] )",
        "gold_entity_map": {
            "m.01ct6": "Baltimore Ravens"
        },
        "gold_relation_map": {
            "american_football.football_team.current_head_coach": "american football , football team , current head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2197",
        "question": "what does the roman empire consist of",
        "comp_type": null,
        "answer": [
            "g.120phpf9",
            "m.0_g_73y",
            "m.05h20fb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:location.location.contains ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.contains) m.06cmp)",
        "normed_sexpr": "( JOIN ( R [ location , location , contains ] ) [ Roman Empire ] )",
        "gold_entity_map": {
            "m.06cmp": "Roman Empire"
        },
        "gold_relation_map": {
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2198",
        "question": "what did fred goodwin do",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.04p2dz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cfvw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cfvw ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.05cfvw)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Fred Goodwin ] )",
        "gold_entity_map": {
            "m.05cfvw": "Fred Goodwin"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2203",
        "question": "where is port charlotte florida located",
        "comp_type": null,
        "answer": [
            "m.0jgk_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rjvf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rjvf ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0rjvf)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Port Charlotte ] )",
        "gold_entity_map": {
            "m.0rjvf": "Port Charlotte"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2205",
        "question": "who is reba mcentire 's son",
        "comp_type": null,
        "answer": [
            "m.0n7wd1p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dpsv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dpsv ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.children) m.01dpsv))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Reba McEntire ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.01dpsv": "Reba McEntire"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2211",
        "question": "what episode does eric northman come in",
        "comp_type": null,
        "answer": [
            "m.04nvqjm",
            "m.07kd5nl",
            "m.0bh71z0",
            "m.0gfwvpj",
            "m.0j6tx9m",
            "m.0k6j758",
            "m.0wj_9lr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0411sjw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0411sjw ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.seasons ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.seasons) (JOIN (R tv.tv_character.appeared_in_tv_program) m.0411sjw))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , seasons ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Eric Northman ] ) )",
        "gold_entity_map": {
            "m.0411sjw": "Eric Northman"
        },
        "gold_relation_map": {
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program",
            "tv.regular_tv_appearance.seasons": "tv , regular tv appearance , seasons"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2212",
        "question": "what was elijah mccoy famous for",
        "comp_type": null,
        "answer": [
            "m.03sbb",
            "m.09j9h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0199mw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0199mw ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0199mw)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Elijah McCoy ] )",
        "gold_entity_map": {
            "m.0199mw": "Elijah McCoy"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    }
]