[
    {
        "ID": "WebQTrn-3313",
        "question": "what nationality is zack de la rocha",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01gdlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01gdlz ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.01gdlz)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Zack de la Rocha ] )",
        "gold_entity_map": {
            "m.01gdlz": "Zack de la Rocha"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3316",
        "question": "what did doc holliday die from",
        "comp_type": null,
        "answer": [
            "m.07jwr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01rl_m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01rl_m ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01rl_m)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Doc Holliday ] )",
        "gold_entity_map": {
            "m.01rl_m": "Doc Holliday"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3320",
        "question": "who was the owner of kfc",
        "comp_type": null,
        "answer": [
            "m.09b78"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6t ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.09b6t)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ KFC ] )",
        "gold_entity_map": {
            "m.09b6t": "KFC"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3321",
        "question": "where did robin gibb die",
        "comp_type": null,
        "answer": [
            "m.04jpl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0137hn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0137hn ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.0137hn)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Robin Gibb ] )",
        "gold_entity_map": {
            "m.0137hn": "Robin Gibb"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3324",
        "question": "who plays jim halpert",
        "comp_type": null,
        "answer": [
            "m.060j8b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09x660)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09x660 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.09x660))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Jim Halpert ] ) )",
        "gold_entity_map": {
            "m.09x660": "Jim Halpert"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3326",
        "question": "who is john cabot 's parents",
        "comp_type": null,
        "answer": [
            "m.0qg2wdg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040t9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040t9 ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.040t9)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ John Cabot ] )",
        "gold_entity_map": {
            "m.040t9": "John Cabot"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3327",
        "question": "what is the capital city of montana usa",
        "comp_type": null,
        "answer": [
            "m.0fvxg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.050l8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.050l8 ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.capital) m.050l8)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Montana ] )",
        "gold_entity_map": {
            "m.050l8": "Montana"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.capital": "base , aareas , schema , administrative area , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3330",
        "question": "what george washington carver famous for",
        "comp_type": null,
        "answer": [
            "m.02k76m0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djm ns:common.topic.notable_types ?x .\n}\n",
        "sexpr": "(JOIN (R common.topic.notable_types) m.03djm)",
        "normed_sexpr": "( JOIN ( R [ common , topic , notable types ] ) [ George Washington Carver ] )",
        "gold_entity_map": {
            "m.03djm": "George Washington Carver"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3331",
        "question": "what is the zip code for wildwood",
        "comp_type": null,
        "answer": [
            "m.020796r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xm82)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xm82 ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0xm82)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Wildwood ] )",
        "gold_entity_map": {
            "m.0xm82": "Wildwood"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3333",
        "question": "where did bronx tale take place",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02t4w7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02t4w7 ns:film.film.country ?x .\n}\n",
        "sexpr": "(JOIN (R film.film.country) m.02t4w7)",
        "normed_sexpr": "( JOIN ( R [ film , film , country ] ) [ A Bronx Tale ] )",
        "gold_entity_map": {
            "m.02t4w7": "A Bronx Tale"
        },
        "gold_relation_map": {
            "film.film.country": "film , film , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3335",
        "question": "what kind of money do they use in russia",
        "comp_type": null,
        "answer": [
            "m.01hy_q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.06bnz)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Russia ] )",
        "gold_entity_map": {
            "m.06bnz": "Russia"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3336",
        "question": "what does uvm stand for college",
        "comp_type": null,
        "answer": [
            "University of Vermont"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q7q2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q7q2 ns:type.object.name ?x .\n}\n",
        "sexpr": "(JOIN (R type.object.name) m.01q7q2)",
        "normed_sexpr": "( JOIN ( R [ type , object , name ] ) [ University of Vermont ] )",
        "gold_entity_map": {
            "m.01q7q2": "University of Vermont"
        },
        "gold_relation_map": {
            "type.object.name": "type , object , name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3337",
        "question": "who plays edward elric",
        "comp_type": null,
        "answer": [
            "m.03dkz7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.074qkg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.074qkg ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.074qkg))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Edward Elric ] ) )",
        "gold_entity_map": {
            "m.074qkg": "Edward Elric"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3344",
        "question": "where did frank baum live",
        "comp_type": null,
        "answer": [
            "m.071cn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04mby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04mby ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.04mby))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ L. Frank Baum ] ) )",
        "gold_entity_map": {
            "m.04mby": "L. Frank Baum"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3345",
        "question": "what time is the grand prix starting",
        "comp_type": null,
        "answer": [
            "1949"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f5cl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f5cl ns:time.recurring_event.date_of_first_occurance ?x .\n}\n",
        "sexpr": "(JOIN (R time.recurring_event.date_of_first_occurance) m.0f5cl)",
        "normed_sexpr": "( JOIN ( R [ time , recurring event , date of first occurance ] ) [ Grand Prix motorcycle racing ] )",
        "gold_entity_map": {
            "m.0f5cl": "Grand Prix motorcycle racing"
        },
        "gold_relation_map": {
            "time.recurring_event.date_of_first_occurance": "time , recurring event , date of first occurance"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3346",
        "question": "what are the places to see in dubai",
        "comp_type": null,
        "answer": [
            "m.025smcz",
            "m.02768mb",
            "m.027tlcs",
            "m.02q24rq",
            "m.02qkhn8",
            "m.02qmbrc",
            "m.02qyvdt",
            "m.03c3yb1",
            "m.03cn0v",
            "m.03m57sn",
            "m.03nyg2",
            "m.03whtz_",
            "m.03yb84v",
            "m.0405p7v",
            "m.04q5nb",
            "m.05bf4c",
            "m.06152r",
            "m.065z06l",
            "m.06jpgt",
            "m.06zn69y",
            "m.084blh",
            "m.084z1l",
            "m.09cwdq",
            "m.0bsbx_",
            "m.0bxdn4",
            "m.0cnyfm6",
            "m.0q40862"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f08r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f08r ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.01f08r)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Dubai ] )",
        "gold_entity_map": {
            "m.01f08r": "Dubai"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3347",
        "question": "where is johnny depp from",
        "comp_type": null,
        "answer": [
            "m.0pqz3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jfx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jfx1 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0jfx1)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Johnny Depp ] )",
        "gold_entity_map": {
            "m.0jfx1": "Johnny Depp"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3350",
        "question": "what language do pakistani people talk",
        "comp_type": null,
        "answer": [
            "m.01hk9",
            "m.01wb_k",
            "m.01yc4j",
            "m.02h40lc",
            "m.02hxcvy",
            "m.02jxdd",
            "m.04jph7t",
            "m.0688f",
            "m.0gl97",
            "m.0hlyy",
            "m.0swlx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05sb1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05sb1 ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.05sb1)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Pakistan ] )",
        "gold_entity_map": {
            "m.05sb1": "Pakistan"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3351",
        "question": "what does china border",
        "comp_type": null,
        "answer": [
            "m.016zwt",
            "m.01crd5",
            "m.02jffn",
            "m.02jfhv",
            "m.02jfm5",
            "m.03_3d",
            "m.03rk0",
            "m.047lj",
            "m.04hhv",
            "m.04w8f",
            "m.04xn_",
            "m.05b7q",
            "m.05sb1",
            "m.06bnz",
            "m.06f32",
            "m.07bxhl",
            "m.07dvs",
            "m.0dpsf",
            "m.0jdd",
            "m.0jt3tjf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n}\n",
        "sexpr": "(JOIN (R location.adjoining_relationship.adjoins) (JOIN (R location.location.adjoin_s) m.0d05w3))",
        "normed_sexpr": "( JOIN ( R [ location , adjoining relationship , adjoins ] ) ( JOIN ( R [ location , location , adjoin s ] ) [ China ] ) )",
        "gold_entity_map": {
            "m.0d05w3": "China"
        },
        "gold_relation_map": {
            "location.adjoining_relationship.adjoins": "location , adjoining relationship , adjoins",
            "location.location.adjoin_s": "location , location , adjoin s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3353",
        "question": "what was alice walker famous for",
        "comp_type": null,
        "answer": [
            "m.02xhgwq",
            "m.05z96",
            "m.0cbd2",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv70 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0bv70)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Alice Walker ] )",
        "gold_entity_map": {
            "m.0bv70": "Alice Walker"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3356",
        "question": "where is the time zone in kentucky",
        "comp_type": null,
        "answer": [
            "m.02_37z",
            "m.02fqwt",
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0498y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0498y ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0498y)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Kentucky ] )",
        "gold_entity_map": {
            "m.0498y": "Kentucky"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3357",
        "question": "what albums did john frusciante play on",
        "comp_type": null,
        "answer": [
            "m.01022704",
            "m.012r4mlt",
            "m.012r4w47",
            "m.01md96d",
            "m.01md97f",
            "m.01md9b1",
            "m.01md9fk",
            "m.01md9g_",
            "m.01md9hj",
            "m.01md9jh",
            "m.01md9kf",
            "m.01md9nh",
            "m.01r4vpc",
            "m.026yhz8",
            "m.0282sm_",
            "m.0282t7l",
            "m.0282vcx",
            "m.04q3cf2",
            "m.0bs2hyk",
            "m.0jwvsmg",
            "m.0qbj2cj",
            "m.0w7klj3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0191h5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0191h5 ns:music.artist.album ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.album) m.0191h5)",
        "normed_sexpr": "( JOIN ( R [ music , artist , album ] ) [ John Frusciante ] )",
        "gold_entity_map": {
            "m.0191h5": "John Frusciante"
        },
        "gold_relation_map": {
            "music.artist.album": "music , artist , album"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3358",
        "question": "what influenced whitman 's poetry",
        "comp_type": null,
        "answer": [
            "m.02lt8",
            "m.039n1",
            "m.05np2",
            "m.06jkm",
            "m.06y8v",
            "m.0bwx3",
            "m.0gzh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.085gk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.085gk ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.085gk)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Walt Whitman ] )",
        "gold_entity_map": {
            "m.085gk": "Walt Whitman"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3359",
        "question": "what did martin luther king jr do in his life",
        "comp_type": null,
        "answer": [
            "m.018cwm",
            "m.020mgv",
            "m.04lxyz0",
            "m.065qmpf",
            "m.074v_1j",
            "m.097s4",
            "m.0g4pf68"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:base.activism.activist.area_of_activism ?x .\n}\n",
        "sexpr": "(JOIN (R base.activism.activist.area_of_activism) m.051cc)",
        "normed_sexpr": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Martin Luther King, Jr. ] )",
        "gold_entity_map": {
            "m.051cc": "Martin Luther King, Jr."
        },
        "gold_relation_map": {
            "base.activism.activist.area_of_activism": "base , activism , activist , area of activism"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3361",
        "question": "where did jimmy hoffa live",
        "comp_type": null,
        "answer": [
            "m.03v1s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lx0r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lx0r ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.01lx0r))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Jimmy Hoffa ] ) )",
        "gold_entity_map": {
            "m.01lx0r": "Jimmy Hoffa"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3363",
        "question": "where people speak welsh",
        "comp_type": null,
        "answer": [
            "m.014tss",
            "m.0576g9",
            "m.07ssc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083tk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083tk ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.countries_spoken_in) m.083tk)",
        "normed_sexpr": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Welsh Language ] )",
        "gold_entity_map": {
            "m.083tk": "Welsh Language"
        },
        "gold_relation_map": {
            "language.human_language.countries_spoken_in": "language , human language , countries spoken in"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3364",
        "question": "what children 's books did suzanne collins wrote",
        "comp_type": null,
        "answer": [
            "m.04t448_",
            "m.04t448h",
            "m.04t44bh",
            "m.0dsx8l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bpd5z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bpd5z ns:book.author.works_written ?x .\n?x ns:book.book.genre ns:m.0dwly .\n}\n",
        "sexpr": "(AND (JOIN book.book.genre m.0dwly) (JOIN (R book.author.works_written) m.0bpd5z))",
        "normed_sexpr": "( AND ( JOIN [ book , book , genre ] [ Children's literature ] ) ( JOIN ( R [ book , author , works written ] ) [ Suzanne Collins ] ) )",
        "gold_entity_map": {
            "m.0dwly": "Children's literature",
            "m.0bpd5z": "Suzanne Collins"
        },
        "gold_relation_map": {
            "book.book.genre": "book , book , genre",
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3371",
        "question": "where did elvis presley live before he died",
        "comp_type": null,
        "answer": [
            "m.0c_m3",
            "m.0wqwj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.02jq1))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Elvis Presley ] ) )",
        "gold_entity_map": {
            "m.02jq1": "Elvis Presley"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3373",
        "question": "what to do in daytona",
        "comp_type": null,
        "answer": [
            "m.0260dxn",
            "m.027rnt",
            "m.02z4mj0",
            "m.04mz450",
            "m.067f5c",
            "m.068vzy",
            "m.08j0k7",
            "m.0c18rf",
            "m.0fqspb",
            "m.0h4ncm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rsjf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rsjf ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0rsjf)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Daytona Beach ] )",
        "gold_entity_map": {
            "m.0rsjf": "Daytona Beach"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3375",
        "question": "who was the vice president during george w bush",
        "comp_type": null,
        "answer": [
            "m.0d0vj4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6zr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6zr ns:government.us_president.vice_president ?x .\n}\n",
        "sexpr": "(JOIN (R government.us_president.vice_president) m.09b6zr)",
        "normed_sexpr": "( JOIN ( R [ government , us president , vice president ] ) [ George W. Bush ] )",
        "gold_entity_map": {
            "m.09b6zr": "George W. Bush"
        },
        "gold_relation_map": {
            "government.us_president.vice_president": "government , us president , vice president"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3376",
        "question": "where did kevin hart go to school",
        "comp_type": null,
        "answer": [
            "m.01jt2w",
            "m.0gy5x53"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ggp1n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ggp1n ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0ggp1n))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Kevin Hart ] ) )",
        "gold_entity_map": {
            "m.0ggp1n": "Kevin Hart"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3379",
        "question": "where does the name melbourne come from",
        "comp_type": null,
        "answer": [
            "m.0bx7q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chgzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chgzm ns:symbols.namesake.named_after ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.namesake.named_after) m.0chgzm)",
        "normed_sexpr": "( JOIN ( R [ symbols , namesake , named after ] ) [ Melbourne ] )",
        "gold_entity_map": {
            "m.0chgzm": "Melbourne"
        },
        "gold_relation_map": {
            "symbols.namesake.named_after": "symbols , namesake , named after"
        },
        "gold_type_map": {}
    }
]