[
    {
        "ID": "WebQTrn-1412",
        "question": "what was prince charles last name",
        "comp_type": null,
        "answer": [
            "Charles Philip Arthur George"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xnc3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xnc3 ns:base.schemastaging.context_name.official_name ?x .\n}\n",
        "sexpr": "(JOIN (R base.schemastaging.context_name.official_name) m.0xnc3)",
        "normed_sexpr": "( JOIN ( R [ base , schemastaging , context name , official name ] ) [ Charles, Prince of Wales ] )",
        "gold_entity_map": {
            "m.0xnc3": "Charles, Prince of Wales"
        },
        "gold_relation_map": {
            "base.schemastaging.context_name.official_name": "base , schemastaging , context name , official name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1416",
        "question": "what website did mark zuckerberg co founder",
        "comp_type": null,
        "answer": [
            "m.02y1vz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.086dny)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.086dny ns:internet.website_owner.websites_owned ?x .\n}\n",
        "sexpr": "(JOIN (R internet.website_owner.websites_owned) m.086dny)",
        "normed_sexpr": "( JOIN ( R [ internet , website owner , websites owned ] ) [ Mark Zuckerberg ] )",
        "gold_entity_map": {
            "m.086dny": "Mark Zuckerberg"
        },
        "gold_relation_map": {
            "internet.website_owner.websites_owned": "internet , website owner , websites owned"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1417",
        "question": "what bass does jared followill use",
        "comp_type": null,
        "answer": [
            "m.018vs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w3xqs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w3xqs ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.01vj9c .\n}\n",
        "sexpr": "(AND (JOIN music.instrument.family m.01vj9c) (JOIN (R music.group_member.instruments_played) m.01w3xqs))",
        "normed_sexpr": "( AND ( JOIN [ music , instrument , family ] [ Bass ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Jared Followill ] ) )",
        "gold_entity_map": {
            "m.01w3xqs": "Jared Followill",
            "m.01vj9c": "Bass"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played",
            "music.instrument.family": "music , instrument , family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1419",
        "question": "what type of currency does the us have",
        "comp_type": null,
        "answer": [
            "m.09nqf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09c7w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09c7w0 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.09c7w0)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ United States of America ] )",
        "gold_entity_map": {
            "m.09c7w0": "United States of America"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1421",
        "question": "where is canadian county oklahoma",
        "comp_type": null,
        "answer": [
            "m.05mph",
            "m.06mq6mj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0my97)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0my97 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0my97)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Canadian County ] )",
        "gold_entity_map": {
            "m.0my97": "Canadian County"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1423",
        "question": "what does rob kardashian do for living",
        "comp_type": null,
        "answer": [
            "m.03gkb0",
            "m.0d1pc",
            "m.0dypbr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043n6dp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043n6dp ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.043n6dp)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Rob Kardashian ] )",
        "gold_entity_map": {
            "m.043n6dp": "Rob Kardashian"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1424",
        "question": "where is oceania on a map",
        "comp_type": null,
        "answer": [
            "m.05rgl",
            "m.0cq_kk5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05nrg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05nrg ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.05nrg)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Oceania ] )",
        "gold_entity_map": {
            "m.05nrg": "Oceania"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1426",
        "question": "what can you do in palm springs ca",
        "comp_type": null,
        "answer": [
            "m.0358tp",
            "m.0381tp",
            "m.05tdgy",
            "m.06_p64x",
            "m.08__9v",
            "m.0c84q7",
            "m.0crgq6",
            "m.0ggmtr",
            "m.0h032j",
            "m.0k3plgs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r3tq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r3tq ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0r3tq)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Palm Springs ] )",
        "gold_entity_map": {
            "m.0r3tq": "Palm Springs"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1429",
        "question": "who is adam sandler",
        "comp_type": null,
        "answer": [
            "m.018gz8",
            "m.01d_h8",
            "m.02hrh1q",
            "m.03gjzk",
            "m.09jwl",
            "m.0dxtg",
            "m.0nbcg",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pz91 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0pz91)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Adam Sandler ] )",
        "gold_entity_map": {
            "m.0pz91": "Adam Sandler"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1432",
        "question": "where was st elizabeth ann seton born",
        "comp_type": null,
        "answer": [
            "m.02_286"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sl19)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sl19 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01sl19)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Elizabeth Ann Seton ] )",
        "gold_entity_map": {
            "m.01sl19": "Elizabeth Ann Seton"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1433",
        "question": "what does the adriatic sea border",
        "comp_type": null,
        "answer": [
            "m.0jdx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0p_x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0p_x ns:location.location.adjoin_s ?y .\n?y ns:location.adjoining_relationship.adjoins ?x .\n}\n",
        "sexpr": "(JOIN (R location.adjoining_relationship.adjoins) (JOIN (R location.location.adjoin_s) m.0p_x))",
        "normed_sexpr": "( JOIN ( R [ location , adjoining relationship , adjoins ] ) ( JOIN ( R [ location , location , adjoin s ] ) [ Adriatic Sea ] ) )",
        "gold_entity_map": {
            "m.0p_x": "Adriatic Sea"
        },
        "gold_relation_map": {
            "location.adjoining_relationship.adjoins": "location , adjoining relationship , adjoins",
            "location.location.adjoin_s": "location , location , adjoin s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1435",
        "question": "what teams played in the 2010 stanley cup",
        "comp_type": null,
        "answer": [
            "m.0hn2q",
            "m.0jnlm"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  {\n    ns:m.0by0ww1 ns:sports.sports_championship_event.champion ?x .\n  }\n  UNION\n  {\n    ns:m.0by0ww1 ns:sports.sports_championship_event.runner_up ?x . \n  }\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0by0ww1": "2010 Stanley Cup Finals"
        },
        "gold_relation_map": {
            "sports.sports_championship_event.champion": "sports , sports championship event , champion",
            "sports.sports_championship_event.runner_up": "sports , sports championship event , runner up"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1439",
        "question": "what language do the assyrians speak",
        "comp_type": null,
        "answer": [
            "m.0dc0d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wmn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wmn ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0wmn)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Assyria ] )",
        "gold_entity_map": {
            "m.0wmn": "Assyria"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1441",
        "question": "where was abraham lincoln buried",
        "comp_type": null,
        "answer": [
            "m.04v7rs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.0gzh)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Abraham Lincoln ] )",
        "gold_entity_map": {
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1442",
        "question": "who was the grandson of king david 's father",
        "comp_type": null,
        "answer": [
            "m.01ndvc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cvn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cvn ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.02cvn))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ David ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.02cvn": "David"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1446",
        "question": "where is devon sawa now",
        "comp_type": null,
        "answer": [
            "m.080h2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0y58x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0y58x ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0y58x))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Devon Sawa ] ) )",
        "gold_entity_map": {
            "m.0y58x": "Devon Sawa"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1448",
        "question": "who was marilyn monroe 's parents",
        "comp_type": null,
        "answer": [
            "m.0gxs_rk",
            "m.0gxs_rr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wqr ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.04wqr)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Marilyn Monroe ] )",
        "gold_entity_map": {
            "m.04wqr": "Marilyn Monroe"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1450",
        "question": "where is shoreditch",
        "comp_type": null,
        "answer": [
            "m.02jx1",
            "m.04jpl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nc3h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nc3h ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0nc3h)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Shoreditch ] )",
        "gold_entity_map": {
            "m.0nc3h": "Shoreditch"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1452",
        "question": "where does the spanish language come from",
        "comp_type": null,
        "answer": [
            "m.05tjmkj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06nm1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06nm1 ns:base.rosetta.languoid.parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.rosetta.languoid.parent) m.06nm1)",
        "normed_sexpr": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Spanish Language ] )",
        "gold_entity_map": {
            "m.06nm1": "Spanish Language"
        },
        "gold_relation_map": {
            "base.rosetta.languoid.parent": "base , rosetta , languoid , parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1456",
        "question": "what political party was henry clay",
        "comp_type": null,
        "answer": [
            "m.01spy8",
            "m.07wdw",
            "m.07wf9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ct18)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ct18 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.0ct18))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Henry Clay ] ) )",
        "gold_entity_map": {
            "m.0ct18": "Henry Clay"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1457",
        "question": "what is capital city of ontario",
        "comp_type": null,
        "answer": [
            "m.0h7h6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05kr_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05kr_ ns:location.province.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.province.capital) m.05kr_)",
        "normed_sexpr": "( JOIN ( R [ location , province , capital ] ) [ Ontario ] )",
        "gold_entity_map": {
            "m.05kr_": "Ontario"
        },
        "gold_relation_map": {
            "location.province.capital": "location , province , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1462",
        "question": "what did mary harris jones accomplish",
        "comp_type": null,
        "answer": [
            "m.03qc82m",
            "m.048g08"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l0km)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l0km ns:base.activism.activist.area_of_activism ?x .\n}\n",
        "sexpr": "(JOIN (R base.activism.activist.area_of_activism) m.01l0km)",
        "normed_sexpr": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Mary Harris Jones ] )",
        "gold_entity_map": {
            "m.01l0km": "Mary Harris Jones"
        },
        "gold_relation_map": {
            "base.activism.activist.area_of_activism": "base , activism , activist , area of activism"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1465",
        "question": "where is ellis park rugby stadium",
        "comp_type": null,
        "answer": [
            "m.06z6mz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ysfk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ysfk ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01n7 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01n7) (JOIN (R location.location.containedby) m.04ysfk))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Location ] ) ( JOIN ( R [ location , location , containedby ] ) [ Ellis Park Stadium ] ) )",
        "gold_entity_map": {
            "m.01n7": "Location",
            "m.04ysfk": "Ellis Park Stadium"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01n7": "Location"
        }
    },
    {
        "ID": "WebQTrn-1466",
        "question": "what does the letters eu stand for",
        "comp_type": null,
        "answer": [
            "m.0_6t_z8",
            "m.01sxhr",
            "m.06hgr5"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  ?x ns:common.topic.alias \"EU\"@en . \n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {},
        "gold_relation_map": {
            "common.topic.alias": "common , topic , alias"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1468",
        "question": "what label is jojo signed to",
        "comp_type": null,
        "answer": [
            "m.01trtc",
            "m.01w40h",
            "m.03vlr_",
            "m.04fcjt",
            "m.05clg8",
            "m.05clhc",
            "m.0g768"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wjgjb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wjgjb ns:music.artist.label ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.label) m.01wjgjb)",
        "normed_sexpr": "( JOIN ( R [ music , artist , label ] ) [ JoJo ] )",
        "gold_entity_map": {
            "m.01wjgjb": "JoJo"
        },
        "gold_relation_map": {
            "music.artist.label": "music , artist , label"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1470",
        "question": "where did douglas macarthur die",
        "comp_type": null,
        "answer": [
            "m.0rh6k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c_jc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c_jc ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.0c_jc)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Douglas MacArthur ] )",
        "gold_entity_map": {
            "m.0c_jc": "Douglas MacArthur"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1473",
        "question": "where is hong kong china",
        "comp_type": null,
        "answer": [
            "m.0j0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h64 ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.03h64)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Hong Kong ] )",
        "gold_entity_map": {
            "m.03h64": "Hong Kong"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1474",
        "question": "what countries do they speak italian",
        "comp_type": null,
        "answer": [
            "m.015fr",
            "m.01pj7",
            "m.02q14r",
            "m.03rjj",
            "m.06mzp",
            "m.06sff",
            "m.06t8v",
            "m.07ytt",
            "m.0b90_r",
            "m.0jgd",
            "m.0rpgpql"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02bjrlw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02bjrlw ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.countries_spoken_in) m.02bjrlw)",
        "normed_sexpr": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Italian Language ] )",
        "gold_entity_map": {
            "m.02bjrlw": "Italian Language"
        },
        "gold_relation_map": {
            "language.human_language.countries_spoken_in": "language , human language , countries spoken in"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1479",
        "question": "what are bridgit mendler 's parents names",
        "comp_type": null,
        "answer": [
            "m.0qf8bfs",
            "m.0qf8bm3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04081f3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04081f3 ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.04081f3)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Bridgit Mendler ] )",
        "gold_entity_map": {
            "m.04081f3": "Bridgit Mendler"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1482",
        "question": "where is the capital of canada on the map",
        "comp_type": null,
        "answer": [
            "m.05ksh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.0d060g)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Canada ] )",
        "gold_entity_map": {
            "m.0d060g": "Canada"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1484",
        "question": "what kind of paintings did frida kahlo do",
        "comp_type": null,
        "answer": [
            "m.0127jb",
            "m.015r61",
            "m.073_6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015k04)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015k04 ns:visual_art.visual_artist.associated_periods_or_movements ?x .\n}\n",
        "sexpr": "(JOIN (R visual_art.visual_artist.associated_periods_or_movements) m.015k04)",
        "normed_sexpr": "( JOIN ( R [ visual art , visual artist , associated periods or movements ] ) [ Frida Kahlo ] )",
        "gold_entity_map": {
            "m.015k04": "Frida Kahlo"
        },
        "gold_relation_map": {
            "visual_art.visual_artist.associated_periods_or_movements": "visual art , visual artist , associated periods or movements"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1485",
        "question": "what was francisco vasquez de coronado known for",
        "comp_type": null,
        "answer": [
            "m.0jgcl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgb2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgb2 ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.object ?x .\n}\n",
        "sexpr": "(JOIN (R common.notable_for.object) (JOIN (R common.topic.notable_for) m.0jgb2))",
        "normed_sexpr": "( JOIN ( R [ common , notable for , object ] ) ( JOIN ( R [ common , topic , notable for ] ) [ Francisco Vázquez de Coronado ] ) )",
        "gold_entity_map": {
            "m.0jgb2": "Francisco Vázquez de Coronado"
        },
        "gold_relation_map": {
            "common.notable_for.object": "common , notable for , object",
            "common.topic.notable_for": "common , topic , notable for"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1486",
        "question": "what form of government does greece use",
        "comp_type": null,
        "answer": [
            "m.018wl5",
            "m.0c9rw5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.035qy)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Greece ] )",
        "gold_entity_map": {
            "m.035qy": "Greece"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    }
]