[
    {
        "ID": "WebQTrn-317",
        "question": "what sport does sally pearson compete in",
        "comp_type": null,
        "answer": [
            "m.01445t",
            "m.059846g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0287hgn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0287hgn ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0287hgn)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Sally Pearson ] )",
        "gold_entity_map": {
            "m.0287hgn": "Sally Pearson"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-318",
        "question": "where is atlanta texas located",
        "comp_type": null,
        "answer": [
            "m.0msb1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_ztb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_ztb ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0_ztb)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Atlanta ] )",
        "gold_entity_map": {
            "m.0_ztb": "Atlanta"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-320",
        "question": "where is tom cruise from",
        "comp_type": null,
        "answer": [
            "m.071cn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07r1h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07r1h ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.07r1h)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Tom Cruise ] )",
        "gold_entity_map": {
            "m.07r1h": "Tom Cruise"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-321",
        "question": "what movies did madonna appear in",
        "comp_type": null,
        "answer": [
            "m.014kq6",
            "m.017sg6",
            "m.027jdg0",
            "m.027yrxp",
            "m.02ndy4",
            "m.02pg45",
            "m.0326d9",
            "m.034d5_",
            "m.035_2h",
            "m.04_ccy",
            "m.04f31_j",
            "m.04jrlg",
            "m.04jrzl",
            "m.05b_gq",
            "m.06fht6",
            "m.07mpbj",
            "m.07vf5c",
            "m.09y6pb",
            "m.0bb1gvg",
            "m.0dtxp9",
            "m.0kv8_w",
            "m.0xndfq6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vs_v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vs_v8 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.01vs_v8))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Madonna ] ) )",
        "gold_entity_map": {
            "m.01vs_v8": "Madonna"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-323",
        "question": "where was the roman colosseum located",
        "comp_type": null,
        "answer": [
            "m.03rjj",
            "m.06c62"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d5qx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d5qx ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0d5qx)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Colosseum ] )",
        "gold_entity_map": {
            "m.0d5qx": "Colosseum"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-326",
        "question": "what time zone is new york under",
        "comp_type": null,
        "answer": [
            "m.02_37z",
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059rby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059rby ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.059rby)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ New York ] )",
        "gold_entity_map": {
            "m.059rby": "New York"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-331",
        "question": "where did bashar al assad study",
        "comp_type": null,
        "answer": [
            "m.07pnw6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_vwx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_vwx ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.01_vwx))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Bashar al-Assad ] ) )",
        "gold_entity_map": {
            "m.01_vwx": "Bashar al-Assad"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-336",
        "question": "what films did charlie chaplin direct",
        "comp_type": null,
        "answer": [
            "g.11r7rjf5y",
            "g.11vjpgmn4",
            "m.011_mj",
            "m.028ccyx",
            "m.02nmmc",
            "m.02nr5x",
            "m.02qmf5d",
            "m.02qmf84",
            "m.02qmf9w",
            "m.02qmg0x",
            "m.02rd3lk",
            "m.02rd3sr",
            "m.02rd486",
            "m.02rd4fq",
            "m.02rd4m6",
            "m.02rd7tg",
            "m.02rd7zm",
            "m.02rd81q",
            "m.02rd8fr",
            "m.02rdpf9",
            "m.02rdqf9",
            "m.02rdz11",
            "m.02sd4m",
            "m.02vl0sm",
            "m.03b1dk",
            "m.04lm51",
            "m.04vl27",
            "m.05x26y",
            "m.0617fz",
            "m.061nfk",
            "m.07lmgm",
            "m.07m2_1",
            "m.07m2js",
            "m.07m2lh",
            "m.07m2r4",
            "m.07m2sx",
            "m.07m2v9",
            "m.07m325",
            "m.07m7s0",
            "m.07m7w3",
            "m.07m82k",
            "m.07m8hw",
            "m.07mll4",
            "m.07mlq9",
            "m.07mlsy",
            "m.07mlzy",
            "m.07mmj9",
            "m.07mpcp",
            "m.07n2_l",
            "m.07n33g",
            "m.07n3pj",
            "m.07n73f",
            "m.07n76l",
            "m.07n7h2",
            "m.07n7w9",
            "m.07plln",
            "m.085r31",
            "m.08b2hs",
            "m.08gv4n",
            "m.08h1y4",
            "m.08kf7t",
            "m.08kfbx",
            "m.09lh9c",
            "m.09t69n",
            "m.0crvd9_",
            "m.0cs040k",
            "m.0f1ggl",
            "m.0fyj8w",
            "m.0gy4z",
            "m.0jq9t",
            "m.0jsfp",
            "m.0jvw0",
            "m.0jz2p",
            "m.0v3x_mv",
            "m.0v3y82z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lc5 ns:film.director.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.director.film) m.01lc5)",
        "normed_sexpr": "( JOIN ( R [ film , director , film ] ) [ Charlie Chaplin ] )",
        "gold_entity_map": {
            "m.01lc5": "Charlie Chaplin"
        },
        "gold_relation_map": {
            "film.director.film": "film , director , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-344",
        "question": "who were anakin skywalker 's parents",
        "comp_type": null,
        "answer": [
            "m.0ddqd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2y0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2y0 ns:fictional_universe.fictional_character.parents ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.parents) m.0f2y0)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , parents ] ) [ Darth Vader ] )",
        "gold_entity_map": {
            "m.0f2y0": "Darth Vader"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.parents": "fictional universe , fictional character , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-347",
        "question": "what exactly did dale earnhardt die from",
        "comp_type": null,
        "answer": [
            "m.06c7cpj",
            "m.07qd_p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026fx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026fx ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.026fx)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Dale Earnhardt ] )",
        "gold_entity_map": {
            "m.026fx": "Dale Earnhardt"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-348",
        "question": "what year did miami heat win the championship",
        "comp_type": null,
        "answer": [
            "m.0bq7g4",
            "m.0jwzhbj",
            "m.0vpt91g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm2v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm2v ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0jm2v)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Miami Heat ] )",
        "gold_entity_map": {
            "m.0jm2v": "Miami Heat"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-349",
        "question": "what kind of government did benito mussolini have",
        "comp_type": null,
        "answer": [
            "m.062zj5",
            "m.09v62_g",
            "m.0bbycd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0177g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0177g ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.0177g))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Benito Mussolini ] ) )",
        "gold_entity_map": {
            "m.0177g": "Benito Mussolini"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-350",
        "question": "who was emperor diocletian",
        "comp_type": null,
        "answer": [
            "m.01g14w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02d0k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02d0k ns:user.robert.roman_empire.roman_emperor.title ?x .\n}\n",
        "sexpr": "(JOIN (R user.robert.roman_empire.roman_emperor.title) m.02d0k)",
        "normed_sexpr": "( JOIN ( R [ user , robert , roman empire , roman emperor , title ] ) [ Diocletian ] )",
        "gold_entity_map": {
            "m.02d0k": "Diocletian"
        },
        "gold_relation_map": {
            "user.robert.roman_empire.roman_emperor.title": "user , robert , roman empire , roman emperor , title"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-351",
        "question": "who is chelsea kane",
        "comp_type": null,
        "answer": [
            "m.02h6p92",
            "m.02hrh1q",
            "m.09l65",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vydtw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vydtw ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02vydtw)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Chelsea Kane ] )",
        "gold_entity_map": {
            "m.02vydtw": "Chelsea Kane"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-352",
        "question": "who is darwin and what is his theory",
        "comp_type": null,
        "answer": [
            "m.02h99sv",
            "m.036n1",
            "m.06q2q",
            "m.07lqg0",
            "m.0cbd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwx ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01lwx)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Charles Darwin ] )",
        "gold_entity_map": {
            "m.01lwx": "Charles Darwin"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-353",
        "question": "what did obama study in school",
        "comp_type": null,
        "answer": [
            "m.062z7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.major_field_of_study) (JOIN (R people.person.education) m.02mjmr))",
        "normed_sexpr": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Barack Obama ] ) )",
        "gold_entity_map": {
            "m.02mjmr": "Barack Obama"
        },
        "gold_relation_map": {
            "people.person.education": "people , person , education",
            "education.education.major_field_of_study": "education , education , major field of study"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-356",
        "question": "what continent is south africa part of",
        "comp_type": null,
        "answer": [
            "m.0dg3n1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0hzlz)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ South Africa ] )",
        "gold_entity_map": {
            "m.0hzlz": "South Africa"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-361",
        "question": "what company did henry ford work for",
        "comp_type": null,
        "answer": [
            "m.01p00g",
            "m.02zs4",
            "m.04hys37",
            "m.04hys3r",
            "m.069q9b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gxm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gxm ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n",
        "sexpr": "(JOIN (R business.employment_tenure.company) (JOIN (R people.person.employment_history) m.03gxm))",
        "normed_sexpr": "( JOIN ( R [ business , employment tenure , company ] ) ( JOIN ( R [ people , person , employment history ] ) [ Henry Ford ] ) )",
        "gold_entity_map": {
            "m.03gxm": "Henry Ford"
        },
        "gold_relation_map": {
            "business.employment_tenure.company": "business , employment tenure , company",
            "people.person.employment_history": "people , person , employment history"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-363",
        "question": "where indian ocean is located",
        "comp_type": null,
        "answer": [
            "m.0dkh39"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rz4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rz4 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.03rz4)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Indian Ocean ] )",
        "gold_entity_map": {
            "m.03rz4": "Indian Ocean"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-366",
        "question": "who was mary 's mother",
        "comp_type": null,
        "answer": [
            "m.0121n2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04n7gc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04n7gc6 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.parents) m.04n7gc6))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Mary ] ) )",
        "gold_entity_map": {
            "m.02zsn": "Female",
            "m.04n7gc6": "Mary"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-370",
        "question": "where is the howard university located",
        "comp_type": null,
        "answer": [
            "m.09c7w0",
            "m.0rh6k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0217m9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0217m9 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0217m9)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Howard University ] )",
        "gold_entity_map": {
            "m.0217m9": "Howard University"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-372",
        "question": "what do catholics call their god",
        "comp_type": null,
        "answer": [
            "m.03qsc",
            "m.045m1_",
            "m.077_fbm",
            "m.0d05l6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.deities ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.deities) m.0c8wxp)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , deities ] ) [ Catholicism ] )",
        "gold_entity_map": {
            "m.0c8wxp": "Catholicism"
        },
        "gold_relation_map": {
            "religion.religion.deities": "religion , religion , deities"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-373",
        "question": "what is the capital of alaska state",
        "comp_type": null,
        "answer": [
            "m.0l_q9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hjy ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.capital) m.0hjy)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Alaska ] )",
        "gold_entity_map": {
            "m.0hjy": "Alaska"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.capital": "base , aareas , schema , administrative area , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-376",
        "question": "who speaks farsi",
        "comp_type": null,
        "answer": [
            "m.0161c",
            "m.02z62v1",
            "m.03shp",
            "m.05l8y",
            "m.07dvs",
            "m.07t_x",
            "m.0d05q4",
            "m.0d060g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.countries_spoken_in) m.032f6)",
        "normed_sexpr": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Persian Language ] )",
        "gold_entity_map": {
            "m.032f6": "Persian Language"
        },
        "gold_relation_map": {
            "language.human_language.countries_spoken_in": "language , human language , countries spoken in"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-377",
        "question": "who was neptune discovered by",
        "comp_type": null,
        "answer": [
            "m.017xvy",
            "m.017xwf",
            "m.01d9_n",
            "m.02bw8x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c31h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c31h ns:astronomy.astronomical_discovery.discoverer ?x .\n}\n",
        "sexpr": "(JOIN (R astronomy.astronomical_discovery.discoverer) m.0c31h)",
        "normed_sexpr": "( JOIN ( R [ astronomy , astronomical discovery , discoverer ] ) [ Neptune ] )",
        "gold_entity_map": {
            "m.0c31h": "Neptune"
        },
        "gold_relation_map": {
            "astronomy.astronomical_discovery.discoverer": "astronomy , astronomical discovery , discoverer"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-379",
        "question": "what did corey haim really die of",
        "comp_type": null,
        "answer": [
            "m.01tf_6",
            "m.0dq9p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kyn0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kyn0 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01kyn0)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Corey Haim ] )",
        "gold_entity_map": {
            "m.01kyn0": "Corey Haim"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-380",
        "question": "where did pavlova originate",
        "comp_type": null,
        "answer": [
            "m.04bf68"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hp3n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hp3n ns:food.dish.cuisine ?x .\n}\n",
        "sexpr": "(JOIN (R food.dish.cuisine) m.0hp3n)",
        "normed_sexpr": "( JOIN ( R [ food , dish , cuisine ] ) [ Pavlova ] )",
        "gold_entity_map": {
            "m.0hp3n": "Pavlova"
        },
        "gold_relation_map": {
            "food.dish.cuisine": "food , dish , cuisine"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-381",
        "question": "where did nathaniel hawthorne die",
        "comp_type": null,
        "answer": [
            "m.01m96h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gpy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gpy ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.05gpy)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Nathaniel Hawthorne ] )",
        "gold_entity_map": {
            "m.05gpy": "Nathaniel Hawthorne"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-385",
        "question": "what are buddhist gods",
        "comp_type": null,
        "answer": [
            "m.018q6f",
            "m.02lxg9",
            "m.03vh65",
            "m.04fckk",
            "m.0czf7z",
            "m.0dd2j3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.092bf5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.092bf5 ns:religion.religion.deities ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.deities) m.092bf5)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , deities ] ) [ Buddhism ] )",
        "gold_entity_map": {
            "m.092bf5": "Buddhism"
        },
        "gold_relation_map": {
            "religion.religion.deities": "religion , religion , deities"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-386",
        "question": "who influenced wolfgang amadeus mozart",
        "comp_type": null,
        "answer": [
            "m.014t6l",
            "m.03_f0",
            "m.03bxh",
            "m.043d4",
            "m.0fyv0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082db)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082db ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.082db)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Wolfgang Amadeus Mozart ] )",
        "gold_entity_map": {
            "m.082db": "Wolfgang Amadeus Mozart"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-389",
        "question": "when was blessed kateri born",
        "comp_type": null,
        "answer": [
            "1656"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zql6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zql6 ns:people.person.date_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.date_of_birth) m.01zql6)",
        "normed_sexpr": "( JOIN ( R [ people , person , date of birth ] ) [ Kateri Tekakwitha ] )",
        "gold_entity_map": {
            "m.01zql6": "Kateri Tekakwitha"
        },
        "gold_relation_map": {
            "people.person.date_of_birth": "people , person , date of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-390",
        "question": "when did the bali bombings occur",
        "comp_type": null,
        "answer": [
            "2002-10-12"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0q06c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0q06c ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.0q06c)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ 2002 Bali bombings ] )",
        "gold_entity_map": {
            "m.0q06c": "2002 Bali bombings"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    }
]