[
    {
        "ID": "WebQTrn-607",
        "question": "what does albania speak",
        "comp_type": null,
        "answer": [
            "m.012psb",
            "m.012v8",
            "m.01vy26",
            "m.0349s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdx ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0jdx)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Albania ] )",
        "gold_entity_map": {
            "m.0jdx": "Albania"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-608",
        "question": "what is shakira 's nationality",
        "comp_type": null,
        "answer": [
            "m.01ls2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wj18h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wj18h ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.01wj18h)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Shakira ] )",
        "gold_entity_map": {
            "m.01wj18h": "Shakira"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-610",
        "question": "who is playing bilbo baggins",
        "comp_type": null,
        "answer": [
            "m.016zp5",
            "m.02fz3w",
            "m.0f_wwf",
            "m.0n290f8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g6z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g6z1 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0g6z1))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Old Bilbo ] ) )",
        "gold_entity_map": {
            "m.0g6z1": "Old Bilbo"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-612",
        "question": "where is the 2012 ncaa basketball tournament",
        "comp_type": null,
        "answer": [
            "m.01mq08",
            "m.01n31w",
            "m.02b99h",
            "m.02hqj2",
            "m.02p_rvk",
            "m.02y3xn",
            "m.02z6zt",
            "m.0328cp",
            "m.038bv6",
            "m.039nbl",
            "m.0635xb",
            "m.0635y4",
            "m.063ypc",
            "m.0f0fv9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080nmfs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.080nmfs ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.080nmfs)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ 2012 NCAA Men's Division I Basketball Tournament ] )",
        "gold_entity_map": {
            "m.080nmfs": "2012 NCAA Men's Division I Basketball Tournament"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-615",
        "question": "what did farrah dad do",
        "comp_type": null,
        "answer": [],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.01j851 ns:people.person.parents ?y . # Farrah Fawcett\n  ?y ns:people.person.gender ns:m.05zppz . # Male\n  ?y ns:people.person.profession ?x .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01j851": "Farrah Fawcett",
            "m.05zppz": "Male"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession",
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-616",
        "question": "where did matt barnes play",
        "comp_type": null,
        "answer": [
            "m.0jmjr",
            "m.0jmk7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07dr3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07dr3v ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.07dr3v))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Matt Barnes ] ) )",
        "gold_entity_map": {
            "m.07dr3v": "Matt Barnes"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-617",
        "question": "where does the jordan river begin",
        "comp_type": null,
        "answer": [
            "m.01txc9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvy5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvy5 ns:geography.river.origin ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.origin) m.0cvy5)",
        "normed_sexpr": "( JOIN ( R [ geography , river , origin ] ) [ Jordan River ] )",
        "gold_entity_map": {
            "m.0cvy5": "Jordan River"
        },
        "gold_relation_map": {
            "geography.river.origin": "geography , river , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-619",
        "question": "where did rihanna come from",
        "comp_type": null,
        "answer": [
            "m.0162v",
            "m.02p5kp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:music.artist.origin ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.origin) m.06mt91)",
        "normed_sexpr": "( JOIN ( R [ music , artist , origin ] ) [ Rihanna ] )",
        "gold_entity_map": {
            "m.06mt91": "Rihanna"
        },
        "gold_relation_map": {
            "music.artist.origin": "music , artist , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-620",
        "question": "who does kurt busch drive for now",
        "comp_type": null,
        "answer": [
            "m.073mq9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02llzy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02llzy ns:base.nascar.nascar_driver.team ?x .\n}\n",
        "sexpr": "(JOIN (R base.nascar.nascar_driver.team) m.02llzy)",
        "normed_sexpr": "( JOIN ( R [ base , nascar , nascar driver , team ] ) [ Kurt Busch ] )",
        "gold_entity_map": {
            "m.02llzy": "Kurt Busch"
        },
        "gold_relation_map": {
            "base.nascar.nascar_driver.team": "base , nascar , nascar driver , team"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-622",
        "question": "what is the time zone in uk now",
        "comp_type": null,
        "answer": [
            "m.03bdv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ssc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ssc ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.07ssc)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ United Kingdom ] )",
        "gold_entity_map": {
            "m.07ssc": "United Kingdom"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-625",
        "question": "where are google headquarters located",
        "comp_type": null,
        "answer": [
            "m.01zjkmr",
            "m.0l2xl",
            "m.0r6c4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bby1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bby1 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.03bby1)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Googleplex ] )",
        "gold_entity_map": {
            "m.03bby1": "Googleplex"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-627",
        "question": "what was richard wright known for",
        "comp_type": null,
        "answer": [
            "m.01xryvt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv6k ns:common.topic.notable_types ?x .\n}\n",
        "sexpr": "(JOIN (R common.topic.notable_types) m.0bv6k)",
        "normed_sexpr": "( JOIN ( R [ common , topic , notable types ] ) [ Richard Wright ] )",
        "gold_entity_map": {
            "m.0bv6k": "Richard Wright"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-628",
        "question": "where is the nascar hall of fame",
        "comp_type": null,
        "answer": [
            "m.05fkf",
            "m.0fsb8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0635_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0635_7 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0635_7)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ NASCAR Hall of Fame ] )",
        "gold_entity_map": {
            "m.0635_7": "NASCAR Hall of Fame"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-630",
        "question": "what was the name of wright brothers plane",
        "comp_type": null,
        "answer": [
            "g.1hb_g613l",
            "m.025tb9v",
            "m.02x015_",
            "m.02x01s7",
            "m.0416n2",
            "m.0bt3mt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fzv_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fzv_ ns:aviation.aircraft_manufacturer.aircraft_models_made ?x .\n}\n",
        "sexpr": "(JOIN (R aviation.aircraft_manufacturer.aircraft_models_made) m.0fzv_)",
        "normed_sexpr": "( JOIN ( R [ aviation , aircraft manufacturer , aircraft models made ] ) [ Wright brothers ] )",
        "gold_entity_map": {
            "m.0fzv_": "Wright brothers"
        },
        "gold_relation_map": {
            "aviation.aircraft_manufacturer.aircraft_models_made": "aviation , aircraft manufacturer , aircraft models made"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-631",
        "question": "where is located university of leeds",
        "comp_type": null,
        "answer": [
            "m.04p3c",
            "m.07ssc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bzs9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bzs9 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01bzs9)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ University of Leeds ] )",
        "gold_entity_map": {
            "m.01bzs9": "University of Leeds"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-632",
        "question": "who is gilbert gottfried snl",
        "comp_type": null,
        "answer": [
            "m.018gz8",
            "m.02hrh1q",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02y0yt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02y0yt ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02y0yt)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Gilbert Gottfried ] )",
        "gold_entity_map": {
            "m.02y0yt": "Gilbert Gottfried"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-633",
        "question": "what language do they denmark",
        "comp_type": null,
        "answer": [
            "m.02_8gp",
            "m.0295r",
            "m.02hrcqd",
            "m.04306rv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6nt ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0k6nt)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Denmark ] )",
        "gold_entity_map": {
            "m.0k6nt": "Denmark"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-634",
        "question": "what did martin luther do",
        "comp_type": null,
        "answer": [
            "m.016fly",
            "m.0266rh",
            "m.02kvl3l",
            "m.05t4q",
            "m.05xjb",
            "m.0cbd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yd_ ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.04yd_)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Martin Luther ] )",
        "gold_entity_map": {
            "m.04yd_": "Martin Luther"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-635",
        "question": "what team did grover cleveland alexander play for",
        "comp_type": null,
        "answer": [
            "m.01yjl",
            "m.05xvj",
            "m.06x68"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zt27)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zt27 ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.team ?x .\n}\n",
        "sexpr": "(JOIN (R baseball.batting_statistics.team) (JOIN (R baseball.baseball_player.batting_stats) m.01zt27))",
        "normed_sexpr": "( JOIN ( R [ baseball , batting statistics , team ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Grover Cleveland Alexander ] ) )",
        "gold_entity_map": {
            "m.01zt27": "Grover Cleveland Alexander"
        },
        "gold_relation_map": {
            "baseball.batting_statistics.team": "baseball , batting statistics , team",
            "baseball.baseball_player.batting_stats": "baseball , baseball player , batting stats"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-636",
        "question": "what was eli whitney nationality",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.02ncr)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Eli Whitney ] )",
        "gold_entity_map": {
            "m.02ncr": "Eli Whitney"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-637",
        "question": "what was christiaan barnard famous for",
        "comp_type": null,
        "answer": [
            "m.02y_93f",
            "m.05t4q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02092)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02092 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02092)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Christiaan Barnard ] )",
        "gold_entity_map": {
            "m.02092": "Christiaan Barnard"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-638",
        "question": "where was dwight d. eisenhower from",
        "comp_type": null,
        "answer": [
            "m.0101wz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.028rk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.028rk ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.028rk)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Dwight D. Eisenhower ] )",
        "gold_entity_map": {
            "m.028rk": "Dwight D. Eisenhower"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-639",
        "question": "where do audi come from",
        "comp_type": null,
        "answer": [
            "m.01dky4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k50)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k50 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.0k50))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Audi ] ) )",
        "gold_entity_map": {
            "m.0k50": "Audi"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-641",
        "question": "what to do washington dc december",
        "comp_type": null,
        "answer": [
            "m.01_0bd",
            "m.016dff",
            "m.016fkr",
            "m.01gbmc",
            "m.01lw24",
            "m.022j06",
            "m.024g7s",
            "m.0266ss",
            "m.0270__",
            "m.027128",
            "m.02734s3",
            "m.02czw2",
            "m.02mv9q",
            "m.02n5d1",
            "m.02p98v",
            "m.02ppyjj",
            "m.02qghxw",
            "m.02qksvk",
            "m.033xgm",
            "m.033xmz",
            "m.033xp2",
            "m.03q_0d",
            "m.03qg30",
            "m.03w66bm",
            "m.03w726n",
            "m.03yw5h",
            "m.041tsw",
            "m.043l1hs",
            "m.0442r8",
            "m.044dqy_",
            "m.04ct6r7",
            "m.04gmyv",
            "m.04lgc0d",
            "m.04lvcf",
            "m.04qnr0",
            "m.05229b8",
            "m.059hxr2",
            "m.05zc1k",
            "m.06_09g5",
            "m.065x19g",
            "m.06zqhxm",
            "m.073l4k",
            "m.07dr_h",
            "m.07f92f",
            "m.07vth",
            "m.081sq",
            "m.09p_2j",
            "m.0b60fy",
            "m.0bbss1",
            "m.0by04",
            "m.0c56z2",
            "m.0d3548",
            "m.0d357s",
            "m.0dgsl8",
            "m.0drzq",
            "m.0ff71l",
            "m.0gfbmq",
            "m.0hztgf5",
            "m.0j2kpvl",
            "m.0k3ctcz",
            "m.0k3n0tk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rh6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rh6k ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0rh6k)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Washington, D.C. ] )",
        "gold_entity_map": {
            "m.0rh6k": "Washington, D.C."
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-642",
        "question": "what language is spoken in singapore",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.0653m",
            "m.07c9s",
            "m.0y1mh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.06t2t)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Singapore ] )",
        "gold_entity_map": {
            "m.06t2t": "Singapore"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-644",
        "question": "what do singapore speak",
        "comp_type": null,
        "answer": [
            "m.01r2l",
            "m.02h40lc",
            "m.07c9s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t2t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t2t ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.06t2t)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Singapore ] )",
        "gold_entity_map": {
            "m.06t2t": "Singapore"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-646",
        "question": "who wrote the book of st. john",
        "comp_type": null,
        "answer": [
            "m.06ft_k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dmz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dmz ns:book.written_work.author ?x .\n}\n",
        "sexpr": "(JOIN (R book.written_work.author) m.01dmz)",
        "normed_sexpr": "( JOIN ( R [ book , written work , author ] ) [ Book of Revelation ] )",
        "gold_entity_map": {
            "m.01dmz": "Book of Revelation"
        },
        "gold_relation_map": {
            "book.written_work.author": "book , written work , author"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-647",
        "question": "who is kobe bryant dad",
        "comp_type": null,
        "answer": [
            "m.024trx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.01kmd4))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Kobe Bryant ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.01kmd4": "Kobe Bryant"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-648",
        "question": "what continent does israel belong to",
        "comp_type": null,
        "answer": [
            "m.0j0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.03spz)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Israel ] )",
        "gold_entity_map": {
            "m.03spz": "Israel"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-649",
        "question": "what is the capital city of albania",
        "comp_type": null,
        "answer": [
            "m.07m_f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdx ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.0jdx)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Albania ] )",
        "gold_entity_map": {
            "m.0jdx": "Albania"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-651",
        "question": "what is wentworth miller in",
        "comp_type": null,
        "answer": [
            "m.03hhtns",
            "m.06dfz1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06p426)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06p426 ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.06p426))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Wentworth Miller ] ) )",
        "gold_entity_map": {
            "m.06p426": "Wentworth Miller"
        },
        "gold_relation_map": {
            "tv.tv_actor.starring_roles": "tv , tv actor , starring roles",
            "tv.regular_tv_appearance.series": "tv , regular tv appearance , series"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-653",
        "question": "who killed harvey milk",
        "comp_type": null,
        "answer": [
            "m.02dzj8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01brc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01brc5 ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n",
        "sexpr": "(JOIN (R user.alexander.misc.murdered_person.murdered_by) m.01brc5)",
        "normed_sexpr": "( JOIN ( R [ user , alexander , misc , murdered person , murdered by ] ) [ Harvey Milk ] )",
        "gold_entity_map": {
            "m.01brc5": "Harvey Milk"
        },
        "gold_relation_map": {
            "user.alexander.misc.murdered_person.murdered_by": "user , alexander , misc , murdered person , murdered by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-655",
        "question": "who owns nissan car manufacturer",
        "comp_type": null,
        "answer": [
            "m.04nzf7",
            "m.0vpy5vb",
            "m.0wrj2c_",
            "m.0wrj2lb",
            "m.0wrj2mj",
            "m.0wrj2n7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b4c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b4c ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.05b4c)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Nissan Motor Co., Ltd. ] )",
        "gold_entity_map": {
            "m.05b4c": "Nissan Motor Co., Ltd."
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    }
]