[
    {
        "ID": "WebQTrn-895",
        "question": "what did george steinbrenner do",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.025sppp",
            "m.05sxg2",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q5t3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q5t3 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01q5t3)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ George Steinbrenner ] )",
        "gold_entity_map": {
            "m.01q5t3": "George Steinbrenner"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-898",
        "question": "where did pablo picasso die",
        "comp_type": null,
        "answer": [
            "m.0cy97d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060_7 ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.060_7)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Pablo Picasso ] )",
        "gold_entity_map": {
            "m.060_7": "Pablo Picasso"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-903",
        "question": "what do they speak in cambodia",
        "comp_type": null,
        "answer": [
            "m.01lqm",
            "m.04pp56",
            "m.064_8sq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xbgx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xbgx ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.01xbgx)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Cambodia ] )",
        "gold_entity_map": {
            "m.01xbgx": "Cambodia"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-904",
        "question": "what kind of insurance does geico offer",
        "comp_type": null,
        "answer": [
            "m.03qbn81",
            "m.03qth54"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02r95v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02r95v ns:business.business_operation.industry ?x .\n}\n",
        "sexpr": "(JOIN (R business.business_operation.industry) m.02r95v)",
        "normed_sexpr": "( JOIN ( R [ business , business operation , industry ] ) [ GEICO ] )",
        "gold_entity_map": {
            "m.02r95v": "GEICO"
        },
        "gold_relation_map": {
            "business.business_operation.industry": "business , business operation , industry"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-906",
        "question": "what time is nebraska now",
        "comp_type": null,
        "answer": [
            "m.02fqwt",
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fhy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fhy ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.05fhy)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Nebraska ] )",
        "gold_entity_map": {
            "m.05fhy": "Nebraska"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-907",
        "question": "what did nick carter sister died of",
        "comp_type": null,
        "answer": [
            "m.01tf_6"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.04wj2h ns:people.person.sibling_s ?y1 .\n  ?y1 ns:people.sibling_relationship.sibling ?y2 .\n  ?y2 ns:people.person.gender ns:m.02zsn .\n  ?y2 ns:people.deceased_person.cause_of_death ?x .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.04wj2h": "Nick Carter",
            "m.02zsn": "Female"
        },
        "gold_relation_map": {
            "people.sibling_relationship.sibling": "people , sibling relationship , sibling",
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death",
            "people.person.sibling_s": "people , person , sibling s",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-908",
        "question": "who is james dean",
        "comp_type": null,
        "answer": [
            "m.02hrh1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w32s8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w32s8 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01w32s8)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ James Dean ] )",
        "gold_entity_map": {
            "m.01w32s8": "James Dean"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-909",
        "question": "where did bob dylan live",
        "comp_type": null,
        "answer": [
            "m.02_286",
            "m.0fpzwf",
            "m.0h1k6",
            "m.0r0m6",
            "m.0wjjx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vrncs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vrncs ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.01vrncs))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Bob Dylan ] ) )",
        "gold_entity_map": {
            "m.01vrncs": "Bob Dylan"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-914",
        "question": "what is there to see in barcelona",
        "comp_type": null,
        "answer": [
            "m.01ggjl",
            "m.02rm8r0",
            "m.03q84k",
            "m.03q89c",
            "m.0422md",
            "m.04cwdhr",
            "m.05f62w4",
            "m.09lb0y",
            "m.0bdrf9",
            "m.0bjy6x",
            "m.0bwhyzp",
            "m.0bwl_hx",
            "m.0cgk4g",
            "m.0g6n3",
            "m.0g7wh",
            "m.0j9nnpr",
            "m.0kc62",
            "m.0kc7c",
            "m.0nvs",
            "m.0nw8",
            "m.0qlm2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f62 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.01f62)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Barcelona ] )",
        "gold_entity_map": {
            "m.01f62": "Barcelona"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-915",
        "question": "who is larry ellison oracle",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.025sppp",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01762z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01762z ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01762z)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Larry Ellison ] )",
        "gold_entity_map": {
            "m.01762z": "Larry Ellison"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-916",
        "question": "what is the zip code for fort stockton texas",
        "comp_type": null,
        "answer": [
            "m.0211sw9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0107qn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0107qn ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0107qn)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Fort Stockton ] )",
        "gold_entity_map": {
            "m.0107qn": "Fort Stockton"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-920",
        "question": "what did egyptians speak",
        "comp_type": null,
        "answer": [
            "m.012zfy",
            "m.025rvv7",
            "m.02hx2cr",
            "m.02hxbhg",
            "m.035t_3",
            "m.03wc2kf",
            "m.051bnt",
            "m.0c4chg",
            "m.0jzc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02k54)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02k54 ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.02k54)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Egypt ] )",
        "gold_entity_map": {
            "m.02k54": "Egypt"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-921",
        "question": "what is vanderbilt 's mascot",
        "comp_type": null,
        "answer": [
            "m.05k6hxh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pq4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pq4w ns:education.educational_institution.mascot ?x .\n}\n",
        "sexpr": "(JOIN (R education.educational_institution.mascot) m.01pq4w)",
        "normed_sexpr": "( JOIN ( R [ education , educational institution , mascot ] ) [ Vanderbilt University ] )",
        "gold_entity_map": {
            "m.01pq4w": "Vanderbilt University"
        },
        "gold_relation_map": {
            "education.educational_institution.mascot": "education , educational institution , mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-925",
        "question": "what are the airports in chicago",
        "comp_type": null,
        "answer": [
            "m.01ky66",
            "m.01l1jx",
            "m.026qfyq",
            "m.027hrnx",
            "m.0288msl",
            "m.02z431v",
            "m.04rjc8",
            "m.08qt9p",
            "m.0d4v7r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.01_d4)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Chicago ] )",
        "gold_entity_map": {
            "m.01_d4": "Chicago"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-926",
        "question": "what was van gogh famous for",
        "comp_type": null,
        "answer": [
            "m.02nxqmh",
            "m.03hz6vv",
            "m.0n1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m2 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.07_m2)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Vincent van Gogh ] )",
        "gold_entity_map": {
            "m.07_m2": "Vincent van Gogh"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-927",
        "question": "where did jane goodall go to school",
        "comp_type": null,
        "answer": [
            "m.02hmw9",
            "m.02hqqm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cbqk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cbqk ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0cbqk))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jane Goodall ] ) )",
        "gold_entity_map": {
            "m.0cbqk": "Jane Goodall"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-928",
        "question": "who won 2012 presidential election in france",
        "comp_type": null,
        "answer": [
            "m.02qg4z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05_5pmw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05_5pmw ns:government.election.winner ?x .\n}\n",
        "sexpr": "(JOIN (R government.election.winner) m.05_5pmw)",
        "normed_sexpr": "( JOIN ( R [ government , election , winner ] ) [ French presidential election, 2012 ] )",
        "gold_entity_map": {
            "m.05_5pmw": "French presidential election, 2012"
        },
        "gold_relation_map": {
            "government.election.winner": "government , election , winner"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-931",
        "question": "where did emily murphy go to school",
        "comp_type": null,
        "answer": [
            "m.05n93p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033_v2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033_v2 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.033_v2))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Emily Murphy ] ) )",
        "gold_entity_map": {
            "m.033_v2": "Emily Murphy"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-936",
        "question": "where president nixon was born",
        "comp_type": null,
        "answer": [
            "m.0r2rk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c97)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c97 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.06c97)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Richard Nixon ] )",
        "gold_entity_map": {
            "m.06c97": "Richard Nixon"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-938",
        "question": "what else did eli whitney invent",
        "comp_type": null,
        "answer": [
            "m.01ng1x",
            "m.03ny5l",
            "m.0ctvd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02ncr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02ncr ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.02ncr)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ Eli Whitney ] )",
        "gold_entity_map": {
            "m.02ncr": "Eli Whitney"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-939",
        "question": "who founded collegehumor",
        "comp_type": null,
        "answer": [
            "m.03bvkch",
            "m.04n5ycy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05_s3l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05_s3l ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.05_s3l)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ CollegeHumor ] )",
        "gold_entity_map": {
            "m.05_s3l": "CollegeHumor"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-943",
        "question": "what are the names of michael jackson movies",
        "comp_type": null,
        "answer": [
            "m.0_cdzjp",
            "m.027fwmt",
            "m.02qsfv",
            "m.031t2d",
            "m.036ytw",
            "m.05f5tq",
            "m.065mvrb",
            "m.07hqvg",
            "m.0djb05y",
            "m.0v435l3",
            "m.0v43grn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.09889g))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Michael Jackson ] ) )",
        "gold_entity_map": {
            "m.09889g": "Michael Jackson"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-945",
        "question": "what timezone is illinois on",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03v0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03v0t ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.03v0t)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Illinois ] )",
        "gold_entity_map": {
            "m.03v0t": "Illinois"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-949",
        "question": "where was martin cooper from",
        "comp_type": null,
        "answer": [
            "m.01_d4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bt6kc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bt6kc ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0bt6kc)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Martin Cooper ] )",
        "gold_entity_map": {
            "m.0bt6kc": "Martin Cooper"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-950",
        "question": "where is spain exactly located",
        "comp_type": null,
        "answer": [
            "m.02j9z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mkj ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.06mkj)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Spain ] )",
        "gold_entity_map": {
            "m.06mkj": "Spain"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-954",
        "question": "what medium is the school of athens",
        "comp_type": null,
        "answer": [
            "m.02_3k",
            "m.05qdh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025sm_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025sm_7 ns:visual_art.artwork.art_form ?x .\n}\n",
        "sexpr": "(JOIN (R visual_art.artwork.art_form) m.025sm_7)",
        "normed_sexpr": "( JOIN ( R [ visual art , artwork , art form ] ) [ The School of Athens ] )",
        "gold_entity_map": {
            "m.025sm_7": "The School of Athens"
        },
        "gold_relation_map": {
            "visual_art.artwork.art_form": "visual art , artwork , art form"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-956",
        "question": "what year did florida marlins win the world series",
        "comp_type": null,
        "answer": [
            "m.01z534"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02__x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02__x ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.02__x)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Miami Marlins ] )",
        "gold_entity_map": {
            "m.02__x": "Miami Marlins"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-960",
        "question": "where north dakota located",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fky)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fky ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_parent) m.05fky)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ North Dakota ] )",
        "gold_entity_map": {
            "m.05fky": "North Dakota"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_parent": "base , aareas , schema , administrative area , administrative parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-963",
        "question": "where was the battle of vicksburg held",
        "comp_type": null,
        "answer": [
            "m.04tgp",
            "m.0nfv_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hf7f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hf7f ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.01hf7f)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Siege of Vicksburg ] )",
        "gold_entity_map": {
            "m.01hf7f": "Siege of Vicksburg"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-969",
        "question": "who is the head coach of the tennessee titans",
        "comp_type": null,
        "answer": [
            "m.0b9srp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07l2m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07l2m ns:american_football.football_team.current_head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.current_head_coach) m.07l2m)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , current head coach ] ) [ Tennessee Titans ] )",
        "gold_entity_map": {
            "m.07l2m": "Tennessee Titans"
        },
        "gold_relation_map": {
            "american_football.football_team.current_head_coach": "american football , football team , current head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-970",
        "question": "what type of government does fiji have",
        "comp_type": null,
        "answer": [
            "m.012qkq",
            "m.025s5c_",
            "m.0glnsx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wt0 ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.02wt0)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Fiji ] )",
        "gold_entity_map": {
            "m.02wt0": "Fiji"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-973",
        "question": "who was dan cody",
        "comp_type": null,
        "answer": [
            "m.02h665k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07m5fb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07m5fb ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.07m5fb)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Dan Cody ] )",
        "gold_entity_map": {
            "m.07m5fb": "Dan Cody"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-976",
        "question": "what was wrong with joan crawford",
        "comp_type": null,
        "answer": [
            "m.026k8yn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgbf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgbf ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.0cgbf)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Joan Crawford ] )",
        "gold_entity_map": {
            "m.0cgbf": "Joan Crawford"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-978",
        "question": "what country was anton van leeuwenhoek from",
        "comp_type": null,
        "answer": [
            "m.049nq",
            "m.059j2"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.0bj_v ns:people.person.place_of_birth ?y . # Antonie van Leeuwenhoek\n  ?y ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.01mp . # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.0bj_v": "Antonie van Leeuwenhoek"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    }
]