[
    {
        "ID": "WebQTrn-3015",
        "question": "what party did john tyler belong to",
        "comp_type": null,
        "answer": [
            "m.07wdw",
            "m.0d075m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042dk ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.042dk))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ John Tyler ] ) )",
        "gold_entity_map": {
            "m.042dk": "John Tyler"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3023",
        "question": "what money is used in mozambique",
        "comp_type": null,
        "answer": [
            "m.05yxqw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wlh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wlh ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.04wlh)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Mozambique ] )",
        "gold_entity_map": {
            "m.04wlh": "Mozambique"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3028",
        "question": "what are the official languages of the dominican republic",
        "comp_type": null,
        "answer": [
            "m.06nm1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.027rn)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Dominican Republic ] )",
        "gold_entity_map": {
            "m.027rn": "Dominican Republic"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3031",
        "question": "where was ted kennedy buried",
        "comp_type": null,
        "answer": [
            "m.0lbp_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0194xc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0194xc ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.0194xc)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Ted Kennedy ] )",
        "gold_entity_map": {
            "m.0194xc": "Ted Kennedy"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3038",
        "question": "where was benjamin franklin raised",
        "comp_type": null,
        "answer": [
            "m.01cx_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.019fz)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Benjamin Franklin ] )",
        "gold_entity_map": {
            "m.019fz": "Benjamin Franklin"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3040",
        "question": "where do people speak burmese",
        "comp_type": null,
        "answer": [
            "m.04xn_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xrrm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xrrm ns:language.human_language.main_country ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.main_country) m.01xrrm)",
        "normed_sexpr": "( JOIN ( R [ language , human language , main country ] ) [ Burmese Language ] )",
        "gold_entity_map": {
            "m.01xrrm": "Burmese Language"
        },
        "gold_relation_map": {
            "language.human_language.main_country": "language , human language , main country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3042",
        "question": "what is phoebe halliwell 's real name",
        "comp_type": null,
        "answer": [
            "m.01pw2f1",
            "m.0c90y7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ymly)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ymly ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.tv_guest_role.actor) (JOIN (R tv.tv_character.appeared_in_tv_episodes) m.01ymly))",
        "normed_sexpr": "( JOIN ( R [ tv , tv guest role , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv episodes ] ) [ Phoebe Halliwell ] ) )",
        "gold_entity_map": {
            "m.01ymly": "Phoebe Halliwell"
        },
        "gold_relation_map": {
            "tv.tv_character.appeared_in_tv_episodes": "tv , tv character , appeared in tv episodes",
            "tv.tv_guest_role.actor": "tv , tv guest role , actor"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3044",
        "question": "what is afghanistan money called",
        "comp_type": null,
        "answer": [
            "m.019vxc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdd ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0jdd)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Afghanistan ] )",
        "gold_entity_map": {
            "m.0jdd": "Afghanistan"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3049",
        "question": "what is atlanta ga famous for",
        "comp_type": null,
        "answer": [
            "m.0jhn7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013yq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013yq ns:olympics.olympic_host_city.olympics_hosted ?x .\n}\n",
        "sexpr": "(JOIN (R olympics.olympic_host_city.olympics_hosted) m.013yq)",
        "normed_sexpr": "( JOIN ( R [ olympics , olympic host city , olympics hosted ] ) [ Atlanta ] )",
        "gold_entity_map": {
            "m.013yq": "Atlanta"
        },
        "gold_relation_map": {
            "olympics.olympic_host_city.olympics_hosted": "olympics , olympic host city , olympics hosted"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3051",
        "question": "where is the pepsi center",
        "comp_type": null,
        "answer": [
            "m.02cl1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wd_7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wd_7 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01wd_7)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Pepsi Center ] )",
        "gold_entity_map": {
            "m.01wd_7": "Pepsi Center"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3052",
        "question": "who plays hermione granger",
        "comp_type": null,
        "answer": [
            "m.0134w7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8kc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8kc ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0c8kc))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Hermione Granger ] ) )",
        "gold_entity_map": {
            "m.0c8kc": "Hermione Granger"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3053",
        "question": "what inspired m.c. escher to become an artist",
        "comp_type": null,
        "answer": [
            "m.015g76"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051mn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051mn ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.051mn)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ M. C. Escher ] )",
        "gold_entity_map": {
            "m.051mn": "M. C. Escher"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3056",
        "question": "what county is denver colorado in",
        "comp_type": null,
        "answer": [],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cl1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cl1 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.02cl1)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Denver ] )",
        "gold_entity_map": {
            "m.02cl1": "Denver"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3060",
        "question": "where does the band metallica live",
        "comp_type": null,
        "answer": [
            "m.030qb3t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rcr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rcr ns:music.artist.origin ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.origin) m.04rcr)",
        "normed_sexpr": "( JOIN ( R [ music , artist , origin ] ) [ Metallica ] )",
        "gold_entity_map": {
            "m.04rcr": "Metallica"
        },
        "gold_relation_map": {
            "music.artist.origin": "music , artist , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3063",
        "question": "who plays jason gideon",
        "comp_type": null,
        "answer": [
            "m.033xr_",
            "m.04y8c2p",
            "m.05h41sp",
            "m.07qgql",
            "m.07qgr8",
            "m.0bbb_8y",
            "m.0br44q",
            "m.0crt01",
            "m.0crt3v",
            "m.0crt58",
            "m.0gxbnjs",
            "m.0t4z_zj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wmhq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wmhq ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.01wmhq))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Jason Voorhees ] ) )",
        "gold_entity_map": {
            "m.01wmhq": "Jason Voorhees"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3067",
        "question": "what was vasco nunez de balboa original purpose of his journey",
        "comp_type": null,
        "answer": [
            "m.040vc4s",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cl9qq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cl9qq ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0cl9qq)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Vasco Núñez de Balboa ] )",
        "gold_entity_map": {
            "m.0cl9qq": "Vasco Núñez de Balboa"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3071",
        "question": "what guitar did clapton play",
        "comp_type": null,
        "answer": [
            "m.01jyd4",
            "m.02m873"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qwg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qwg ns:music.guitarist.guitars_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.guitarist.guitars_played) m.02qwg)",
        "normed_sexpr": "( JOIN ( R [ music , guitarist , guitars played ] ) [ Eric Clapton ] )",
        "gold_entity_map": {
            "m.02qwg": "Eric Clapton"
        },
        "gold_relation_map": {
            "music.guitarist.guitars_played": "music , guitarist , guitars played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3072",
        "question": "who did joseph from the bible marry",
        "comp_type": null,
        "answer": [
            "m.02xvr8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0197d5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0197d5 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n}\n",
        "sexpr": "(JOIN (R people.marriage.spouse) (JOIN (R people.person.spouse_s) m.0197d5))",
        "normed_sexpr": "( JOIN ( R [ people , marriage , spouse ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Joseph in Islam ] ) )",
        "gold_entity_map": {
            "m.0197d5": "Joseph in Islam"
        },
        "gold_relation_map": {
            "people.person.spouse_s": "people , person , spouse s",
            "people.marriage.spouse": "people , marriage , spouse"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3073",
        "question": "what did sir john frederick william herschel do",
        "comp_type": null,
        "answer": [
            "m.01m_1t",
            "m.03ktb0",
            "m.03yvzv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bxzr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bxzr ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.0bxzr)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ John Herschel ] )",
        "gold_entity_map": {
            "m.0bxzr": "John Herschel"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3078",
        "question": "where did wassily kandinsky work",
        "comp_type": null,
        "answer": [
            "m.018cy",
            "m.01fy2s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0856z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0856z ns:people.person.employment_history ?y .\n?y ns:business.employment_tenure.company ?x .\n}\n",
        "sexpr": "(JOIN (R business.employment_tenure.company) (JOIN (R people.person.employment_history) m.0856z))",
        "normed_sexpr": "( JOIN ( R [ business , employment tenure , company ] ) ( JOIN ( R [ people , person , employment history ] ) [ Wassily Kandinsky ] ) )",
        "gold_entity_map": {
            "m.0856z": "Wassily Kandinsky"
        },
        "gold_relation_map": {
            "business.employment_tenure.company": "business , employment tenure , company",
            "people.person.employment_history": "people , person , employment history"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3080",
        "question": "when did the arab israeli war start",
        "comp_type": null,
        "answer": [
            "1948-05-15"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012d8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012d8 ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.012d8)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ Arab–Israeli conflict ] )",
        "gold_entity_map": {
            "m.012d8": "Arab–Israeli conflict"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3082",
        "question": "what all countries are in south america",
        "comp_type": null,
        "answer": [
            "m.015fr",
            "m.0165v",
            "m.016wzw",
            "m.01c995",
            "m.01ls2",
            "m.01nr2h",
            "m.02wmy",
            "m.034m8",
            "m.0417l2t",
            "m.05v10",
            "m.06nnj",
            "m.07twz",
            "m.07ylj",
            "m.0dkz7x",
            "m.0jgd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06n3y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06n3y ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.06n3y))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ South America ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.06n3y": "South America"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-3085",
        "question": "what ship did sir francis drake travel on",
        "comp_type": null,
        "answer": [
            "m.023rdn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.031t2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.031t2 ns:boats.ship_owner.ships_owned ?y .\n?y ns:boats.ship_ownership.ship ?x .\n}\n",
        "sexpr": "(JOIN (R boats.ship_ownership.ship) (JOIN (R boats.ship_owner.ships_owned) m.031t2))",
        "normed_sexpr": "( JOIN ( R [ boats , ship ownership , ship ] ) ( JOIN ( R [ boats , ship owner , ships owned ] ) [ Francis Drake ] ) )",
        "gold_entity_map": {
            "m.031t2": "Francis Drake"
        },
        "gold_relation_map": {
            "boats.ship_owner.ships_owned": "boats , ship owner , ships owned",
            "boats.ship_ownership.ship": "boats , ship ownership , ship"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3086",
        "question": "what did kellie martin play on",
        "comp_type": null,
        "answer": [
            "m.012gc447",
            "m.014d_k",
            "m.027bf_l",
            "m.027bvlr",
            "m.02r5cqg",
            "m.02vvqfh",
            "m.047tgmg",
            "m.04cx77",
            "m.04j0kjj",
            "m.04j0rgr",
            "m.04j102g",
            "m.04j10hk",
            "m.04j17yl",
            "m.0636yq",
            "m.06f18v",
            "m.0798vws",
            "m.0798vx4",
            "m.0798vy1",
            "m.0798vyd",
            "m.07jy8w_",
            "m.07k4r92",
            "m.088jb3",
            "m.09rsst4",
            "m.09rxxv6",
            "m.0b1tsc",
            "m.0b450zf",
            "m.0b6pnpl",
            "m.0bdpx8q",
            "m.0cm87r1",
            "m.0fx7rm",
            "m.0fygr7",
            "m.0gkmdyh",
            "m.0h_gxv2",
            "m.0h3cn4m",
            "m.0kl_dpw",
            "m.0nb2sb7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03kcyd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03kcyd ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.03kcyd))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Kellie Martin ] ) )",
        "gold_entity_map": {
            "m.03kcyd": "Kellie Martin"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3087",
        "question": "what does united church of christ believe",
        "comp_type": null,
        "answer": [
            "m.01lp8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01s5nb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01s5nb ns:religion.religion.is_part_of ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.is_part_of) m.01s5nb)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , is part of ] ) [ United Church of Christ ] )",
        "gold_entity_map": {
            "m.01s5nb": "United Church of Christ"
        },
        "gold_relation_map": {
            "religion.religion.is_part_of": "religion , religion , is part of"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3088",
        "question": "where is walton goggins from",
        "comp_type": null,
        "answer": [
            "m.0lphb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07qyl3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07qyl3 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.07qyl3)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Walton Goggins ] )",
        "gold_entity_map": {
            "m.07qyl3": "Walton Goggins"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3089",
        "question": "which province is calgary canada in",
        "comp_type": null,
        "answer": [
            "m.0j95"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r32 ns:base.biblioness.bibs_location.state ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.state) m.01r32)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , state ] ) [ Calgary ] )",
        "gold_entity_map": {
            "m.01r32": "Calgary"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.state": "base , biblioness , bibs location , state"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3094",
        "question": "who is aidan quinn",
        "comp_type": null,
        "answer": [
            "m.02hrh1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045c66)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045c66 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.045c66)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Aidan Quinn ] )",
        "gold_entity_map": {
            "m.045c66": "Aidan Quinn"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3096",
        "question": "what do people from guam speak",
        "comp_type": null,
        "answer": [
            "m.01vky1",
            "m.02h40lc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034tl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034tl ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.034tl)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Guam ] )",
        "gold_entity_map": {
            "m.034tl": "Guam"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3099",
        "question": "what timezone is virginia in",
        "comp_type": null,
        "answer": [
            "m.02_37z",
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07z1m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07z1m ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.07z1m)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Virginia ] )",
        "gold_entity_map": {
            "m.07z1m": "Virginia"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3100",
        "question": "what is the dominican republic part of",
        "comp_type": null,
        "answer": [
            "m.01rll_",
            "m.04pnx",
            "m.059g4",
            "m.07c5l",
            "m.0jsr7mh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.027rn)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Dominican Republic ] )",
        "gold_entity_map": {
            "m.027rn": "Dominican Republic"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3101",
        "question": "where did jerry spinelli live as a kid",
        "comp_type": null,
        "answer": [
            "m.0_75d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05djw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05djw1 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.05djw1)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jerry Spinelli ] )",
        "gold_entity_map": {
            "m.05djw1": "Jerry Spinelli"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3105",
        "question": "what did charles babbage make",
        "comp_type": null,
        "answer": [
            "m.0nf_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qmz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qmz ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n",
        "sexpr": "(JOIN (R base.argumentmaps.innovator.original_ideas) m.01qmz)",
        "normed_sexpr": "( JOIN ( R [ base , argumentmaps , innovator , original ideas ] ) [ Charles Babbage ] )",
        "gold_entity_map": {
            "m.01qmz": "Charles Babbage"
        },
        "gold_relation_map": {
            "base.argumentmaps.innovator.original_ideas": "base , argumentmaps , innovator , original ideas"
        },
        "gold_type_map": {}
    }
]