[
    {
        "ID": "WebQTrn-1717",
        "question": "where was the earthquake in christchurch",
        "comp_type": null,
        "answer": [
            "m.02yc5b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gg9kfr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gg9kfr ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0gg9kfr)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ 2011 Christchurch earthquake ] )",
        "gold_entity_map": {
            "m.0gg9kfr": "2011 Christchurch earthquake"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1718",
        "question": "what timezone is reno nv",
        "comp_type": null,
        "answer": [
            "m.02lcqs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06kx2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06kx2 ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.06kx2)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Reno ] )",
        "gold_entity_map": {
            "m.06kx2": "Reno"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1719",
        "question": "who was niccolo machiavelli influenced by",
        "comp_type": null,
        "answer": [
            "m.01tf5",
            "m.028p0",
            "m.02rpq",
            "m.04l7h",
            "m.04lg6",
            "m.05qmj",
            "m.063_9",
            "m.07lbh",
            "m.0gz_",
            "m.0pzhh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cvs ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.05cvs)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Niccolò Machiavelli ] )",
        "gold_entity_map": {
            "m.05cvs": "Niccolò Machiavelli"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1720",
        "question": "what did cam newton do",
        "comp_type": null,
        "answer": [
            "m.06b1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02phnp7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02phnp7 ns:american_football.football_player.position_s ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_player.position_s) m.02phnp7)",
        "normed_sexpr": "( JOIN ( R [ american football , football player , position s ] ) [ Cam Newton ] )",
        "gold_entity_map": {
            "m.02phnp7": "Cam Newton"
        },
        "gold_relation_map": {
            "american_football.football_player.position_s": "american football , football player , position s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1722",
        "question": "what continent does the bahamas belong to",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0160w)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Bahamas ] )",
        "gold_entity_map": {
            "m.0160w": "Bahamas"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1723",
        "question": "where is baybrook mall",
        "comp_type": null,
        "answer": [
            "m.013mr0",
            "m.03l2n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02r0gfd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02r0gfd ns:business.shopping_center.address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R business.shopping_center.address) m.02r0gfd))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ business , shopping center , address ] ) [ Baybrook Mall ] ) )",
        "gold_entity_map": {
            "m.02r0gfd": "Baybrook Mall"
        },
        "gold_relation_map": {
            "location.mailing_address.citytown": "location , mailing address , citytown",
            "business.shopping_center.address": "business , shopping center , address"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1729",
        "question": "where is bob marley from where was he born",
        "comp_type": null,
        "answer": [
            "m.04zvqpz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bkf4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bkf4 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0bkf4)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Bob Marley ] )",
        "gold_entity_map": {
            "m.0bkf4": "Bob Marley"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1736",
        "question": "where does roman abramovich live",
        "comp_type": null,
        "answer": [
            "m.036wcg",
            "m.04swd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zl71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zl71 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.01zl71))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Roman Abramovich ] ) )",
        "gold_entity_map": {
            "m.01zl71": "Roman Abramovich"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1740",
        "question": "what did neil say on the moon",
        "comp_type": null,
        "answer": [
            "m.06gj5j3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05b6w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05b6w ns:people.person.quotations ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.quotations) m.05b6w)",
        "normed_sexpr": "( JOIN ( R [ people , person , quotations ] ) [ Neil Armstrong ] )",
        "gold_entity_map": {
            "m.05b6w": "Neil Armstrong"
        },
        "gold_relation_map": {
            "people.person.quotations": "people , person , quotations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1741",
        "question": "who played carlton banks",
        "comp_type": null,
        "answer": [
            "m.05_6vk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdz91 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.0bdz91))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Carlton Banks ] ) )",
        "gold_entity_map": {
            "m.0bdz91": "Carlton Banks"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1744",
        "question": "what books did emily dickinson wrote",
        "comp_type": null,
        "answer": [
            "m.043k2cw",
            "m.04yjf53",
            "m.05qf2j2",
            "m.0bqr3k0",
            "m.0bqr3k4",
            "m.0bqr3k9",
            "m.0bqr3kj",
            "m.0bqr3km",
            "m.0cr7_cw",
            "m.0cr808m",
            "m.0cr818f",
            "m.0cr82lv",
            "m.0cr82xy",
            "m.0cr83_x",
            "m.0cr837d",
            "m.0cr84sr",
            "m.0cr86js",
            "m.0cr877f",
            "m.0cr898q",
            "m.0cr89wm",
            "m.0cr8bhj",
            "m.0cr8cty",
            "m.0cr8d46",
            "m.0cr8dz3",
            "m.0cr8pxd",
            "m.0cr8sf0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01509d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01509d ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.01509d)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Emily Dickinson ] )",
        "gold_entity_map": {
            "m.01509d": "Emily Dickinson"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1747",
        "question": "what hotel should i stay in san francisco",
        "comp_type": null,
        "answer": [
            "m.0283jp6",
            "m.03ywbh3",
            "m.0c9ldc",
            "m.0f241m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6lp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6lp ns:travel.travel_destination.accommodation ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.accommodation) m.0d6lp)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , accommodation ] ) [ San Francisco ] )",
        "gold_entity_map": {
            "m.0d6lp": "San Francisco"
        },
        "gold_relation_map": {
            "travel.travel_destination.accommodation": "travel , travel destination , accommodation"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1751",
        "question": "who created youtube",
        "comp_type": null,
        "answer": [
            "m.0d36_b",
            "m.0fzxjm",
            "m.0fzxmd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09jcvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09jcvs ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.09jcvs)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ YouTube ] )",
        "gold_entity_map": {
            "m.09jcvs": "YouTube"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1752",
        "question": "what to do in hong kong for a week",
        "comp_type": null,
        "answer": [
            "m.0180rz",
            "m.018nzh",
            "m.01njfs",
            "m.01npzc",
            "m.022zvr",
            "m.0232xn",
            "m.027yh84",
            "m.02gwnd",
            "m.02hsyf",
            "m.05g4mc",
            "m.097j91",
            "m.0d6mp7",
            "m.0vxf600"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03h64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03h64 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.03h64)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Hong Kong ] )",
        "gold_entity_map": {
            "m.03h64": "Hong Kong"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1754",
        "question": "what influenced andy warhol 's work",
        "comp_type": null,
        "answer": [
            "m.014dq7",
            "m.017b13",
            "m.01sj_s",
            "m.024hjy",
            "m.028xw4",
            "m.041st",
            "m.07kwmh",
            "m.0bqch",
            "m.0gcjf",
            "m.0gskj",
            "m.0hgqq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kc6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kc6 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.0kc6)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Andy Warhol ] )",
        "gold_entity_map": {
            "m.0kc6": "Andy Warhol"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1755",
        "question": "what is fresno state 's zip code",
        "comp_type": null,
        "answer": [
            "m.01zds_5",
            "m.01zdssx",
            "m.01zdsvs",
            "m.01zdsx_",
            "m.01zdsyv",
            "m.01zdt01",
            "m.01zdtcs",
            "m.01zdvcv",
            "m.01zdvwj",
            "m.01zdvxn",
            "m.01zdww4",
            "m.01zphxf",
            "m.03dnj5m",
            "m.03dnj60",
            "m.03dnj75",
            "m.03dnj7l",
            "m.07nq0fh",
            "m.07nq0fq",
            "m.07nq0fy",
            "m.07nq0g4",
            "m.07nq0gc",
            "m.07nq0gl",
            "m.07nq0gt",
            "m.07nq0h0",
            "m.07nq0h7",
            "m.07nq0hg",
            "m.07nq0hp",
            "m.07nq0hx",
            "m.07nq0j_",
            "m.07nq0j3",
            "m.07nq0jb",
            "m.07nq0jk",
            "m.07nq0js",
            "m.07nq0k6",
            "m.07nq0kf",
            "m.07nq0kn",
            "m.07nq0kw",
            "m.07nq0l2",
            "m.07nq0l9",
            "m.07nq0lj",
            "m.07nq0lr",
            "m.07nq0lz",
            "m.07nq0m5",
            "m.07nq0md",
            "m.07nq0mm",
            "m.07nq0mv",
            "m.07nq0n1",
            "m.07nq0n8",
            "m.07nq0nh",
            "m.07nq0nq",
            "m.07nq0ny",
            "m.07nq0p4",
            "m.07nq0pc",
            "m.07nq0pl",
            "m.07nq0pt",
            "m.07nq0q0",
            "m.07nq0q7",
            "m.07nq0qg",
            "m.07nq0qp",
            "m.09sbm5w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mzy7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mzy7 ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0mzy7)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Fresno ] )",
        "gold_entity_map": {
            "m.0mzy7": "Fresno"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1762",
        "question": "what does icelandic sound like",
        "comp_type": null,
        "answer": [
            "m.0140kd",
            "m.03489",
            "m.03v09"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01gmkg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01gmkg ns:language.human_language.language_family ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.language_family) m.01gmkg)",
        "normed_sexpr": "( JOIN ( R [ language , human language , language family ] ) [ Icelandic Language ] )",
        "gold_entity_map": {
            "m.01gmkg": "Icelandic Language"
        },
        "gold_relation_map": {
            "language.human_language.language_family": "language , human language , language family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1763",
        "question": "where does bill richardson live",
        "comp_type": null,
        "answer": [
            "m.02vs37k",
            "m.04sqj",
            "m.05fjy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.020z31)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.020z31 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.020z31))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Bill Richardson ] ) )",
        "gold_entity_map": {
            "m.020z31": "Bill Richardson"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1769",
        "question": "what did the habsburg family control",
        "comp_type": null,
        "answer": [
            "m.016jz3",
            "m.01m41_",
            "m.01pj7",
            "m.024pcx",
            "m.0285m87",
            "m.02zqdb",
            "m.03b79",
            "m.03gk2",
            "m.03l5m1",
            "m.0410vqb",
            "m.06t8v",
            "m.0h7x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03lht)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03lht ns:people.family.country ?x .\n}\n",
        "sexpr": "(JOIN (R people.family.country) m.03lht)",
        "normed_sexpr": "( JOIN ( R [ people , family , country ] ) [ House of Habsburg ] )",
        "gold_entity_map": {
            "m.03lht": "House of Habsburg"
        },
        "gold_relation_map": {
            "people.family.country": "people , family , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1770",
        "question": "what is beyonce 's daughters name",
        "comp_type": null,
        "answer": [
            "m.0hvsrmc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mpq7s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mpq7s ns:people.person.children ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.children) m.01mpq7s)",
        "normed_sexpr": "( JOIN ( R [ people , person , children ] ) [ Beyoncé Knowles ] )",
        "gold_entity_map": {
            "m.01mpq7s": "Beyoncé Knowles"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1773",
        "question": "what songs has madonna written",
        "comp_type": null,
        "answer": [
            "m.0_5ydb_",
            "m.0_j8v05",
            "m.010tff4l",
            "m.012z6s95",
            "m.01393j4h",
            "m.01xflf",
            "m.02pvkh",
            "m.02qcfc",
            "m.02r5nrz",
            "m.02vkl5r",
            "m.02w987t",
            "m.033y4j",
            "m.03fz6jj",
            "m.06xvsx",
            "m.06y4yk",
            "m.06yl_8",
            "m.0713sh",
            "m.07mhlf",
            "m.07xl0b",
            "m.07xl1r",
            "m.07z9x2",
            "m.0870k6",
            "m.08hrck",
            "m.08s72z",
            "m.09x_72",
            "m.0bb858p",
            "m.0bx70v",
            "m.0fq34rt",
            "m.0hnk8cb",
            "m.0hr9mfd",
            "m.0j3h03b",
            "m.0j9lvrg",
            "m.0l10n6",
            "m.0wxx9kk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vs_v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vs_v8 ns:music.composer.compositions ?x .\n}\n",
        "sexpr": "(JOIN (R music.composer.compositions) m.01vs_v8)",
        "normed_sexpr": "( JOIN ( R [ music , composer , compositions ] ) [ Madonna ] )",
        "gold_entity_map": {
            "m.01vs_v8": "Madonna"
        },
        "gold_relation_map": {
            "music.composer.compositions": "music , composer , compositions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1778",
        "question": "where did pope benedict xvi live",
        "comp_type": null,
        "answer": [
            "m.017v_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09wpt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09wpt ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.09wpt))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Pope Benedict XVI ] ) )",
        "gold_entity_map": {
            "m.09wpt": "Pope Benedict XVI"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1781",
        "question": "where is tommy emmanuel from",
        "comp_type": null,
        "answer": [
            "m.04c1fr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.064t69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.064t69 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.064t69)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Tommy Emmanuel ] )",
        "gold_entity_map": {
            "m.064t69": "Tommy Emmanuel"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1783",
        "question": "what is there to do around austin texas",
        "comp_type": null,
        "answer": [
            "m.0163ss",
            "m.0163z0",
            "m.0165v1",
            "m.02j53x",
            "m.02pvcrn",
            "m.02rlk08",
            "m.02vr6yr",
            "m.03s9xh",
            "m.03xlkf",
            "m.055p3fc",
            "m.05r95y",
            "m.0bxyz_",
            "m.0fljtq",
            "m.0fpc1v3",
            "m.0jwl321",
            "m.0vzsjtm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0vzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0vzm ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0vzm)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Austin ] )",
        "gold_entity_map": {
            "m.0vzm": "Austin"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1787",
        "question": "what kind of money do the netherlands use",
        "comp_type": null,
        "answer": [
            "m.02l6h",
            "m.09nqf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059j2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059j2 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.059j2)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Netherlands ] )",
        "gold_entity_map": {
            "m.059j2": "Netherlands"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1789",
        "question": "who is henry david thoreau",
        "comp_type": null,
        "answer": [
            "m.02h6fbs",
            "m.05z96",
            "m.0cbd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bwx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bwx3 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0bwx3)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Henry David Thoreau ] )",
        "gold_entity_map": {
            "m.0bwx3": "Henry David Thoreau"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1790",
        "question": "who are richard pryor children",
        "comp_type": null,
        "answer": [
            "m.05z2sbw",
            "m.05z2sc1",
            "m.05z2scg",
            "m.05z2scn",
            "m.05z2scv",
            "m.06xlb2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hmk9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hmk9 ns:people.person.children ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.children) m.01hmk9)",
        "normed_sexpr": "( JOIN ( R [ people , person , children ] ) [ Richard Pryor ] )",
        "gold_entity_map": {
            "m.01hmk9": "Richard Pryor"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1793",
        "question": "what club did santi cazorla play for",
        "comp_type": null,
        "answer": [
            "m.02w64f",
            "m.03fnrc",
            "m.03tck1",
            "m.04f1glf",
            "m.0ksy_",
            "m.0xbm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0264yjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0264yjz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.0264yjz))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Santi Cazorla ] ) )",
        "gold_entity_map": {
            "m.0264yjz": "Santi Cazorla"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1795",
        "question": "where does the atlanta braves play",
        "comp_type": null,
        "answer": [
            "m.020fp1",
            "m.0ctrnf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x2p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x2p ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.0x2p)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Atlanta Braves ] )",
        "gold_entity_map": {
            "m.0x2p": "Atlanta Braves"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1796",
        "question": "what year did detroit pistons win nba championships",
        "comp_type": null,
        "answer": [
            "m.07p0zz",
            "m.08x9rj",
            "m.08x9tm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm8l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm8l ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0jm8l)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Detroit Pistons ] )",
        "gold_entity_map": {
            "m.0jm8l": "Detroit Pistons"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    }
]