[
    {
        "ID": "WebQTrn-1048",
        "question": "what to do in panama city beach fl",
        "comp_type": null,
        "answer": [
            "m.02q0c5g",
            "m.03qcdj2",
            "m.04_d4w",
            "m.04jcmvz",
            "m.04xj82",
            "m.0b6k8d0",
            "m.0bx_v4t",
            "m.0cm8mdj",
            "m.0gzwlv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rhg5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rhg5 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0rhg5)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Panama City Beach ] )",
        "gold_entity_map": {
            "m.0rhg5": "Panama City Beach"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1050",
        "question": "where is san miguel mexico on map",
        "comp_type": null,
        "answer": [
            "m.0259ws"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.056201)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.056201 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.02_3pws .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.02_3pws) (JOIN (R location.location.containedby) m.056201))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Mexican state ] ) ( JOIN ( R [ location , location , containedby ] ) [ San Miguel de Allende ] ) )",
        "gold_entity_map": {
            "m.02_3pws": "Mexican state",
            "m.056201": "San Miguel de Allende"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.02_3pws": "Mexican state"
        }
    },
    {
        "ID": "WebQTrn-1052",
        "question": "where are the great pyramid of giza located",
        "comp_type": null,
        "answer": [
            "m.02k54",
            "m.06bkmh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036mk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036mk ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.036mk)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Great Pyramid of Giza ] )",
        "gold_entity_map": {
            "m.036mk": "Great Pyramid of Giza"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1053",
        "question": "what was liam neeson 's character in star wars",
        "comp_type": null,
        "answer": [
            "m.0gzgj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h5g_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h5g_ ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.0ddt_ .\n}\n",
        "sexpr": "(JOIN (R film.performance.character) (AND (JOIN film.performance.film m.0ddt_) (JOIN (R film.actor.film) m.0h5g_)))",
        "normed_sexpr": "( JOIN ( R [ film , performance , character ] ) ( AND ( JOIN [ film , performance , film ] [ Star Wars Episode I: The Phantom Menace ] ) ( JOIN ( R [ film , actor , film ] ) [ Liam Neeson ] ) ) )",
        "gold_entity_map": {
            "m.0ddt_": "Star Wars Episode I: The Phantom Menace",
            "m.0h5g_": "Liam Neeson"
        },
        "gold_relation_map": {
            "film.performance.character": "film , performance , character",
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1056",
        "question": "what is the capital of georgia",
        "comp_type": null,
        "answer": [
            "m.013yq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0x8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0x8 ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.capital) m.0d0x8)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Georgia ] )",
        "gold_entity_map": {
            "m.0d0x8": "Georgia"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.capital": "base , aareas , schema , administrative area , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1060",
        "question": "who is susan st james",
        "comp_type": null,
        "answer": [
            "m.02hrh1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03rp65)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03rp65 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03rp65)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Susan Saint James ] )",
        "gold_entity_map": {
            "m.03rp65": "Susan Saint James"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1061",
        "question": "what is chris paul 's son name",
        "comp_type": null,
        "answer": [
            "m.0j2l1rs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cymln)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cymln ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.children) m.0cymln))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Chris Paul ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.0cymln": "Chris Paul"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1065",
        "question": "what is the state flag of colorado called",
        "comp_type": null,
        "answer": [
            "m.02hc9l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n4w ns:symbols.flag_referent.flag ?y .\n?y ns:symbols.flag_use.flag ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.flag_use.flag) (JOIN (R symbols.flag_referent.flag) m.01n4w))",
        "normed_sexpr": "( JOIN ( R [ symbols , flag use , flag ] ) ( JOIN ( R [ symbols , flag referent , flag ] ) [ Colorado ] ) )",
        "gold_entity_map": {
            "m.01n4w": "Colorado"
        },
        "gold_relation_map": {
            "symbols.flag_use.flag": "symbols , flag use , flag",
            "symbols.flag_referent.flag": "symbols , flag referent , flag"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1070",
        "question": "where marie curie come from",
        "comp_type": null,
        "answer": [
            "m.081m_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.053_d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.053_d ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.053_d)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Marie Curie ] )",
        "gold_entity_map": {
            "m.053_d": "Marie Curie"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1071",
        "question": "who is facebook 's founder",
        "comp_type": null,
        "answer": [
            "m.076zfg8",
            "m.086dny",
            "m.0cm9z65",
            "m.0d8xb7",
            "m.0gh3lq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hmyfsv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hmyfsv ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.0hmyfsv)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Facebook, Inc. ] )",
        "gold_entity_map": {
            "m.0hmyfsv": "Facebook, Inc."
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1072",
        "question": "what kind of money do you use in aruba",
        "comp_type": null,
        "answer": [
            "m.08s1k3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j11)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j11 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0j11)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Aruba ] )",
        "gold_entity_map": {
            "m.0j11": "Aruba"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1075",
        "question": "what is lil wayne real name",
        "comp_type": null,
        "answer": [
            "Dwayne Michael Carter, Jr."
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016kjs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016kjs ns:base.schemastaging.context_name.official_name ?x .\n}\n",
        "sexpr": "(JOIN (R base.schemastaging.context_name.official_name) m.016kjs)",
        "normed_sexpr": "( JOIN ( R [ base , schemastaging , context name , official name ] ) [ Lil Wayne ] )",
        "gold_entity_map": {
            "m.016kjs": "Lil Wayne"
        },
        "gold_relation_map": {
            "base.schemastaging.context_name.official_name": "base , schemastaging , context name , official name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1077",
        "question": "what religions are practiced in afghanistan",
        "comp_type": null,
        "answer": [
            "m.06pq6",
            "m.078tg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdd ns:location.statistical_region.religions ?y .\n?y ns:location.religion_percentage.religion ?x .\n}\n",
        "sexpr": "(JOIN (R location.religion_percentage.religion) (JOIN (R location.statistical_region.religions) m.0jdd))",
        "normed_sexpr": "( JOIN ( R [ location , religion percentage , religion ] ) ( JOIN ( R [ location , statistical region , religions ] ) [ Afghanistan ] ) )",
        "gold_entity_map": {
            "m.0jdd": "Afghanistan"
        },
        "gold_relation_map": {
            "location.religion_percentage.religion": "location , religion percentage , religion",
            "location.statistical_region.religions": "location , statistical region , religions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1078",
        "question": "where is the world series 2012 being played",
        "comp_type": null,
        "answer": [
            "m.01_gsg",
            "m.01wn2j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ds8qct)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ds8qct ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0ds8qct)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ 2012 World Series ] )",
        "gold_entity_map": {
            "m.0ds8qct": "2012 World Series"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1079",
        "question": "what kind of language do irish speak",
        "comp_type": null,
        "answer": [
            "m.0165vf",
            "m.01bx1n",
            "m.02h40lc",
            "m.03nyl",
            "m.03x42",
            "m.0h407"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bkbh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bkbh ns:people.ethnicity.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.languages_spoken) m.03bkbh)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Irish people ] )",
        "gold_entity_map": {
            "m.03bkbh": "Irish people"
        },
        "gold_relation_map": {
            "people.ethnicity.languages_spoken": "people , ethnicity , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1082",
        "question": "where was dwight howard born",
        "comp_type": null,
        "answer": [
            "m.013yq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02fg_f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02fg_f ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02fg_f)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Dwight Howard ] )",
        "gold_entity_map": {
            "m.02fg_f": "Dwight Howard"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1084",
        "question": "what timezone is texas san antonio in",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2w0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2w0 ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0f2w0)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ San Antonio ] )",
        "gold_entity_map": {
            "m.0f2w0": "San Antonio"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1085",
        "question": "where is alexandria located",
        "comp_type": null,
        "answer": [
            "m.02k54"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.013g3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.013g3 ns:base.biblioness.bibs_location.country ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.country) m.013g3)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Alexandria ] )",
        "gold_entity_map": {
            "m.013g3": "Alexandria"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.country": "base , biblioness , bibs location , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1091",
        "question": "when did the raiders win the superbowl",
        "comp_type": null,
        "answer": [
            "m.0_gt_px",
            "m.02r9cp7",
            "m.076ps",
            "m.076r4",
            "m.076s5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05l71)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05l71 ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.05l71)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Oakland Raiders ] )",
        "gold_entity_map": {
            "m.05l71": "Oakland Raiders"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1095",
        "question": "where did pixie lott go to school",
        "comp_type": null,
        "answer": [
            "m.08tyb_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05p300p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05p300p ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.05p300p))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Pixie Lott ] ) )",
        "gold_entity_map": {
            "m.05p300p": "Pixie Lott"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1096",
        "question": "what date did we invade iraq",
        "comp_type": null,
        "answer": [
            "2003-03-20"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cpp0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cpp0 ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.01cpp0)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ 2003 invasion of Iraq ] )",
        "gold_entity_map": {
            "m.01cpp0": "2003 invasion of Iraq"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1097",
        "question": "what is the new orleans hornets new name",
        "comp_type": null,
        "answer": [
            "New Orleans Pelicans"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm6n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm6n ns:type.object.name ?x .\n}\n",
        "sexpr": "(JOIN (R type.object.name) m.0jm6n)",
        "normed_sexpr": "( JOIN ( R [ type , object , name ] ) [ New Orleans Pelicans ] )",
        "gold_entity_map": {
            "m.0jm6n": "New Orleans Pelicans"
        },
        "gold_relation_map": {
            "type.object.name": "type , object , name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1100",
        "question": "what do the buddha believe in",
        "comp_type": null,
        "answer": [
            "m.092bf5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015k7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015k7 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.015k7)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Gautama Buddha ] )",
        "gold_entity_map": {
            "m.015k7": "Gautama Buddha"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1102",
        "question": "what is the name of walt disney 's son",
        "comp_type": null,
        "answer": [],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081nh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081nh ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.children) m.081nh))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Walt Disney ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.081nh": "Walt Disney"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1108",
        "question": "what is yale university mascot",
        "comp_type": null,
        "answer": [
            "m.05ty1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08815)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08815 ns:education.educational_institution.mascot ?x .\n}\n",
        "sexpr": "(JOIN (R education.educational_institution.mascot) m.08815)",
        "normed_sexpr": "( JOIN ( R [ education , educational institution , mascot ] ) [ University Yale ] )",
        "gold_entity_map": {
            "m.08815": "University Yale"
        },
        "gold_relation_map": {
            "education.educational_institution.mascot": "education , educational institution , mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1109",
        "question": "what is the currency used in tunisia",
        "comp_type": null,
        "answer": [
            "m.04z4ml"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07fj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07fj_ ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.07fj_)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Tunisia ] )",
        "gold_entity_map": {
            "m.07fj_": "Tunisia"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1110",
        "question": "what language group does polish belong to",
        "comp_type": null,
        "answer": [
            "m.013bdx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qqm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qqm ns:base.rosetta.languoid.parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.rosetta.languoid.parent) m.05qqm)",
        "normed_sexpr": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Polish Language ] )",
        "gold_entity_map": {
            "m.05qqm": "Polish Language"
        },
        "gold_relation_map": {
            "base.rosetta.languoid.parent": "base , rosetta , languoid , parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1111",
        "question": "what is the name of the new orleans saints football stadium",
        "comp_type": null,
        "answer": [
            "m.02y3xn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3v ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.05g3v)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ New Orleans Saints ] )",
        "gold_entity_map": {
            "m.05g3v": "New Orleans Saints"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1116",
        "question": "what type of music was scott joplin noted for",
        "comp_type": null,
        "answer": [
            "m.06m6j",
            "m.0cdr_y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07b69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07b69 ns:music.artist.genre ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.genre) m.07b69)",
        "normed_sexpr": "( JOIN ( R [ music , artist , genre ] ) [ Scott Joplin ] )",
        "gold_entity_map": {
            "m.07b69": "Scott Joplin"
        },
        "gold_relation_map": {
            "music.artist.genre": "music , artist , genre"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1119",
        "question": "where is adam smith from",
        "comp_type": null,
        "answer": [
            "m.01zrs_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0tfc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0tfc ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0tfc)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Adam Smith ] )",
        "gold_entity_map": {
            "m.0tfc": "Adam Smith"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1120",
        "question": "who became president after harding died",
        "comp_type": null,
        "answer": [
            "m.01vbl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081t6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081t6 ns:government.us_president.vice_president ?x .\n}\n",
        "sexpr": "(JOIN (R government.us_president.vice_president) m.081t6)",
        "normed_sexpr": "( JOIN ( R [ government , us president , vice president ] ) [ Warren G. Harding ] )",
        "gold_entity_map": {
            "m.081t6": "Warren G. Harding"
        },
        "gold_relation_map": {
            "government.us_president.vice_president": "government , us president , vice president"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1122",
        "question": "what illnesses did george washington have",
        "comp_type": null,
        "answer": [
            "m.0542n",
            "m.06vr2",
            "m.07jwr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.034rd)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ George Washington ] )",
        "gold_entity_map": {
            "m.034rd": "George Washington"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1123",
        "question": "where is north port florida located",
        "comp_type": null,
        "answer": [
            "m.0jxkf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01z_vzm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01z_vzm ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.01z_vzm)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ North Port ] )",
        "gold_entity_map": {
            "m.01z_vzm": "North Port"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1128",
        "question": "who is abraham maslow",
        "comp_type": null,
        "answer": [
            "m.0cbd2",
            "m.0jgxn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r_fw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r_fw ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01r_fw)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Abraham Maslow ] )",
        "gold_entity_map": {
            "m.01r_fw": "Abraham Maslow"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1129",
        "question": "where did the cuban missile crisis happen",
        "comp_type": null,
        "answer": [
            "m.02613",
            "m.0d04z6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01zxx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01zxx ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.01zxx)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Cuban Missile Crisis ] )",
        "gold_entity_map": {
            "m.01zxx": "Cuban Missile Crisis"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    }
]