[
    {
        "ID": "WebQTrn-530",
        "question": "what book did niccolo machiavelli write",
        "comp_type": null,
        "answer": [
            "m.059cj5q",
            "m.059cj66",
            "m.059cj6r",
            "m.059cj77",
            "m.059cj7r",
            "m.059cj87",
            "m.059cj8r",
            "m.059cj97",
            "m.059cj9r",
            "m.059cjb7",
            "m.059cjbr",
            "m.059cjc7",
            "m.059cjcr",
            "m.059cjd7",
            "m.059cjdl",
            "m.059cjf1",
            "m.059cjfk",
            "m.059cjg1",
            "m.059cjgk",
            "m.059cjgw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cvs ns:book.author.book_editions_published ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.book_editions_published) m.05cvs)",
        "normed_sexpr": "( JOIN ( R [ book , author , book editions published ] ) [ Niccolò Machiavelli ] )",
        "gold_entity_map": {
            "m.05cvs": "Niccolò Machiavelli"
        },
        "gold_relation_map": {
            "book.author.book_editions_published": "book , author , book editions published"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-533",
        "question": "where is the mtv headquarters",
        "comp_type": null,
        "answer": [
            "m.02_286"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rqd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rqd ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.04rqd))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ MTV ] ) )",
        "gold_entity_map": {
            "m.04rqd": "MTV"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-535",
        "question": "what is guatemala current system of government",
        "comp_type": null,
        "answer": [
            "m.01d9r3",
            "m.01fpfn",
            "m.0c9rw5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345_ ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.0345_)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Guatemala ] )",
        "gold_entity_map": {
            "m.0345_": "Guatemala"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-536",
        "question": "what is anderson silva trained in",
        "comp_type": null,
        "answer": [
            "m.02_8dlt",
            "m.02hrh1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0djnt1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0djnt1 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0djnt1)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Anderson Silva ] )",
        "gold_entity_map": {
            "m.0djnt1": "Anderson Silva"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-540",
        "question": "what does pixar produce",
        "comp_type": null,
        "answer": [
            "m.0_fp_zm",
            "m.011114yr",
            "m.0134y27d",
            "m.01c22t",
            "m.01jrbb",
            "m.01xdxy",
            "m.027s39y",
            "m.02c7k4",
            "m.02lp2p",
            "m.02p_3d5",
            "m.02qm_f",
            "m.02rn00y",
            "m.02xckn6",
            "m.03h2br3",
            "m.03psgx",
            "m.03q0r1",
            "m.03wp2q",
            "m.03x7hd",
            "m.0407v2n",
            "m.0407yfx",
            "m.0407yj_",
            "m.0409199",
            "m.0421jh2",
            "m.046p4h",
            "m.047sk1j",
            "m.04hp18",
            "m.04hwbq",
            "m.04jmpdl",
            "m.04kfn7",
            "m.05f80xj",
            "m.05p1h4",
            "m.05ttpm",
            "m.05yt15",
            "m.064pff0",
            "m.06jb92",
            "m.07fp10",
            "m.0805f5_",
            "m.09gmczn",
            "m.0bhbv_6",
            "m.0bq2wj",
            "m.0dyb1",
            "m.0g1dyx",
            "m.0gwndqr",
            "m.0gwymwr",
            "m.0h2mkmw",
            "m.0h50n6",
            "m.0hhs76t",
            "m.0l8ptqj",
            "m.0ll4d9b",
            "m.0p7686_",
            "m.0pdnx8k",
            "m.0qzzd_7",
            "m.0wpwlgl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:film.production_company.films ?x .\n}\n",
        "sexpr": "(JOIN (R film.production_company.films) m.0kk9v)",
        "normed_sexpr": "( JOIN ( R [ film , production company , films ] ) [ Pixar ] )",
        "gold_entity_map": {
            "m.0kk9v": "Pixar"
        },
        "gold_relation_map": {
            "film.production_company.films": "film , production company , films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-541",
        "question": "what did emily dickinson die of",
        "comp_type": null,
        "answer": [
            "m.024f_f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01509d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01509d ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01509d)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Emily Dickinson ] )",
        "gold_entity_map": {
            "m.01509d": "Emily Dickinson"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-544",
        "question": "what was elie wiesel 's father 's name",
        "comp_type": null,
        "answer": [
            "m.0nfv34z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vsp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vsp ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.02vsp))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Elie Wiesel ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.02vsp": "Elie Wiesel"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-547",
        "question": "what victoria beckham kids names",
        "comp_type": null,
        "answer": [
            "m.02vk62d",
            "m.04dylr1",
            "m.04dylr8",
            "m.0gxvrw2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgfb ns:people.person.children ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.children) m.0cgfb)",
        "normed_sexpr": "( JOIN ( R [ people , person , children ] ) [ Victoria Beckham ] )",
        "gold_entity_map": {
            "m.0cgfb": "Victoria Beckham"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-548",
        "question": "where is new york in the map",
        "comp_type": null,
        "answer": [
            "m.018v5k",
            "m.02jwvm",
            "m.04_1l0v",
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059rby)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059rby ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.059rby)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ New York ] )",
        "gold_entity_map": {
            "m.059rby": "New York"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-550",
        "question": "what did jimmy valvano die with",
        "comp_type": null,
        "answer": [
            "m.0qcr0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wb5r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wb5r ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.04wb5r)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Jim Valvano ] )",
        "gold_entity_map": {
            "m.04wb5r": "Jim Valvano"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-553",
        "question": "where did giovanni pierluigi da palestrina live",
        "comp_type": null,
        "answer": [
            "m.02w93f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03bx_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03bx_ ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.03bx_)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Giovanni Pierluigi da Palestrina ] )",
        "gold_entity_map": {
            "m.03bx_": "Giovanni Pierluigi da Palestrina"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-555",
        "question": "when michael jordan got drafted",
        "comp_type": null,
        "answer": [
            "m.06jncs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.054c1))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Michael Jordan ] ) )",
        "gold_entity_map": {
            "m.054c1": "Michael Jordan"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-556",
        "question": "what kind of money do the philippines use",
        "comp_type": null,
        "answer": [
            "m.01h5bw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.05v8c)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Philippines ] )",
        "gold_entity_map": {
            "m.05v8c": "Philippines"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-563",
        "question": "what did lucille ball die of",
        "comp_type": null,
        "answer": [
            "m.01p3jd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nw9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nw9 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.04nw9)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Lucille Ball ] )",
        "gold_entity_map": {
            "m.04nw9": "Lucille Ball"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-564",
        "question": "what religion was john f kennedy",
        "comp_type": null,
        "answer": [
            "m.0c8wxp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:base.popstra.celebrity.religion ?y .\n?y ns:base.popstra.religion_choice.religion ?x .\n}\n",
        "sexpr": "(JOIN (R base.popstra.religion_choice.religion) (JOIN (R base.popstra.celebrity.religion) m.0d3k14))",
        "normed_sexpr": "( JOIN ( R [ base , popstra , religion choice , religion ] ) ( JOIN ( R [ base , popstra , celebrity , religion ] ) [ John F. Kennedy ] ) )",
        "gold_entity_map": {
            "m.0d3k14": "John F. Kennedy"
        },
        "gold_relation_map": {
            "base.popstra.religion_choice.religion": "base , popstra , religion choice , religion",
            "base.popstra.celebrity.religion": "base , popstra , celebrity , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-565",
        "question": "where was the earthquake in chile 2010",
        "comp_type": null,
        "answer": [
            "m.036fp1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bmhrmh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bmhrmh ns:event.disaster.areas_affected ?x .\n}\n",
        "sexpr": "(JOIN (R event.disaster.areas_affected) m.0bmhrmh)",
        "normed_sexpr": "( JOIN ( R [ event , disaster , areas affected ] ) [ 2010 Chile earthquake ] )",
        "gold_entity_map": {
            "m.0bmhrmh": "2010 Chile earthquake"
        },
        "gold_relation_map": {
            "event.disaster.areas_affected": "event , disaster , areas affected"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-567",
        "question": "what movies did ron howard do",
        "comp_type": null,
        "answer": [
            "m.01vd7y",
            "m.0273yvf",
            "m.02mh4b",
            "m.02rylzd",
            "m.02yf34",
            "m.04d_tqm",
            "m.04j34jb",
            "m.05y48m",
            "m.069ym_",
            "m.06r6r_",
            "m.06rqp_",
            "m.06w2sxf",
            "m.06zsyy6",
            "m.079h70",
            "m.07cqxs",
            "m.09gf7yk",
            "m.09m6kg",
            "m.0b66flr",
            "m.0b7b2_b",
            "m.0cqnss",
            "m.0crjcw1",
            "m.0crrc8",
            "m.0crrhfn",
            "m.0crwz48",
            "m.0dgkzwj",
            "m.0dqwvw",
            "m.0gxdf11",
            "m.0hv8w",
            "m.0wxvvw1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0g2lq))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Ron Howard ] ) )",
        "gold_entity_map": {
            "m.0g2lq": "Ron Howard"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-568",
        "question": "what county is charlotte north carolina",
        "comp_type": null,
        "answer": [
            "m.025rst1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fsb8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fsb8 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0fsb8)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Charlotte ] )",
        "gold_entity_map": {
            "m.0fsb8": "Charlotte"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-570",
        "question": "who is michelle obama",
        "comp_type": null,
        "answer": [
            "m.04gc2",
            "m.0cbd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025s5v9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025s5v9 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.025s5v9)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Michelle Obama ] )",
        "gold_entity_map": {
            "m.025s5v9": "Michelle Obama"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-575",
        "question": "what kourtney kardashian name her daughter",
        "comp_type": null,
        "answer": [
            "m.0k3cqw1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043ttm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043ttm7 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.children) m.043ttm7))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , children ] ) [ Kourtney Kardashian ] ) )",
        "gold_entity_map": {
            "m.043ttm7": "Kourtney Kardashian",
            "m.02zsn": "Female"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-577",
        "question": "what kind of government does chile have today",
        "comp_type": null,
        "answer": [
            "m.01d9r3",
            "m.01fpfn",
            "m.0c9rw5",
            "m.0fpgmpz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.01p1v)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Chile ] )",
        "gold_entity_map": {
            "m.01p1v": "Chile"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-578",
        "question": "where did richard arkwright die",
        "comp_type": null,
        "answer": [
            "m.03k9xq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tglh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tglh ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.01tglh)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Richard Arkwright ] )",
        "gold_entity_map": {
            "m.01tglh": "Richard Arkwright"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-584",
        "question": "where was hackney 2012 held",
        "comp_type": null,
        "answer": [
            "m.031dy5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0yx1g5l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0yx1g5l ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0yx1g5l)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Radio 1′s Hackney Weekend 2012 ] )",
        "gold_entity_map": {
            "m.0yx1g5l": "Radio 1′s Hackney Weekend 2012"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-585",
        "question": "where does the st louis rams play football",
        "comp_type": null,
        "answer": [
            "m.02b99h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06x76)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06x76 ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.06x76)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ St. Louis Rams ] )",
        "gold_entity_map": {
            "m.06x76": "St. Louis Rams"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-586",
        "question": "what year did scottie pippen come into the nba",
        "comp_type": null,
        "answer": [
            "1987"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vpgl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vpgl ns:sports.pro_athlete.career_start ?x .\n}\n",
        "sexpr": "(JOIN (R sports.pro_athlete.career_start) m.01vpgl)",
        "normed_sexpr": "( JOIN ( R [ sports , pro athlete , career start ] ) [ Scottie Pippen ] )",
        "gold_entity_map": {
            "m.01vpgl": "Scottie Pippen"
        },
        "gold_relation_map": {
            "sports.pro_athlete.career_start": "sports , pro athlete , career start"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-587",
        "question": "where are you if you re in zagreb",
        "comp_type": null,
        "answer": [
            "m.01pj7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fhzy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fhzy ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_parent) m.0fhzy)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Zagreb ] )",
        "gold_entity_map": {
            "m.0fhzy": "Zagreb"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_parent": "base , aareas , schema , administrative area , administrative parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-589",
        "question": "what city was selena gomez born in",
        "comp_type": null,
        "answer": [
            "m.013mbz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0gs6vr)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Selena Gomez ] )",
        "gold_entity_map": {
            "m.0gs6vr": "Selena Gomez"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-594",
        "question": "what is the current time in nigeria lagos",
        "comp_type": null,
        "answer": [
            "m.02llzg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lnfy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lnfy ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0lnfy)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Lagos ] )",
        "gold_entity_map": {
            "m.0lnfy": "Lagos"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-595",
        "question": "what shows did henry winkler produce",
        "comp_type": null,
        "answer": [
            "m.01fj53",
            "m.026v67_",
            "m.02z2yth",
            "m.04mzj0q",
            "m.05zswr",
            "m.0744n6",
            "m.0dbm1y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024jwt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024jwt ns:tv.tv_producer.programs_produced ?y .\n?y ns:tv.tv_producer_term.program ?x .\n}\n",
        "sexpr": "(JOIN (R tv.tv_producer_term.program) (JOIN (R tv.tv_producer.programs_produced) m.024jwt))",
        "normed_sexpr": "( JOIN ( R [ tv , tv producer term , program ] ) ( JOIN ( R [ tv , tv producer , programs produced ] ) [ Henry Winkler ] ) )",
        "gold_entity_map": {
            "m.024jwt": "Henry Winkler"
        },
        "gold_relation_map": {
            "tv.tv_producer.programs_produced": "tv , tv producer , programs produced",
            "tv.tv_producer_term.program": "tv , tv producer term , program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-596",
        "question": "what state was texaco gas founded",
        "comp_type": null,
        "answer": [
            "m.0104lr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g499)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g499 ns:organization.organization.place_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.place_founded) m.0g499)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , place founded ] ) [ Texaco ] )",
        "gold_entity_map": {
            "m.0g499": "Texaco"
        },
        "gold_relation_map": {
            "organization.organization.place_founded": "organization , organization , place founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-601",
        "question": "what is brazil time zone",
        "comp_type": null,
        "answer": [
            "m.0jy1pqp",
            "m.0y496y2",
            "m.0y49b8w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015fr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015fr ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.015fr)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Brazil ] )",
        "gold_entity_map": {
            "m.015fr": "Brazil"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-605",
        "question": "who was tex beneke",
        "comp_type": null,
        "answer": [
            "m.029bkp",
            "m.02h66dr",
            "m.09jwl",
            "m.09l65"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.076yxy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.076yxy ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.076yxy)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Tex Beneke ] )",
        "gold_entity_map": {
            "m.076yxy": "Tex Beneke"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    }
]