[
    {
        "ID": "WebQTrn-245",
        "question": "what did george v die of",
        "comp_type": null,
        "answer": [
            "m.02m25"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmpn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmpn ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0cmpn)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ George V ] )",
        "gold_entity_map": {
            "m.0cmpn": "George V"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-248",
        "question": "who started pixar",
        "comp_type": null,
        "answer": [
            "m.017h4c",
            "m.06y3r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.0kk9v)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Pixar ] )",
        "gold_entity_map": {
            "m.0kk9v": "Pixar"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-249",
        "question": "who is tia and tamera mowry parents",
        "comp_type": null,
        "answer": [
            "m.0b_x1n8",
            "m.0gygc8m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054xvs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054xvs ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.054xvs)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Tia Mowry ] )",
        "gold_entity_map": {
            "m.054xvs": "Tia Mowry"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-253",
        "question": "where is the nation of greece located",
        "comp_type": null,
        "answer": [
            "m.02j9z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035qy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035qy ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.035qy)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Greece ] )",
        "gold_entity_map": {
            "m.035qy": "Greece"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-255",
        "question": "what year was the new york blackout",
        "comp_type": null,
        "answer": [
            "1977-07-13"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02j2gt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02j2gt ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.02j2gt)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ New York City blackout of 1977 ] )",
        "gold_entity_map": {
            "m.02j2gt": "New York City blackout of 1977"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-257",
        "question": "what position does rafael furcal play",
        "comp_type": null,
        "answer": [
            "m.017drs",
            "m.02rsl1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jtzg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jtzg ns:baseball.baseball_player.position_s ?x .\n}\n",
        "sexpr": "(JOIN (R baseball.baseball_player.position_s) m.03jtzg)",
        "normed_sexpr": "( JOIN ( R [ baseball , baseball player , position s ] ) [ Rafael Furcal ] )",
        "gold_entity_map": {
            "m.03jtzg": "Rafael Furcal"
        },
        "gold_relation_map": {
            "baseball.baseball_player.position_s": "baseball , baseball player , position s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-259",
        "question": "what shows did kellie martin star in",
        "comp_type": null,
        "answer": [
            "m.0180mw",
            "m.025v6tf",
            "m.026h12p",
            "m.027z1w1",
            "m.02s17g",
            "m.03q1mg",
            "m.03v_dq",
            "m.03vn46",
            "m.03wrwt",
            "m.05nlzq",
            "m.07cf_d1",
            "m.08znxc",
            "m.0d7bm_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03kcyd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03kcyd ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.03kcyd))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Kellie Martin ] ) )",
        "gold_entity_map": {
            "m.03kcyd": "Kellie Martin"
        },
        "gold_relation_map": {
            "tv.tv_actor.starring_roles": "tv , tv actor , starring roles",
            "tv.regular_tv_appearance.series": "tv , regular tv appearance , series"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-261",
        "question": "where is whistler mountain located",
        "comp_type": null,
        "answer": [
            "m.015jr",
            "m.0183r6",
            "m.019f_v",
            "m.01jwb2",
            "m.059g4",
            "m.05q3snr",
            "m.08p698",
            "m.08pqh0",
            "m.0d060g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pg6z3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pg6z3 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.02pg6z3)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Whistler Mountain ] )",
        "gold_entity_map": {
            "m.02pg6z3": "Whistler Mountain"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-263",
        "question": "what country did james cook come from",
        "comp_type": null,
        "answer": [
            "m.014tss",
            "m.07ssc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_j8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_j8 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.03_j8)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ James Cook ] )",
        "gold_entity_map": {
            "m.03_j8": "James Cook"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-266",
        "question": "when did the christchurch quake happened",
        "comp_type": null,
        "answer": [
            "2011-02-22"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gg9kfr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gg9kfr ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.0gg9kfr)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ 2011 Christchurch earthquake ] )",
        "gold_entity_map": {
            "m.0gg9kfr": "2011 Christchurch earthquake"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-269",
        "question": "who played mason capwell",
        "comp_type": null,
        "answer": [
            "m.04qpl4",
            "m.0dvmd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04f3bz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04f3bz1 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.04f3bz1))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Mason Capwell ] ) )",
        "gold_entity_map": {
            "m.04f3bz1": "Mason Capwell"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-270",
        "question": "what is james madison most famous for",
        "comp_type": null,
        "answer": [
            "m.01xljv7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0424m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0424m ns:common.topic.notable_types ?x .\n}\n",
        "sexpr": "(JOIN (R common.topic.notable_types) m.0424m)",
        "normed_sexpr": "( JOIN ( R [ common , topic , notable types ] ) [ James Madison ] )",
        "gold_entity_map": {
            "m.0424m": "James Madison"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-272",
        "question": "where was the battle of antietam creek",
        "comp_type": null,
        "answer": [
            "m.04rrd",
            "m.0txnb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lkxb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lkxb ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0lkxb)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of Antietam ] )",
        "gold_entity_map": {
            "m.0lkxb": "Battle of Antietam"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-274",
        "question": "who are shakespeare 's parents names",
        "comp_type": null,
        "answer": [
            "m.01stsq",
            "m.01xgc7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.081k8)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ William Shakespeare ] )",
        "gold_entity_map": {
            "m.081k8": "William Shakespeare"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-278",
        "question": "what type of guitar does kirk hammett play",
        "comp_type": null,
        "answer": [
            "m.018vs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0489w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0489w ns:music.group_member.instruments_played ?x .\n?x ns:music.instrument.family ns:m.0342h .\n}\n",
        "sexpr": "(AND (JOIN music.instrument.family m.0342h) (JOIN (R music.group_member.instruments_played) m.0489w))",
        "normed_sexpr": "( AND ( JOIN [ music , instrument , family ] [ Guitar ] ) ( JOIN ( R [ music , group member , instruments played ] ) [ Kirk Hammett ] ) )",
        "gold_entity_map": {
            "m.0342h": "Guitar",
            "m.0489w": "Kirk Hammett"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played",
            "music.instrument.family": "music , instrument , family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-279",
        "question": "what language they speak in the philippines",
        "comp_type": null,
        "answer": [
            "m.01jb8r",
            "m.02h40lc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.05v8c)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Philippines ] )",
        "gold_entity_map": {
            "m.05v8c": "Philippines"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-280",
        "question": "where is the kakadu national park located",
        "comp_type": null,
        "answer": [
            "m.05ff6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0psgs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0psgs ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0psgs)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Kakadu National Park ] )",
        "gold_entity_map": {
            "m.0psgs": "Kakadu National Park"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-285",
        "question": "what timezone is colorado in right now",
        "comp_type": null,
        "answer": [
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01n4w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01n4w ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.01n4w)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Colorado ] )",
        "gold_entity_map": {
            "m.01n4w": "Colorado"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-287",
        "question": "what disease has jack osbourne got",
        "comp_type": null,
        "answer": [
            "m.0dcqh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02348n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02348n ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.02348n)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Jack Osbourne ] )",
        "gold_entity_map": {
            "m.02348n": "Jack Osbourne"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-290",
        "question": "what language they speak in taiwan",
        "comp_type": null,
        "answer": [
            "m.0653m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06f32)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06f32 ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.06f32)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Taiwan ] )",
        "gold_entity_map": {
            "m.06f32": "Taiwan"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-291",
        "question": "who owns the toronto maple leafs",
        "comp_type": null,
        "answer": [
            "m.06p05l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j6tr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j6tr ns:sports.professional_sports_team.owner_s ?x .\n}\n",
        "sexpr": "(JOIN (R sports.professional_sports_team.owner_s) m.0j6tr)",
        "normed_sexpr": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Toronto Maple Leafs ] )",
        "gold_entity_map": {
            "m.0j6tr": "Toronto Maple Leafs"
        },
        "gold_relation_map": {
            "sports.professional_sports_team.owner_s": "sports , professional sports team , owner s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-292",
        "question": "what county is novato california in",
        "comp_type": null,
        "answer": [
            "m.0l2hf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r1hb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r1hb ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0r1hb)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Novato ] )",
        "gold_entity_map": {
            "m.0r1hb": "Novato"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-293",
        "question": "what are the basic beliefs of sikhism",
        "comp_type": null,
        "answer": [
            "m.017kx3",
            "m.02fbl",
            "m.049hc",
            "m.04xy3",
            "m.06fmt",
            "m.0c576t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06yyp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06yyp ns:religion.religion.beliefs ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.beliefs) m.06yyp)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , beliefs ] ) [ Sikhism ] )",
        "gold_entity_map": {
            "m.06yyp": "Sikhism"
        },
        "gold_relation_map": {
            "religion.religion.beliefs": "religion , religion , beliefs"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-294",
        "question": "where did hernando cortez die",
        "comp_type": null,
        "answer": [
            "m.08hf27"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03m_h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03m_h ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.03m_h)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Hernán Cortés ] )",
        "gold_entity_map": {
            "m.03m_h": "Hernán Cortés"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-296",
        "question": "where was the ancient region of mesopotamia",
        "comp_type": null,
        "answer": [
            "m.04wsz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0524v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0524v ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0524v)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Mesopotamia ] )",
        "gold_entity_map": {
            "m.0524v": "Mesopotamia"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-301",
        "question": "which city held the summer olympics twice",
        "comp_type": null,
        "answer": [
            "m.030qb3t",
            "m.05qtj"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?city \nWHERE {\n  ns:m.06vvk ns:time.recurring_event.instances ?y . # Summer Olympic Games\n  ?y ns:olympics.olympic_games.host_city ?city .\n}\nGROUP BY ?city\nHaving COUNT(?city) = 2",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.06vvk": "Summer Olympic Games"
        },
        "gold_relation_map": {
            "olympics.olympic_games.host_city": "olympics , olympic games , host city",
            "time.recurring_event.instances": "time , recurring event , instances"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-302",
        "question": "who are the green bay packers owned by",
        "comp_type": null,
        "answer": [
            "m.0c24nj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03b3j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03b3j ns:sports.professional_sports_team.owner_s ?x .\n}\n",
        "sexpr": "(JOIN (R sports.professional_sports_team.owner_s) m.03b3j)",
        "normed_sexpr": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Green Bay Packers ] )",
        "gold_entity_map": {
            "m.03b3j": "Green Bay Packers"
        },
        "gold_relation_map": {
            "sports.professional_sports_team.owner_s": "sports , professional sports team , owner s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-303",
        "question": "what inspired langston hughes to write poetry",
        "comp_type": null,
        "answer": [
            "m.085gk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv62 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.0bv62)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Langston Hughes ] )",
        "gold_entity_map": {
            "m.0bv62": "Langston Hughes"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-307",
        "question": "where did henry knox die",
        "comp_type": null,
        "answer": [
            "m.03897b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hx16)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hx16 ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.01hx16)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Henry Knox ] )",
        "gold_entity_map": {
            "m.01hx16": "Henry Knox"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-312",
        "question": "what language do they speak in northern ireland",
        "comp_type": null,
        "answer": [
            "m.0165vf",
            "m.02h40lc",
            "m.03x42"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bcl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bcl ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.05bcl)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Northern Ireland ] )",
        "gold_entity_map": {
            "m.05bcl": "Northern Ireland"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-313",
        "question": "what countries make up continental europe",
        "comp_type": null,
        "answer": [
            "m.0154j",
            "m.015qh",
            "m.0163v",
            "m.0166b",
            "m.01mjq",
            "m.01pj7",
            "m.02kmm",
            "m.02vzc",
            "m.0345h",
            "m.035qy",
            "m.03gj2",
            "m.03rj0",
            "m.03rjj",
            "m.03rt9",
            "m.04fh3",
            "m.04g5k",
            "m.04g61",
            "m.04gzd",
            "m.04j53",
            "m.04v3q",
            "m.04w4s",
            "m.04w58",
            "m.056vv",
            "m.059j2",
            "m.05b4w",
            "m.05qhw",
            "m.05r4w",
            "m.06bnz",
            "m.06c1y",
            "m.06mkj",
            "m.06mzp",
            "m.06npd",
            "m.06sff",
            "m.06t8v",
            "m.077qn",
            "m.07ssc",
            "m.07t21",
            "m.07ytt",
            "m.0bjv6",
            "m.0d0kn",
            "m.0d0vqn",
            "m.0h7x",
            "m.0hg5",
            "m.0jdx",
            "m.0jgx",
            "m.0k6nt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02j9z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02j9z ns:base.locations.continents.countries_within ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.continents.countries_within) m.02j9z)",
        "normed_sexpr": "( JOIN ( R [ base , locations , continents , countries within ] ) [ Europe ] )",
        "gold_entity_map": {
            "m.02j9z": "Europe"
        },
        "gold_relation_map": {
            "base.locations.continents.countries_within": "base , locations , continents , countries within"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-314",
        "question": "what do abrahamic religions have in common",
        "comp_type": null,
        "answer": [
            "m.01zky",
            "m.04xy3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f_h6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f_h6 ns:religion.religion.practices ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.practices) m.0f_h6)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , practices ] ) [ Abrahamic religions ] )",
        "gold_entity_map": {
            "m.0f_h6": "Abrahamic religions"
        },
        "gold_relation_map": {
            "religion.religion.practices": "religion , religion , practices"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-315",
        "question": "what did johnny crawford sing",
        "comp_type": null,
        "answer": [
            "m.010f1rn",
            "m.010f1rw",
            "m.010f1s2",
            "m.010f1s9",
            "m.010f1sj",
            "m.010f1sr",
            "m.010f1sz",
            "m.010f1t5",
            "m.010f1td",
            "m.010f1tm",
            "m.010f1tv",
            "m.010f1v1",
            "m.010f1v8",
            "m.010f1vh",
            "m.010f1vq",
            "m.01f3d9r",
            "m.0x1mxp4",
            "m.0x86_1",
            "m.0xc1_j",
            "m.0xv33_",
            "m.0xv333",
            "m.0xv33b",
            "m.0xv33k",
            "m.0xv33s",
            "m.0xv346",
            "m.0xv34f",
            "m.0xv34n",
            "m.0xv34w",
            "m.0xv352",
            "m.0xv359",
            "m.0xv35j",
            "m.0xv35r",
            "m.0xv35z",
            "m.0xv365",
            "m.0xv36d",
            "m.0xv36m",
            "m.0xv36v",
            "m.0xv371",
            "m.0xv378",
            "m.0xv37h",
            "m.0xv37q",
            "m.0xv37y",
            "m.0zc0l6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qmb2r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qmb2r ns:music.artist.track ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.track) m.01qmb2r)",
        "normed_sexpr": "( JOIN ( R [ music , artist , track ] ) [ Johnny Crawford ] )",
        "gold_entity_map": {
            "m.01qmb2r": "Johnny Crawford"
        },
        "gold_relation_map": {
            "music.artist.track": "music , artist , track"
        },
        "gold_type_map": {}
    }
]