[
    {
        "ID": "WebQTrn-2037",
        "question": "what was abe lincoln shot with",
        "comp_type": null,
        "answer": [
            "m.034qg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:user.alexander.misc.murdered_person.murder_method ?x .\n}\n",
        "sexpr": "(JOIN (R user.alexander.misc.murdered_person.murder_method) m.0gzh)",
        "normed_sexpr": "( JOIN ( R [ user , alexander , misc , murdered person , murder method ] ) [ Abraham Lincoln ] )",
        "gold_entity_map": {
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "user.alexander.misc.murdered_person.murder_method": "user , alexander , misc , murdered person , murder method"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2038",
        "question": "what did regina hall play in",
        "comp_type": null,
        "answer": [
            "g.11b6yz_c00",
            "m.012w4c6m",
            "m.0131l157",
            "m.01370796",
            "m.01pj_5",
            "m.02mc5v",
            "m.02q_76b",
            "m.03l6q0",
            "m.05h4_qt",
            "m.05szbg",
            "m.05wsc1",
            "m.06f18v",
            "m.07h9gp",
            "m.07nt4j",
            "m.07yjndt",
            "m.08487v",
            "m.088s3s",
            "m.08wy_6",
            "m.0b2f_2",
            "m.0c9pvq",
            "m.0cc7ysm",
            "m.0crt711",
            "m.0dmh6y",
            "m.0gwf191",
            "m.0gz6__n",
            "m.0h944f1",
            "m.0mzxvjs",
            "m.0t_dn7n",
            "m.0w1df97"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.072z_t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.072z_t ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.072z_t))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Regina Hall ] ) )",
        "gold_entity_map": {
            "m.072z_t": "Regina Hall"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2041",
        "question": "what book did jacob riis wrote",
        "comp_type": null,
        "answer": [
            "m.0bqr25v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jll4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jll4 ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.0jll4)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Jacob Riis ] )",
        "gold_entity_map": {
            "m.0jll4": "Jacob Riis"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2042",
        "question": "what airport is close to scottsdale arizona",
        "comp_type": null,
        "answer": [
            "m.054v10"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qpqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qpqn ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.0qpqn)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Scottsdale ] )",
        "gold_entity_map": {
            "m.0qpqn": "Scottsdale"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2043",
        "question": "who plays noah bennet",
        "comp_type": null,
        "answer": [
            "m.0bf_xc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026cx1z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026cx1z ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.026cx1z))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Noah Bennet ] ) )",
        "gold_entity_map": {
            "m.026cx1z": "Noah Bennet"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2045",
        "question": "who won american idol 2006 season 5",
        "comp_type": null,
        "answer": [
            "m.0bhslx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09zcyj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09zcyj ns:award.competition.winner ?x .\n}\n",
        "sexpr": "(JOIN (R award.competition.winner) m.09zcyj)",
        "normed_sexpr": "( JOIN ( R [ award , competition , winner ] ) [ American Idol - Season 5 ] )",
        "gold_entity_map": {
            "m.09zcyj": "American Idol - Season 5"
        },
        "gold_relation_map": {
            "award.competition.winner": "award , competition , winner"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2047",
        "question": "where do the chicago cubs play",
        "comp_type": null,
        "answer": [
            "m.066by2",
            "m.0b0sh",
            "m.0h975w3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yjl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yjl ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.01yjl)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Chicago Cubs ] )",
        "gold_entity_map": {
            "m.01yjl": "Chicago Cubs"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2048",
        "question": "where did reagan die",
        "comp_type": null,
        "answer": [
            "m.026z1h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.06c0j)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Ronald Reagan ] )",
        "gold_entity_map": {
            "m.06c0j": "Ronald Reagan"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2051",
        "question": "what was irving langmuir famous for",
        "comp_type": null,
        "answer": [
            "m.06q2q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03yzb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03yzb ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03yzb)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Irving Langmuir ] )",
        "gold_entity_map": {
            "m.03yzb": "Irving Langmuir"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2056",
        "question": "what was the name of martin luther king jr parents",
        "comp_type": null,
        "answer": [
            "m.04_wtm",
            "m.04z9mm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.051cc)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Martin Luther King, Jr. ] )",
        "gold_entity_map": {
            "m.051cc": "Martin Luther King, Jr."
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2057",
        "question": "what money does guatemala use",
        "comp_type": null,
        "answer": [
            "m.01crby"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345_ ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0345_)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Guatemala ] )",
        "gold_entity_map": {
            "m.0345_": "Guatemala"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2058",
        "question": "who was president when nelson rockefeller was vice president",
        "comp_type": null,
        "answer": [
            "m.0c_md_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jd_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jd_ ns:government.us_vice_president.to_president ?x .\n}\n",
        "sexpr": "(JOIN (R government.us_vice_president.to_president) m.05jd_)",
        "normed_sexpr": "( JOIN ( R [ government , us vice president , to president ] ) [ Nelson Rockefeller ] )",
        "gold_entity_map": {
            "m.05jd_": "Nelson Rockefeller"
        },
        "gold_relation_map": {
            "government.us_vice_president.to_president": "government , us vice president , to president"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2064",
        "question": "where is shakira from originally",
        "comp_type": null,
        "answer": [
            "m.02b84b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wj18h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wj18h ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01wj18h)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Shakira ] )",
        "gold_entity_map": {
            "m.01wj18h": "Shakira"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2066",
        "question": "where was the gettysburg war located",
        "comp_type": null,
        "answer": [
            "m.05tbn",
            "m.0dzs0",
            "m.0frlr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jnm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jnm ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.01jnm)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of Gettysburg ] )",
        "gold_entity_map": {
            "m.01jnm": "Battle of Gettysburg"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2067",
        "question": "what do people go to amsterdam for",
        "comp_type": null,
        "answer": [
            "m.01l09n",
            "m.027x7w2",
            "m.02k1t8",
            "m.02qb667",
            "m.02s5hd",
            "m.04q1_nn",
            "m.05_9vk",
            "m.052sj2j",
            "m.052sj30",
            "m.052sj3l",
            "m.06_fvr",
            "m.06jsf",
            "m.06s5rp",
            "m.06w7d4n",
            "m.0730kf",
            "m.080q85l",
            "m.0c27s0",
            "m.0ctd_z",
            "m.0d222g",
            "m.0dgsr2n",
            "m.0j2hz0_",
            "m.0j2jlz0",
            "m.0p8jv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k3p ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0k3p)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Amsterdam ] )",
        "gold_entity_map": {
            "m.0k3p": "Amsterdam"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2069",
        "question": "what language chile speak",
        "comp_type": null,
        "answer": [
            "m.01y5tq",
            "m.01zn1j",
            "m.0565hv",
            "m.06nm1",
            "m.09_sxt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p1v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p1v ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.01p1v)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Chile ] )",
        "gold_entity_map": {
            "m.01p1v": "Chile"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2074",
        "question": "what team did john madden play football for",
        "comp_type": null,
        "answer": [
            "m.05tg3",
            "m.06ztt6z",
            "m.0fbq2n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0frmb1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0frmb1 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.0frmb1))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ John Madden ] ) )",
        "gold_entity_map": {
            "m.0frmb1": "John Madden"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2075",
        "question": "what does julian clary do",
        "comp_type": null,
        "answer": [
            "m.015cjr",
            "m.018gz8",
            "m.02hrh1q",
            "m.02xhgwq",
            "m.0dxtg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_rph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_rph ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01_rph)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Julian Clary ] )",
        "gold_entity_map": {
            "m.01_rph": "Julian Clary"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2076",
        "question": "where does the potomac river flow into",
        "comp_type": null,
        "answer": [
            "m.0g66h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g52g ns:geography.river.mouth ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.mouth) m.0g52g)",
        "normed_sexpr": "( JOIN ( R [ geography , river , mouth ] ) [ Potomac River ] )",
        "gold_entity_map": {
            "m.0g52g": "Potomac River"
        },
        "gold_relation_map": {
            "geography.river.mouth": "geography , river , mouth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2078",
        "question": "when does the world cup occur",
        "comp_type": null,
        "answer": [
            "m.02sjt6q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.030q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.030q7 ns:time.recurring_event.current_frequency ?x .\n}\n",
        "sexpr": "(JOIN (R time.recurring_event.current_frequency) m.030q7)",
        "normed_sexpr": "( JOIN ( R [ time , recurring event , current frequency ] ) [ FIFA World Cup ] )",
        "gold_entity_map": {
            "m.030q7": "FIFA World Cup"
        },
        "gold_relation_map": {
            "time.recurring_event.current_frequency": "time , recurring event , current frequency"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2079",
        "question": "what years the steelers won the super bowl",
        "comp_type": null,
        "answer": [
            "m.0_gt_jy",
            "m.0_gt_lv",
            "m.0_gt_my",
            "m.032tn6",
            "m.04n7r5",
            "m.076p2",
            "m.076pf",
            "m.076qg",
            "m.076qt",
            "m.0hzps_h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.05tfm)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Pittsburgh Steelers ] )",
        "gold_entity_map": {
            "m.05tfm": "Pittsburgh Steelers"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2081",
        "question": "where does danish language come from",
        "comp_type": null,
        "answer": [
            "m.0140kd",
            "m.03489",
            "m.03v09"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0295r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0295r ns:language.human_language.language_family ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.language_family) m.0295r)",
        "normed_sexpr": "( JOIN ( R [ language , human language , language family ] ) [ Danish Language ] )",
        "gold_entity_map": {
            "m.0295r": "Danish Language"
        },
        "gold_relation_map": {
            "language.human_language.language_family": "language , human language , language family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2082",
        "question": "what countries are in the baltic region",
        "comp_type": null,
        "answer": [
            "m.021hqs",
            "m.0247nt",
            "m.0pyvq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xrc5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xrc5 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.01xrc5))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Baltic region ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.01xrc5": "Baltic region"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-2084",
        "question": "what time is in london heathrow",
        "comp_type": null,
        "answer": [
            "m.03bdv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jn4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jn4 ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.03jn4)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ London Heathrow Airport ] )",
        "gold_entity_map": {
            "m.03jn4": "London Heathrow Airport"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2086",
        "question": "what continent does the amazon river flow through",
        "comp_type": null,
        "answer": [
            "m.06n3y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sd7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sd7 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mh) (JOIN (R location.location.containedby) m.0sd7))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Amazon River ] ) )",
        "gold_entity_map": {
            "m.0sd7": "Amazon River",
            "m.01mh": "Continent"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mh": "Continent"
        }
    },
    {
        "ID": "WebQTrn-2088",
        "question": "who played elle greenaway",
        "comp_type": null,
        "answer": [
            "m.09x9q2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09g8nbm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09g8nbm ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.09g8nbm))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Elle Greenaway ] ) )",
        "gold_entity_map": {
            "m.09g8nbm": "Elle Greenaway"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2092",
        "question": "what did captain scott die of",
        "comp_type": null,
        "answer": [
            "m.01flyj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06dlh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06dlh ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.06dlh)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Robert Falcon Scott ] )",
        "gold_entity_map": {
            "m.06dlh": "Robert Falcon Scott"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2094",
        "question": "what city did elvis presley grew up in",
        "comp_type": null,
        "answer": [
            "m.0wqwj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02jq1)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Elvis Presley ] )",
        "gold_entity_map": {
            "m.02jq1": "Elvis Presley"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2095",
        "question": "what continent is belize located in",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0164b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0164b ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0164b)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Belize ] )",
        "gold_entity_map": {
            "m.0164b": "Belize"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2097",
        "question": "what party was winston churchill in politics",
        "comp_type": null,
        "answer": [
            "m.01fml",
            "m.07wpm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.082xp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.082xp ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.082xp))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Winston Churchill ] ) )",
        "gold_entity_map": {
            "m.082xp": "Winston Churchill"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2099",
        "question": "who was philip randolph",
        "comp_type": null,
        "answer": [
            "m.04hx60",
            "m.05vd69b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lsst)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lsst ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01lsst)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Asa Philip Randolph ] )",
        "gold_entity_map": {
            "m.01lsst": "Asa Philip Randolph"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2103",
        "question": "what to see and do in san diego california",
        "comp_type": null,
        "answer": [
            "m.01094zpg",
            "m.01v05h",
            "m.02400r",
            "m.028bh_9",
            "m.02pt3vb",
            "m.033zn0",
            "m.03yncwm",
            "m.04c6gj",
            "m.04rfpv",
            "m.06qlyn",
            "m.096pq",
            "m.09f7hq",
            "m.0c8cjw",
            "m.0fnfb4",
            "m.0g4y9s",
            "m.0g72c",
            "m.0gyhsd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.071vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.071vr ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.071vr)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ San Diego ] )",
        "gold_entity_map": {
            "m.071vr": "San Diego"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2104",
        "question": "what is the zip code for clarksville tn",
        "comp_type": null,
        "answer": [
            "m.020w_kz",
            "m.03dxjrj",
            "m.03dxjry",
            "m.07nr01f",
            "m.07nr01n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_w5_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_w5_ ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0_w5_)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Clarksville ] )",
        "gold_entity_map": {
            "m.0_w5_": "Clarksville"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    }
]