[
    {
        "ID": "WebQTrn-1260",
        "question": "what city was robert kennedy killed in",
        "comp_type": null,
        "answer": [
            "m.030qb3t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06hx2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06hx2 ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.06hx2)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Robert F. Kennedy ] )",
        "gold_entity_map": {
            "m.06hx2": "Robert F. Kennedy"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1262",
        "question": "who plays the new michael myers",
        "comp_type": null,
        "answer": [
            "m.026833n",
            "m.02rr5hs",
            "m.03cqsk8",
            "m.06rhfg",
            "m.07kgxlq",
            "m.0bh7kk",
            "m.0ccvdt",
            "m.0d9zjs",
            "m.0fq13_2",
            "m.0gf652",
            "m.0z7zr76"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03zj8n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03zj8n ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.03zj8n))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ The Shape ] ) )",
        "gold_entity_map": {
            "m.03zj8n": "The Shape"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1263",
        "question": "who was killed first tupac or biggie",
        "comp_type": null,
        "answer": [
            "m.07pzc"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT ?x\nWHERE {\n  ?x ns:people.deceased_person.date_of_death ?d .\n  FILTER (?x = ns:m.07pzc OR ?x = ns:m.01vz0g4)\n}\nORDER BY ?d\nLIMIT 1",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01vz0g4": "The Notorious B.I.G.",
            "m.07pzc": "Tupac Shakur"
        },
        "gold_relation_map": {
            "people.deceased_person.date_of_death": "people , deceased person , date of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1266",
        "question": "what theme songs did alan thicke wrote",
        "comp_type": null,
        "answer": [
            "m.0_jvj26",
            "m.0_k73bx",
            "m.0g54xzv",
            "m.0n9cmjv",
            "m.0zl7d7s",
            "m.0zwh63k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wd48)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wd48 ns:music.composer.compositions ?x .\n}\n",
        "sexpr": "(JOIN (R music.composer.compositions) m.02wd48)",
        "normed_sexpr": "( JOIN ( R [ music , composer , compositions ] ) [ Alan Thicke ] )",
        "gold_entity_map": {
            "m.02wd48": "Alan Thicke"
        },
        "gold_relation_map": {
            "music.composer.compositions": "music , composer , compositions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1267",
        "question": "what films did patrick swayze star in",
        "comp_type": null,
        "answer": [
            "m.0_gr3lv",
            "m.01n910",
            "m.026z48m",
            "m.027c99q",
            "m.02fxx9",
            "m.02pj813",
            "m.02pm8zp",
            "m.02q_l_g",
            "m.02qsbk5",
            "m.032clf",
            "m.03cn85q",
            "m.03cv_vm",
            "m.03hmfjj",
            "m.03khj_",
            "m.03m4mm7",
            "m.03n7gj",
            "m.03tflm",
            "m.04j226s",
            "m.04j2jl7",
            "m.04jlvy4",
            "m.04xnct",
            "m.057jdv",
            "m.06bk1y",
            "m.07mp6m",
            "m.0818d7",
            "m.083gcx",
            "m.08bq1f",
            "m.08cjy8",
            "m.08xxwl",
            "m.0bfsdy",
            "m.0bz3r4",
            "m.0d9lb0",
            "m.0fvr1",
            "m.0gjs8p",
            "m.0j7l8cp",
            "m.0kv750",
            "m.0kvdhw",
            "m.0y_pg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h3tp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h3tp ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.02h3tp))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Patrick Swayze ] ) )",
        "gold_entity_map": {
            "m.02h3tp": "Patrick Swayze"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1268",
        "question": "where is sony headquarters",
        "comp_type": null,
        "answer": [
            "m.024bqj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q07)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q07 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.06q07))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Sony Corporation ] ) )",
        "gold_entity_map": {
            "m.06q07": "Sony Corporation"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1271",
        "question": "what type of music is tchaikovsky",
        "comp_type": null,
        "answer": [
            "m.021dvj",
            "m.05lls",
            "m.06q6jz",
            "m.0ggq0m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.063tn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.063tn ns:music.artist.genre ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.genre) m.063tn)",
        "normed_sexpr": "( JOIN ( R [ music , artist , genre ] ) [ Pyotr Ilyich Tchaikovsky ] )",
        "gold_entity_map": {
            "m.063tn": "Pyotr Ilyich Tchaikovsky"
        },
        "gold_relation_map": {
            "music.artist.genre": "music , artist , genre"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1272",
        "question": "when is wimbledon tennis tournament",
        "comp_type": null,
        "answer": [
            "2014-06-23"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x \nWHERE {\n  ns:m.0mmmt ns:time.recurring_event.instances ?y . # The Championships, Wimbledon\n  ?y ns:time.event.start_date ?x . \n}\nORDER BY DESC(?x)\nLIMIT 1",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0mmmt": "Wimbledon"
        },
        "gold_relation_map": {
            "time.recurring_event.instances": "time , recurring event , instances",
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1274",
        "question": "where did helen keller go to school",
        "comp_type": null,
        "answer": [
            "m.01h4dd",
            "m.01k7xz",
            "m.06b84v",
            "m.07tr9z",
            "m.0bydgq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.03ppx))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Helen Keller ] ) )",
        "gold_entity_map": {
            "m.03ppx": "Helen Keller"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1276",
        "question": "where is german an official language",
        "comp_type": null,
        "answer": [
            "m.012m_",
            "m.0154j",
            "m.01k6y1",
            "m.020g9r",
            "m.026wsdl",
            "m.02x6nmy",
            "m.0345h",
            "m.03b79",
            "m.03f2w",
            "m.03gk2",
            "m.04g61",
            "m.04j53",
            "m.059z0",
            "m.06mzp",
            "m.07kgrwt",
            "m.084n_",
            "m.08z6cq",
            "m.0cy11n",
            "m.0gk_bb2",
            "m.0h7x",
            "m.0nlf0"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ?x ns:location.country.official_language ns:m.04306rv\t. # German language\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.04306rv": "German Language"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1278",
        "question": "who did tupac shakur date",
        "comp_type": null,
        "answer": [
            "m.01j7z7",
            "m.06wpky",
            "m.0dnyp2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pzc ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n",
        "sexpr": "(JOIN (R base.popstra.dated.participant) (JOIN (R base.popstra.celebrity.dated) m.07pzc))",
        "normed_sexpr": "( JOIN ( R [ base , popstra , dated , participant ] ) ( JOIN ( R [ base , popstra , celebrity , dated ] ) [ Tupac Shakur ] ) )",
        "gold_entity_map": {
            "m.07pzc": "Tupac Shakur"
        },
        "gold_relation_map": {
            "base.popstra.dated.participant": "base , popstra , dated , participant",
            "base.popstra.celebrity.dated": "base , popstra , celebrity , dated"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1281",
        "question": "what did larry hagman die of",
        "comp_type": null,
        "answer": [
            "m.0369n2",
            "m.04psf",
            "m.0qcr0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vyv9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vyv9 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01vyv9)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Larry Hagman ] )",
        "gold_entity_map": {
            "m.01vyv9": "Larry Hagman"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1286",
        "question": "what show is jill wagner on",
        "comp_type": null,
        "answer": [
            "m.01qnwx",
            "m.047d4bz",
            "m.0c4htl",
            "m.0fphvnc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ch3s1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ch3s1 ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.0ch3s1))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Jill Wagner ] ) )",
        "gold_entity_map": {
            "m.0ch3s1": "Jill Wagner"
        },
        "gold_relation_map": {
            "tv.tv_actor.starring_roles": "tv , tv actor , starring roles",
            "tv.regular_tv_appearance.series": "tv , regular tv appearance , series"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1288",
        "question": "what currency does senegal use",
        "comp_type": null,
        "answer": [
            "m.025sw2q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06srk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06srk ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.06srk)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Senegal ] )",
        "gold_entity_map": {
            "m.06srk": "Senegal"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1290",
        "question": "what do ethnic russians look like",
        "comp_type": null,
        "answer": [
            "m.043_yvy",
            "m.0c54l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g6ff)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g6ff ns:people.ethnicity.included_in_group ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.included_in_group) m.0g6ff)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , included in group ] ) [ Russian ] )",
        "gold_entity_map": {
            "m.0g6ff": "Russian"
        },
        "gold_relation_map": {
            "people.ethnicity.included_in_group": "people , ethnicity , included in group"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1291",
        "question": "what places made up the western roman empire",
        "comp_type": null,
        "answer": [
            "m.05g2v",
            "m.0852h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jbz2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jbz2 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.02jbz2)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Western Roman Empire ] )",
        "gold_entity_map": {
            "m.02jbz2": "Western Roman Empire"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1293",
        "question": "what company did mitt romney run",
        "comp_type": null,
        "answer": [
            "m.05tl03"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0271_s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0271_s ns:business.board_member.leader_of ?y .\n?y ns:organization.leadership.organization ?x .\n}\n",
        "sexpr": "(JOIN (R organization.leadership.organization) (JOIN (R business.board_member.leader_of) m.0271_s))",
        "normed_sexpr": "( JOIN ( R [ organization , leadership , organization ] ) ( JOIN ( R [ business , board member , leader of ] ) [ Mitt Romney ] ) )",
        "gold_entity_map": {
            "m.0271_s": "Mitt Romney"
        },
        "gold_relation_map": {
            "organization.leadership.organization": "organization , leadership , organization",
            "business.board_member.leader_of": "business , board member , leader of"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1294",
        "question": "what is vito corleone real name",
        "comp_type": null,
        "answer": [
            "m.04__f",
            "m.06cgy",
            "m.0nj8kct"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05hp_9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05hp_9 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.05hp_9))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Vito Corleone ] ) )",
        "gold_entity_map": {
            "m.05hp_9": "Vito Corleone"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1297",
        "question": "where did justin bieber grew up",
        "comp_type": null,
        "answer": [
            "m.0b1t1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w2sn5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w2sn5 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.06w2sn5)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Justin Bieber ] )",
        "gold_entity_map": {
            "m.06w2sn5": "Justin Bieber"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1301",
        "question": "who drafted kevin garnett",
        "comp_type": null,
        "answer": [
            "m.0jmgb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lm0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lm0t ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.team) (JOIN (R sports.drafted_athlete.drafted) m.02lm0t))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , team ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Kevin Garnett ] ) )",
        "gold_entity_map": {
            "m.02lm0t": "Kevin Garnett"
        },
        "gold_relation_map": {
            "sports.sports_league_draft_pick.team": "sports , sports league draft pick , team",
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1302",
        "question": "what is zip code for chicago illinois",
        "comp_type": null,
        "answer": [
            "m.01_6p_k",
            "m.01_6p6k",
            "m.01_6p8l",
            "m.01_6p9s",
            "m.01_6pdj",
            "m.01_6pgd",
            "m.01_6ph7",
            "m.01_6pmb",
            "m.01_6pnb",
            "m.01_6pp5",
            "m.01_6ps8",
            "m.01_6pvy",
            "m.01_6pxw",
            "m.01_6q0k",
            "m.01_6q1q",
            "m.01_6q8p",
            "m.01_6q9q",
            "m.01_6qcm",
            "m.01_6qjr",
            "m.01_6qp4",
            "m.01_6qrp",
            "m.01_6qsj",
            "m.01_6qz6",
            "m.01_6r1z",
            "m.01_6r78",
            "m.01_6r82",
            "m.01_6rf1",
            "m.01_6rfw",
            "m.01_6s_6",
            "m.01_6s0l",
            "m.01_6smy",
            "m.01_6sws",
            "m.01_6t1b",
            "m.01_6t43",
            "m.01_6t4y",
            "m.01_6t5r",
            "m.01_6t95",
            "m.01_6tgy",
            "m.01_6v4j",
            "m.01_6v6w",
            "m.01_6y3n",
            "m.01_6zk1",
            "m.01_7140",
            "m.01_71cx",
            "m.01_72xz",
            "m.01_73_n",
            "m.01_75zb",
            "m.01_77qt",
            "m.01_77x6",
            "m.01_78lh",
            "m.01_78nm",
            "m.01_78wb",
            "m.01_795b",
            "m.01_7gfz",
            "m.03dpqpb",
            "m.03dpqrm",
            "m.065rklh",
            "m.07nqmf7",
            "m.07nqmfg",
            "m.07nqmfp",
            "m.07nqmfx",
            "m.07nqmg_",
            "m.07nqmg3",
            "m.07nqmgb",
            "m.07nqmgk",
            "m.07nqmgs",
            "m.07nqmh6",
            "m.07nqmhf",
            "m.07nqmhn",
            "m.07nqmhw",
            "m.07nqmj2",
            "m.07nqmj9",
            "m.07nqmjj",
            "m.07nqmjr",
            "m.07nqmjz",
            "m.07nqmk5",
            "m.07nqmkd",
            "m.07nqmkm",
            "m.07nqmkv",
            "m.07nqml1",
            "m.07nqml8",
            "m.07nqmlh",
            "m.07nqmlq",
            "m.07nqmly",
            "m.07nqms5",
            "m.09sh942",
            "m.0gs227r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.01_d4)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Chicago ] )",
        "gold_entity_map": {
            "m.01_d4": "Chicago"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1303",
        "question": "what is the name of book written by helen keller",
        "comp_type": null,
        "answer": [
            "m.01ct51",
            "m.05mms2v",
            "m.068vwb6",
            "m.06clt38",
            "m.06ct5x4",
            "m.06d40b6",
            "m.06gm4jn",
            "m.06jh36g",
            "m.06l8ytp",
            "m.06qbwkz",
            "m.06vdh41",
            "m.0c1t3s9",
            "m.0c1t3sh",
            "m.0c1t3sl",
            "m.0c1t3sp",
            "m.0d4wd9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:book.author.works_written ?x .\n?x ns:common.topic.notable_types ns:m.01xryvm .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01xryvm) (JOIN (R book.author.works_written) m.03ppx))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Book ] ) ( JOIN ( R [ book , author , works written ] ) [ Helen Keller ] ) )",
        "gold_entity_map": {
            "m.03ppx": "Helen Keller",
            "m.01xryvm": "Book"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {
            "m.01xryvm": "Book"
        }
    },
    {
        "ID": "WebQTrn-1308",
        "question": "what year did aaron rodgers get drafted",
        "comp_type": null,
        "answer": [
            "m.05vsb7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q06_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q06_ ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.04q06_))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Aaron Rodgers ] ) )",
        "gold_entity_map": {
            "m.04q06_": "Aaron Rodgers"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1316",
        "question": "where does the philadelphia union soccer team play",
        "comp_type": null,
        "answer": [
            "m.03clwrg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03mck3c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03mck3c ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.03mck3c)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Philadelphia Union ] )",
        "gold_entity_map": {
            "m.03mck3c": "Philadelphia Union"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1317",
        "question": "where is the portuguese language derived from",
        "comp_type": null,
        "answer": [
            "m.05tk9jx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05zjd ns:base.rosetta.languoid.parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.rosetta.languoid.parent) m.05zjd)",
        "normed_sexpr": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ Portuguese Language ] )",
        "gold_entity_map": {
            "m.05zjd": "Portuguese Language"
        },
        "gold_relation_map": {
            "base.rosetta.languoid.parent": "base , rosetta , languoid , parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1321",
        "question": "what city is the university of maryland university college in",
        "comp_type": null,
        "answer": [
            "m.01_kvkx",
            "m.04rrd",
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mw1g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mw1g ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.02mw1g)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ University of Maryland University College ] )",
        "gold_entity_map": {
            "m.02mw1g": "University of Maryland University College"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1323",
        "question": "where was joseph p kennedy born",
        "comp_type": null,
        "answer": [
            "m.01cx_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qlg1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qlg1 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01qlg1)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Joseph P. Kennedy, Sr. ] )",
        "gold_entity_map": {
            "m.01qlg1": "Joseph P. Kennedy, Sr."
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1338",
        "question": "what musical instruments did duke ellington play",
        "comp_type": null,
        "answer": [
            "m.05r5c",
            "m.06ch55"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdlj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdlj ns:music.group_member.instruments_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_member.instruments_played) m.0bdlj)",
        "normed_sexpr": "( JOIN ( R [ music , group member , instruments played ] ) [ Duke Ellington ] )",
        "gold_entity_map": {
            "m.0bdlj": "Duke Ellington"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1339",
        "question": "where is the bank of america pavilion",
        "comp_type": null,
        "answer": [
            "m.01cx_",
            "m.0k3l5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04790b8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04790b8 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.04790b8)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Blue Hills Bank Pavilion ] )",
        "gold_entity_map": {
            "m.04790b8": "Blue Hills Bank Pavilion"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    }
]