[
    {
        "ID": "WebQTrn-656",
        "question": "where is the university of west alabama located",
        "comp_type": null,
        "answer": [
            "m.09c7w0",
            "m.0gyh",
            "m.0qbzf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07c5fv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07c5fv ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.07c5fv)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ University of West Alabama ] )",
        "gold_entity_map": {
            "m.07c5fv": "University of West Alabama"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-657",
        "question": "what did kenny everett die off",
        "comp_type": null,
        "answer": [
            "m.0d19y2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01m0gh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01m0gh ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01m0gh)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Kenny Everett ] )",
        "gold_entity_map": {
            "m.01m0gh": "Kenny Everett"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-659",
        "question": "where does joey king live",
        "comp_type": null,
        "answer": [
            "m.030qb3t",
            "m.0cv3w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03yk4pb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03yk4pb ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.03yk4pb))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Joey King ] ) )",
        "gold_entity_map": {
            "m.03yk4pb": "Joey King"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-662",
        "question": "what was manchester united first name",
        "comp_type": null,
        "answer": [
            "m.05l1ffz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.050fh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.050fh ns:sports.sports_team.previously_known_as ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.previously_known_as) m.050fh)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , previously known as ] ) [ Manchester United F.C. ] )",
        "gold_entity_map": {
            "m.050fh": "Manchester United F.C."
        },
        "gold_relation_map": {
            "sports.sports_team.previously_known_as": "sports , sports team , previously known as"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-665",
        "question": "where did elvis presley started his career",
        "comp_type": null,
        "answer": [
            "m.0c_m3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jq1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jq1 ns:music.artist.origin ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.origin) m.02jq1)",
        "normed_sexpr": "( JOIN ( R [ music , artist , origin ] ) [ Elvis Presley ] )",
        "gold_entity_map": {
            "m.02jq1": "Elvis Presley"
        },
        "gold_relation_map": {
            "music.artist.origin": "music , artist , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-667",
        "question": "what jobs did harriet tubman have",
        "comp_type": null,
        "answer": [
            "m.0cbd2",
            "m.0j_7vl6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.098yd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.098yd ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.098yd)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Harriet Tubman ] )",
        "gold_entity_map": {
            "m.098yd": "Harriet Tubman"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-671",
        "question": "what does amanda seyfried play in",
        "comp_type": null,
        "answer": [
            "m.0_d7r_6",
            "m.0_ylqw8",
            "m.010bmn2w",
            "m.0114hb3m",
            "m.012n3_27",
            "m.0272_vz",
            "m.028b3px",
            "m.02xtxw",
            "m.03crpy6",
            "m.03nq_dr",
            "m.05b08zq",
            "m.05n3l7",
            "m.07l4yp8",
            "m.09v12js",
            "m.0bg8jm5",
            "m.0c241c_",
            "m.0cfhfz",
            "m.0crpgp",
            "m.0dr_xmk",
            "m.0gw8ngw",
            "m.0gwvbxv",
            "m.0gww77t",
            "m.0gy8df_",
            "m.0h51_mt",
            "m.0hhgh69",
            "m.0hn82bb",
            "m.0j2b8qf",
            "m.0s9l4cg",
            "m.0s9l50x",
            "m.0v13yby",
            "m.0vps74l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03zz8b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03zz8b ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.03zz8b))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Amanda Seyfried ] ) )",
        "gold_entity_map": {
            "m.03zz8b": "Amanda Seyfried"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-673",
        "question": "what is the jurisdiction of the us supreme court",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07sz1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07sz1 ns:law.court.jurisdiction ?x .\n}\n",
        "sexpr": "(JOIN (R law.court.jurisdiction) m.07sz1)",
        "normed_sexpr": "( JOIN ( R [ law , court , jurisdiction ] ) [ Supreme Court of the United States ] )",
        "gold_entity_map": {
            "m.07sz1": "Supreme Court of the United States"
        },
        "gold_relation_map": {
            "law.court.jurisdiction": "law , court , jurisdiction"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-677",
        "question": "what instrument does bela fleck play",
        "comp_type": null,
        "answer": [
            "m.018j2",
            "m.018vs",
            "m.03qjg",
            "m.06ncr",
            "m.0l14j_",
            "m.0l14md"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017f9r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017f9r ns:music.musical_group.member ?y .\n?y ns:music.group_membership.role ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.role) (JOIN (R music.musical_group.member) m.017f9r))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , role ] ) ( JOIN ( R [ music , musical group , member ] ) [ Béla Fleck and the Flecktones ] ) )",
        "gold_entity_map": {
            "m.017f9r": "Béla Fleck and the Flecktones"
        },
        "gold_relation_map": {
            "music.musical_group.member": "music , musical group , member",
            "music.group_membership.role": "music , group membership , role"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-678",
        "question": "what position does ray allen",
        "comp_type": null,
        "answer": [
            "m.03558l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03lh3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03lh3v ns:basketball.basketball_player.position_s ?x .\n}\n",
        "sexpr": "(JOIN (R basketball.basketball_player.position_s) m.03lh3v)",
        "normed_sexpr": "( JOIN ( R [ basketball , basketball player , position s ] ) [ Ray Allen ] )",
        "gold_entity_map": {
            "m.03lh3v": "Ray Allen"
        },
        "gold_relation_map": {
            "basketball.basketball_player.position_s": "basketball , basketball player , position s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-679",
        "question": "what branch is made up of the house of representatives",
        "comp_type": null,
        "answer": [
            "m.07t31"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b3wk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b3wk ns:government.governmental_body.body_this_is_a_component_of ?x .\n}\n",
        "sexpr": "(JOIN (R government.governmental_body.body_this_is_a_component_of) m.0b3wk)",
        "normed_sexpr": "( JOIN ( R [ government , governmental body , body this is a component of ] ) [ United States House of Representatives ] )",
        "gold_entity_map": {
            "m.0b3wk": "United States House of Representatives"
        },
        "gold_relation_map": {
            "government.governmental_body.body_this_is_a_component_of": "government , governmental body , body this is a component of"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-681",
        "question": "where did chancellorsville battle take place",
        "comp_type": null,
        "answer": [
            "m.07z1m",
            "m.0mn1p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d0mw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d0mw ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0d0mw)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of Chancellorsville ] )",
        "gold_entity_map": {
            "m.0d0mw": "Battle of Chancellorsville"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-685",
        "question": "who was king or queen after victoria",
        "comp_type": null,
        "answer": [
            "m.0cm03"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cw10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cw10 ns:people.person.children ?x .\n?x ns:common.topic.notable_types ns:m.04fnrhx .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.04fnrhx) (JOIN (R people.person.children) m.0cw10))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Monarch ] ) ( JOIN ( R [ people , person , children ] ) [ Queen Victoria ] ) )",
        "gold_entity_map": {
            "m.04fnrhx": "Monarch",
            "m.0cw10": "Queen Victoria"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {
            "m.04fnrhx": "Monarch"
        }
    },
    {
        "ID": "WebQTrn-686",
        "question": "what movie did rihanna play in",
        "comp_type": null,
        "answer": [
            "m.0bh8tgs",
            "m.0hz4j2j",
            "m.0mwfph8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06mt91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06mt91 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.06mt91))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Rihanna ] ) )",
        "gold_entity_map": {
            "m.06mt91": "Rihanna"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-688",
        "question": "what religion was mary todd lincoln",
        "comp_type": null,
        "answer": [
            "m.019cr",
            "m.0631_",
            "m.0c8wxp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ypl0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ypl0 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.01ypl0)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Mary Todd Lincoln ] )",
        "gold_entity_map": {
            "m.01ypl0": "Mary Todd Lincoln"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-690",
        "question": "who all has jason kidd played for",
        "comp_type": null,
        "answer": [
            "m.0jm3b",
            "m.0jm3v",
            "m.0jmcv",
            "m.0jml5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cg2v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cg2v ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.02cg2v))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Jason Kidd ] ) )",
        "gold_entity_map": {
            "m.02cg2v": "Jason Kidd"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-691",
        "question": "where is headquarters of verizon",
        "comp_type": null,
        "answer": [
            "m.02_286"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_dn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_dn ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.07_dn))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Verizon Communications ] ) )",
        "gold_entity_map": {
            "m.07_dn": "Verizon Communications"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-692",
        "question": "where is the country of cyprus located",
        "comp_type": null,
        "answer": [
            "m.02qkt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ppq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ppq ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.01ppq)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Cyprus ] )",
        "gold_entity_map": {
            "m.01ppq": "Cyprus"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-693",
        "question": "who invented dell computer",
        "comp_type": null,
        "answer": [
            "m.013q3z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0py9b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0py9b ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.0py9b)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Dell ] )",
        "gold_entity_map": {
            "m.0py9b": "Dell"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-694",
        "question": "where did morgan freeman come from",
        "comp_type": null,
        "answer": [
            "m.0c_m3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055c8 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.055c8)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Morgan Freeman ] )",
        "gold_entity_map": {
            "m.055c8": "Morgan Freeman"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-695",
        "question": "where did bob barker grow up",
        "comp_type": null,
        "answer": [
            "m.010th_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ydhd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ydhd ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01ydhd)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Bob Barker ] )",
        "gold_entity_map": {
            "m.01ydhd": "Bob Barker"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-696",
        "question": "what are king charles spaniels",
        "comp_type": null,
        "answer": [
            "m.0bt9lr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nmst)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nmst ns:biology.animal_breed.breed_of ?x .\n}\n",
        "sexpr": "(JOIN (R biology.animal_breed.breed_of) m.04nmst)",
        "normed_sexpr": "( JOIN ( R [ biology , animal breed , breed of ] ) [ King Charles Spaniel ] )",
        "gold_entity_map": {
            "m.04nmst": "King Charles Spaniel"
        },
        "gold_relation_map": {
            "biology.animal_breed.breed_of": "biology , animal breed , breed of"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-701",
        "question": "what year did the new york mets start",
        "comp_type": null,
        "answer": [
            "1962"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g76)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g76 ns:sports.sports_team.founded ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.founded) m.05g76)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , founded ] ) [ New York Mets ] )",
        "gold_entity_map": {
            "m.05g76": "New York Mets"
        },
        "gold_relation_map": {
            "sports.sports_team.founded": "sports , sports team , founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-702",
        "question": "where did neil gaiman grow up",
        "comp_type": null,
        "answer": [
            "m.022mpz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jm7 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.05jm7)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Neil Gaiman ] )",
        "gold_entity_map": {
            "m.05jm7": "Neil Gaiman"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-703",
        "question": "what books did aristotle wrote",
        "comp_type": null,
        "answer": [
            "m.059c9_l",
            "m.059cb02",
            "m.059cb0l",
            "m.059cb12",
            "m.059cb1l",
            "m.059cb22",
            "m.059cb2m",
            "m.059cb33",
            "m.059cb45",
            "m.059cb4g",
            "m.059cb4r",
            "m.059cb51",
            "m.059cb5d",
            "m.059cb6h",
            "m.059cb6z",
            "m.059cb7f",
            "m.059cb7w",
            "m.059cb8b",
            "m.059cb8s",
            "m.059cb96",
            "m.059cb9n",
            "m.059cbb2",
            "m.059cbbl",
            "m.059cbc0",
            "m.059cbch",
            "m.059cbcs",
            "m.059cbd2",
            "m.059cbdd",
            "m.059cbdq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gz_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gz_ ns:book.author.book_editions_published ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.book_editions_published) m.0gz_)",
        "normed_sexpr": "( JOIN ( R [ book , author , book editions published ] ) [ Aristotle ] )",
        "gold_entity_map": {
            "m.0gz_": "Aristotle"
        },
        "gold_relation_map": {
            "book.author.book_editions_published": "book , author , book editions published"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-704",
        "question": "where is eu headquarters located",
        "comp_type": null,
        "answer": [
            "m.02rnbv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0_6t_z8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0_6t_z8 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.0_6t_z8))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ European Union ] ) )",
        "gold_entity_map": {
            "m.0_6t_z8": "European Union"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-705",
        "question": "who runs the cornelia marie now",
        "comp_type": null,
        "answer": [
            "m.0j2sdt9",
            "m.0j2sdtm",
            "m.0j2sdty"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qn24x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qn24x ns:boats.ship.owners ?y .\n?y ns:boats.ship_ownership.owner ?x .\n}\n",
        "sexpr": "(JOIN (R boats.ship_ownership.owner) (JOIN (R boats.ship.owners) m.02qn24x))",
        "normed_sexpr": "( JOIN ( R [ boats , ship ownership , owner ] ) ( JOIN ( R [ boats , ship , owners ] ) [ FV Cornelia Marie ] ) )",
        "gold_entity_map": {
            "m.02qn24x": "FV Cornelia Marie"
        },
        "gold_relation_map": {
            "boats.ship_ownership.owner": "boats , ship ownership , owner",
            "boats.ship.owners": "boats , ship , owners"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-706",
        "question": "where did john muir die",
        "comp_type": null,
        "answer": [
            "m.030qb3t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fhry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fhry ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.01fhry)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ John Muir ] )",
        "gold_entity_map": {
            "m.01fhry": "John Muir"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-708",
        "question": "what countries are in the andean region",
        "comp_type": null,
        "answer": [
            "m.0165v",
            "m.016wzw",
            "m.01ls2",
            "m.01p1v",
            "m.02k1b",
            "m.07ylj",
            "m.0jgd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0p2n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0p2n ns:location.location.partially_containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.partially_containedby) m.0p2n))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , partially containedby ] ) [ Andes ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.0p2n": "Andes"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.partially_containedby": "location , location , partially containedby"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-713",
        "question": "what country was george washington from",
        "comp_type": null,
        "answer": [
            "m.02p89zz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.034rd)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ George Washington ] )",
        "gold_entity_map": {
            "m.034rd": "George Washington"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-714",
        "question": "what year did pete rose play",
        "comp_type": null,
        "answer": [
            "m.027pwzc",
            "m.02h7s1h",
            "m.02h7s1n",
            "m.02h7s1t",
            "m.02h7s28",
            "m.02h7s2f",
            "m.02h7s31",
            "m.02h7s36",
            "m.02h7s3j",
            "m.02h7s3p",
            "m.02h7s4s",
            "m.02h7s52",
            "m.02h7s5k",
            "m.02h7s5q",
            "m.02h7s6b",
            "m.02h7s78",
            "m.02h7s7r",
            "m.02h7s81",
            "m.02h7s8c",
            "m.02h7s9g",
            "m.02h7sbd",
            "m.02h7sbq",
            "m.02h7sd3",
            "m.05kcgsf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dxg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dxg6 ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.season ?x .\n}\n",
        "sexpr": "(JOIN (R baseball.batting_statistics.season) (JOIN (R baseball.baseball_player.batting_stats) m.0dxg6))",
        "normed_sexpr": "( JOIN ( R [ baseball , batting statistics , season ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Pete Rose ] ) )",
        "gold_entity_map": {
            "m.0dxg6": "Pete Rose"
        },
        "gold_relation_map": {
            "baseball.batting_statistics.season": "baseball , batting statistics , season",
            "baseball.baseball_player.batting_stats": "baseball , baseball player , batting stats"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-715",
        "question": "where does kyla ross live",
        "comp_type": null,
        "answer": [
            "m.0r29m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09glsjp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09glsjp ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.09glsjp))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Kyla Ross ] ) )",
        "gold_entity_map": {
            "m.09glsjp": "Kyla Ross"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    }
]