[
    {
        "ID": "WebQTrn-2940",
        "question": "where does the jordan river end",
        "comp_type": null,
        "answer": [
            "m.02cnp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvy5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvy5 ns:geography.river.mouth ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.mouth) m.0cvy5)",
        "normed_sexpr": "( JOIN ( R [ geography , river , mouth ] ) [ Jordan River ] )",
        "gold_entity_map": {
            "m.0cvy5": "Jordan River"
        },
        "gold_relation_map": {
            "geography.river.mouth": "geography , river , mouth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2942",
        "question": "what school did michael jackson attend",
        "comp_type": null,
        "answer": [
            "m.06lhpy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.09889g))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Michael Jackson ] ) )",
        "gold_entity_map": {
            "m.09889g": "Michael Jackson"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2943",
        "question": "what does kenya moore do for a living",
        "comp_type": null,
        "answer": [
            "m.01d_h8",
            "m.02hrh1q",
            "m.0d1pc",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08cpnf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08cpnf ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.08cpnf)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Kenya Moore ] )",
        "gold_entity_map": {
            "m.08cpnf": "Kenya Moore"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2944",
        "question": "what country is barack obama from",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.02mjmr)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Barack Obama ] )",
        "gold_entity_map": {
            "m.02mjmr": "Barack Obama"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2945",
        "question": "who was wale signed to",
        "comp_type": null,
        "answer": [
            "m.01trtc",
            "m.03rhqg",
            "m.05zsdjw",
            "m.073tm9",
            "m.0892fn",
            "m.0dgnk3v",
            "m.0g768"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049fb8r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049fb8r ns:music.artist.label ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.label) m.049fb8r)",
        "normed_sexpr": "( JOIN ( R [ music , artist , label ] ) [ Wale ] )",
        "gold_entity_map": {
            "m.049fb8r": "Wale"
        },
        "gold_relation_map": {
            "music.artist.label": "music , artist , label"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2946",
        "question": "who did tyson chandler play for",
        "comp_type": null,
        "answer": [
            "m.0jm3v",
            "m.0jmcv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05j8c8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05j8c8 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.05j8c8))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Tyson Chandler ] ) )",
        "gold_entity_map": {
            "m.05j8c8": "Tyson Chandler"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2948",
        "question": "who played princess leia in star wars movies",
        "comp_type": null,
        "answer": [
            "m.01tnbn",
            "m.01wm357"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ddqw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ddqw ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0ddqw))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Leia Organa ] ) )",
        "gold_entity_map": {
            "m.0ddqw": "Leia Organa"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2951",
        "question": "where was saint joseph from",
        "comp_type": null,
        "answer": [
            "m.01cy_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c08y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c08y ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0c08y)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Saint Joseph ] )",
        "gold_entity_map": {
            "m.0c08y": "Saint Joseph"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2954",
        "question": "what job did george w bush have",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.01qdsm",
            "m.02hrh1q",
            "m.0fj9f",
            "m.0hltv",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b6zr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b6zr ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.09b6zr)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ George W. Bush ] )",
        "gold_entity_map": {
            "m.09b6zr": "George W. Bush"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2955",
        "question": "what are countries in south asia",
        "comp_type": null,
        "answer": [
            "m.0162b",
            "m.0168b",
            "m.016zwt",
            "m.02hjn",
            "m.03rk0",
            "m.04ty8",
            "m.06m_5",
            "m.07bxhl",
            "m.0bq0p9",
            "m.0dbpy",
            "m.0jdd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06nn1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06nn1 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.06nn1))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ South Asia ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.06nn1": "South Asia"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-2956",
        "question": "where is the caribbean geographically located",
        "comp_type": null,
        "answer": [
            "m.02613",
            "m.059g4",
            "m.07c5l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261m ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0261m)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Caribbean ] )",
        "gold_entity_map": {
            "m.0261m": "Caribbean"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2959",
        "question": "what was howard carter 's job",
        "comp_type": null,
        "answer": [
            "m.02h6pd1",
            "m.02kx6lf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jvx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jvx ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03jvx)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Howard Carter ] )",
        "gold_entity_map": {
            "m.03jvx": "Howard Carter"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2961",
        "question": "what was the cause of death of michael jackson",
        "comp_type": null,
        "answer": [
            "m.0gg4h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.09889g)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Michael Jackson ] )",
        "gold_entity_map": {
            "m.09889g": "Michael Jackson"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2963",
        "question": "what is the capital city of texas usa",
        "comp_type": null,
        "answer": [
            "m.0vzm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07b_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07b_l ns:location.us_state.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.us_state.capital) m.07b_l)",
        "normed_sexpr": "( JOIN ( R [ location , us state , capital ] ) [ Texas ] )",
        "gold_entity_map": {
            "m.07b_l": "Texas"
        },
        "gold_relation_map": {
            "location.us_state.capital": "location , us state , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2968",
        "question": "what time zone is new england usa in",
        "comp_type": null,
        "answer": [
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.029jpy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.029jpy ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.029jpy)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ New England ] )",
        "gold_entity_map": {
            "m.029jpy": "New England"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2970",
        "question": "what is tulane university 's mascot",
        "comp_type": null,
        "answer": [
            "m.05g1yr7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160nk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160nk ns:education.educational_institution.mascot ?x .\n}\n",
        "sexpr": "(JOIN (R education.educational_institution.mascot) m.0160nk)",
        "normed_sexpr": "( JOIN ( R [ education , educational institution , mascot ] ) [ Tulane University ] )",
        "gold_entity_map": {
            "m.0160nk": "Tulane University"
        },
        "gold_relation_map": {
            "education.educational_institution.mascot": "education , educational institution , mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2971",
        "question": "where is aviano air force base located",
        "comp_type": null,
        "answer": [
            "m.03rjj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05l8fk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05l8fk ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.05l8fk)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Aviano Air Base ] )",
        "gold_entity_map": {
            "m.05l8fk": "Aviano Air Base"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2973",
        "question": "where did giovanni da verrazano live",
        "comp_type": null,
        "answer": [
            "m.01b3jn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6d2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6d2 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0k6d2))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Giovanni da Verrazzano ] ) )",
        "gold_entity_map": {
            "m.0k6d2": "Giovanni da Verrazzano"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2974",
        "question": "what was antonio vivaldi known for",
        "comp_type": null,
        "answer": [
            "m.012vv0",
            "m.01c72t",
            "m.05xjb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pth)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pth ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0pth)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Antonio Vivaldi ] )",
        "gold_entity_map": {
            "m.0pth": "Antonio Vivaldi"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2978",
        "question": "when are the summer olympics held",
        "comp_type": null,
        "answer": [
            "m.0130xg",
            "m.016q6p",
            "m.016q75",
            "m.016q7p",
            "m.016r9z",
            "m.018ljb",
            "m.018qb4",
            "m.018wrk",
            "m.03tnk7",
            "m.05gj2h",
            "m.06sks6",
            "m.09x3r",
            "m.0blg2",
            "m.0c_tl",
            "m.0jdk_",
            "m.0jhn7",
            "m.0jkvj",
            "m.0kbvb",
            "m.0kbws",
            "m.0l6m5",
            "m.0l6mp",
            "m.0l6ny",
            "m.0l6vl",
            "m.0l98s",
            "m.0l998",
            "m.0lbbj",
            "m.0lbd9",
            "m.0ldqf",
            "m.0lgxj",
            "m.0lk8j",
            "m.0lv1x",
            "m.0nbjq",
            "m.0sxrz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06vvk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06vvk ns:time.recurring_event.instances ?x .\n}\n",
        "sexpr": "(JOIN (R time.recurring_event.instances) m.06vvk)",
        "normed_sexpr": "( JOIN ( R [ time , recurring event , instances ] ) [ Summer Olympic Games ] )",
        "gold_entity_map": {
            "m.06vvk": "Summer Olympic Games"
        },
        "gold_relation_map": {
            "time.recurring_event.instances": "time , recurring event , instances"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2983",
        "question": "what country did the zulu live in",
        "comp_type": null,
        "answer": [
            "m.02c59t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gwrmk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gwrmk ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.03gwrmk)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Zulu Kingdom ] )",
        "gold_entity_map": {
            "m.03gwrmk": "Zulu Kingdom"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2984",
        "question": "where was president chester arthur born",
        "comp_type": null,
        "answer": [
            "m.010jjd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vb2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vb2 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01vb2)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Chester A. Arthur ] )",
        "gold_entity_map": {
            "m.01vb2": "Chester A. Arthur"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2985",
        "question": "where to fly in for galapagos islands",
        "comp_type": null,
        "answer": [
            "m.0405q0f",
            "m.0405q2v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016zjj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016zjj ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.016zjj)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Galápagos Islands ] )",
        "gold_entity_map": {
            "m.016zjj": "Galápagos Islands"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2986",
        "question": "who has tom brady played for",
        "comp_type": null,
        "answer": [
            "m.05g3b",
            "m.0fsb_6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xyt7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xyt7 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.01xyt7))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Tom Brady ] ) )",
        "gold_entity_map": {
            "m.01xyt7": "Tom Brady"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2989",
        "question": "what time is it in lake havasu city arizona",
        "comp_type": null,
        "answer": [
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0qpxs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0qpxs ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0qpxs)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Lake Havasu City ] )",
        "gold_entity_map": {
            "m.0qpxs": "Lake Havasu City"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2990",
        "question": "what years have the giants won the world series",
        "comp_type": null,
        "answer": [
            "m.0117q3yz",
            "m.09gnk2r",
            "m.0ds8qct"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0713r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0713r ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0713r)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ San Francisco Giants ] )",
        "gold_entity_map": {
            "m.0713r": "San Francisco Giants"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2992",
        "question": "where did laura bush grow up",
        "comp_type": null,
        "answer": [
            "m.013n2h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04g8d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04g8d ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.04g8d)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Laura Bush ] )",
        "gold_entity_map": {
            "m.04g8d": "Laura Bush"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2993",
        "question": "what currency should i take to mauritius",
        "comp_type": null,
        "answer": [
            "m.02scxb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04vs9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04vs9 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.04vs9)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Mauritius ] )",
        "gold_entity_map": {
            "m.04vs9": "Mauritius"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2996",
        "question": "what did johannes kepler accomplish",
        "comp_type": null,
        "answer": [
            "m.025rxky",
            "m.04s2z",
            "m.05snw",
            "m.06q2q",
            "m.0h9c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0403d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0403d ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0403d)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Johannes Kepler ] )",
        "gold_entity_map": {
            "m.0403d": "Johannes Kepler"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2998",
        "question": "who is ellen albertini dow",
        "comp_type": null,
        "answer": [
            "m.01d30f",
            "m.02h6n_q",
            "m.02hrh1q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03hzplf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03hzplf ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03hzplf)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Ellen Dow ] )",
        "gold_entity_map": {
            "m.03hzplf": "Ellen Dow"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3001",
        "question": "where is the singapore zoo",
        "comp_type": null,
        "answer": [
            "m.06t2t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0211mz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0211mz ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0211mz)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Singapore Zoo ] )",
        "gold_entity_map": {
            "m.0211mz": "Singapore Zoo"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3002",
        "question": "what town was abe lincoln born in",
        "comp_type": null,
        "answer": [
            "m.0tgmk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R people.person.place_of_birth) m.0gzh))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Abraham Lincoln ] ) )",
        "gold_entity_map": {
            "m.01m9": "City/Town/Village",
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-3009",
        "question": "what teams did jim harbaugh play for",
        "comp_type": null,
        "answer": [
            "m.01ct6",
            "m.01y3v",
            "m.03wnh",
            "m.06rpd",
            "m.0fsb_6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04rmtv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04rmtv ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.04rmtv))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Jim Harbaugh ] ) )",
        "gold_entity_map": {
            "m.04rmtv": "Jim Harbaugh"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3010",
        "question": "who played atticus finch in the movie",
        "comp_type": null,
        "answer": [
            "m.0k9j_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pk0sd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pk0sd ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.02pk0sd))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Atticus Finch ] ) )",
        "gold_entity_map": {
            "m.02pk0sd": "Atticus Finch"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    }
]