[
    {
        "ID": "WebQTrn-1344",
        "question": "who plays ray barone",
        "comp_type": null,
        "answer": [
            "m.01h910"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05h7f2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05h7f2 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.05h7f2))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Ray Barone ] ) )",
        "gold_entity_map": {
            "m.05h7f2": "Ray Barone"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1345",
        "question": "what movies did robert blake play in",
        "comp_type": null,
        "answer": [
            "m.01d259",
            "m.01wb95",
            "m.026hy89",
            "m.0279xlz",
            "m.02q5nj9",
            "m.02vptkn",
            "m.02vrr6j",
            "m.03ltls",
            "m.03w54r",
            "m.04j12jk",
            "m.04m_9jn",
            "m.04mwvdc",
            "m.04mxbcs",
            "m.04n2nzk",
            "m.04n36xd",
            "m.04n5zhb",
            "m.04q0p56",
            "m.04q0x8_",
            "m.04q0xcr",
            "m.04q1nn_",
            "m.04q1qpp",
            "m.04q1x_3",
            "m.04q2pmc",
            "m.04q3hcr",
            "m.04q3pzw",
            "m.04q3t9s",
            "m.04q6gwh",
            "m.04q6v3j",
            "m.04q6vqs",
            "m.04q7lth",
            "m.04q7mlx",
            "m.04q8716",
            "m.04q8dj0",
            "m.04q9wp8",
            "m.04q9xgk",
            "m.05fgnv",
            "m.05h114",
            "m.05z12j",
            "m.07khwht",
            "m.07shqj2",
            "m.08zdy_",
            "m.096z6g",
            "m.09pggs1",
            "m.09pghrc",
            "m.09pghy3",
            "m.09pgky9",
            "m.09rz5yy",
            "m.09s26_l",
            "m.09s26qc",
            "m.0b3tsj6",
            "m.0b3txfm",
            "m.0bb_jhd",
            "m.0bhh9g",
            "m.0c0l3nh",
            "m.0c1cdnr",
            "m.0cg9l6_",
            "m.0cg9l76",
            "m.0chvjcz",
            "m.0d7fjb",
            "m.0hndx7h",
            "m.0kv7x7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jx92)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jx92 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.01jx92))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Robert Blake ] ) )",
        "gold_entity_map": {
            "m.01jx92": "Robert Blake"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1351",
        "question": "what city was barack obama born in",
        "comp_type": null,
        "answer": [
            "m.02hrh0_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R people.person.place_of_birth) m.02mjmr))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Barack Obama ] ) )",
        "gold_entity_map": {
            "m.01m9": "City/Town/Village",
            "m.02mjmr": "Barack Obama"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-1354",
        "question": "what films have johnny depp been in",
        "comp_type": null,
        "answer": [
            "m.010pd7hh",
            "m.011lzwh3",
            "m.01s3vk",
            "m.01vksx",
            "m.025_5c",
            "m.028f12",
            "m.02kvpf",
            "m.02lxrv",
            "m.02qfnrg",
            "m.02qr8lh",
            "m.02r79_h",
            "m.02t276",
            "m.02wwmhc",
            "m.0306c6",
            "m.034nnw",
            "m.03y0pn",
            "m.03z9585",
            "m.04165w",
            "m.042w0v2",
            "m.047dsy7",
            "m.04jpg2p",
            "m.04lgx5r",
            "m.04pk1f",
            "m.050xxm",
            "m.052q5y",
            "m.056n0f",
            "m.05890x6",
            "m.05nlx4",
            "m.05s077",
            "m.05v38p",
            "m.063dp0",
            "m.06cpd9",
            "m.06lspc",
            "m.06r1z1",
            "m.06v_2g",
            "m.06w99h3",
            "m.08dl83",
            "m.08ll52",
            "m.099vtk",
            "m.09g7vfw",
            "m.09gp2cp",
            "m.09hq9g",
            "m.09v8clw",
            "m.0bmfzxx",
            "m.0bq8tmw",
            "m.0c34mt",
            "m.0ch3dxb",
            "m.0ch3qr1",
            "m.0clh4y",
            "m.0ds11z",
            "m.0dsf7lf",
            "m.0f8j13",
            "m.0fg04",
            "m.0g3zrd",
            "m.0g7nb_",
            "m.0h_dv23",
            "m.0kv5xw",
            "m.0kvd2g",
            "m.0n_hp",
            "m.0sxmx",
            "m.0symg",
            "m.0v8_gw0",
            "m.0w2sx8x",
            "m.0x15942",
            "m.0y4m_xb",
            "m.0y4n1sq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jfx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jfx1 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0jfx1))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Johnny Depp ] ) )",
        "gold_entity_map": {
            "m.0jfx1": "Johnny Depp"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1357",
        "question": "what country did vasco da gama came from",
        "comp_type": null,
        "answer": [
            "m.01hk04"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8dk ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.0c8dk)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Vasco da Gama ] )",
        "gold_entity_map": {
            "m.0c8dk": "Vasco da Gama"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1358",
        "question": "what is the current government of vietnam",
        "comp_type": null,
        "answer": [
            "m.01fkst",
            "m.025tbxf",
            "m.0py4y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01crd5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01crd5 ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.01crd5)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Vietnam ] )",
        "gold_entity_map": {
            "m.01crd5": "Vietnam"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1364",
        "question": "who did jason segel date",
        "comp_type": null,
        "answer": [
            "m.02pjvc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q5t7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q5t7 ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n",
        "sexpr": "(JOIN (R base.popstra.dated.participant) (JOIN (R base.popstra.celebrity.dated) m.06q5t7))",
        "normed_sexpr": "( JOIN ( R [ base , popstra , dated , participant ] ) ( JOIN ( R [ base , popstra , celebrity , dated ] ) [ Jason Segel ] ) )",
        "gold_entity_map": {
            "m.06q5t7": "Jason Segel"
        },
        "gold_relation_map": {
            "base.popstra.dated.participant": "base , popstra , dated , participant",
            "base.popstra.celebrity.dated": "base , popstra , celebrity , dated"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1365",
        "question": "where christopher columbus was born",
        "comp_type": null,
        "answer": [
            "m.0hknf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pwz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pwz ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01pwz)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Christopher Columbus ] )",
        "gold_entity_map": {
            "m.01pwz": "Christopher Columbus"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1370",
        "question": "what are the main sports in new zealand",
        "comp_type": null,
        "answer": [
            "m.0148q6",
            "m.0260pzv",
            "m.02fbb5",
            "m.02q1tv9",
            "m.02r5mr_",
            "m.02wbmc2",
            "m.03_44z",
            "m.0341ld",
            "m.03d1rs_",
            "m.03svm9",
            "m.03yj5rj",
            "m.03yj691",
            "m.0400zd",
            "m.04cyzks",
            "m.04d0vm",
            "m.04g2874",
            "m.04h1bh",
            "m.04j9x_0",
            "m.04jntyb",
            "m.05szm73",
            "m.06qvwt",
            "m.06rnv3",
            "m.07djk2",
            "m.09bnzz",
            "m.09nm9w",
            "m.0c_76q",
            "m.0f4rf7",
            "m.0fyd4k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ctw_b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ctw_b ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.0ctw_b)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ New Zealand ] )",
        "gold_entity_map": {
            "m.0ctw_b": "New Zealand"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1373",
        "question": "what language do you speak in finland",
        "comp_type": null,
        "answer": [
            "m.01gp_d",
            "m.02lpg6",
            "m.04d36l",
            "m.06mp7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vzc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vzc ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.02vzc)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Finland ] )",
        "gold_entity_map": {
            "m.02vzc": "Finland"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1377",
        "question": "what are shirley temple kids names",
        "comp_type": null,
        "answer": [
            "m.028bpn9",
            "m.0gy7501",
            "m.0gy7508"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d9v8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d9v8 ns:people.person.children ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.children) m.03d9v8)",
        "normed_sexpr": "( JOIN ( R [ people , person , children ] ) [ Shirley Temple ] )",
        "gold_entity_map": {
            "m.03d9v8": "Shirley Temple"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1379",
        "question": "what position does terrell owens play",
        "comp_type": null,
        "answer": [
            "m.02g_6x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027ddp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027ddp ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.position ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.position) (JOIN (R sports.pro_athlete.teams) m.027ddp))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , position ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Terrell Owens ] ) )",
        "gold_entity_map": {
            "m.027ddp": "Terrell Owens"
        },
        "gold_relation_map": {
            "sports.pro_athlete.teams": "sports , pro athlete , teams",
            "sports.sports_team_roster.position": "sports , sports team roster , position"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1381",
        "question": "what did kourtney kardashian go to college for",
        "comp_type": null,
        "answer": [
            "m.03qsdpk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043ttm7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043ttm7 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.major_field_of_study) (JOIN (R people.person.education) m.043ttm7))",
        "normed_sexpr": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Kourtney Kardashian ] ) )",
        "gold_entity_map": {
            "m.043ttm7": "Kourtney Kardashian"
        },
        "gold_relation_map": {
            "people.person.education": "people , person , education",
            "education.education.major_field_of_study": "education , education , major field of study"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1383",
        "question": "where is bergen belsen concentration camp located",
        "comp_type": null,
        "answer": [
            "m.0345h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0139dh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0139dh ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0139dh)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Bergen-Belsen concentration camp ] )",
        "gold_entity_map": {
            "m.0139dh": "Bergen-Belsen concentration camp"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1384",
        "question": "who was louis xvi",
        "comp_type": null,
        "answer": [
            "m.0290vf",
            "m.05st_0j",
            "m.063032x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dj9w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dj9w ns:royalty.noble_person.titles ?y .\n?y ns:royalty.noble_title_tenure.noble_title ?x .\n}\n",
        "sexpr": "(JOIN (R royalty.noble_title_tenure.noble_title) (JOIN (R royalty.noble_person.titles) m.0dj9w))",
        "normed_sexpr": "( JOIN ( R [ royalty , noble title tenure , noble title ] ) ( JOIN ( R [ royalty , noble person , titles ] ) [ Louis XVI of France ] ) )",
        "gold_entity_map": {
            "m.0dj9w": "Louis XVI of France"
        },
        "gold_relation_map": {
            "royalty.noble_title_tenure.noble_title": "royalty , noble title tenure , noble title",
            "royalty.noble_person.titles": "royalty , noble person , titles"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1386",
        "question": "what did donna summers die from",
        "comp_type": null,
        "answer": [
            "m.04p3w",
            "m.0qcr0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0136p1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0136p1 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0136p1)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Donna Summer ] )",
        "gold_entity_map": {
            "m.0136p1": "Donna Summer"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1387",
        "question": "what year did allen iverson get married",
        "comp_type": null,
        "answer": [
            "2001-08-03"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sg7_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sg7_ ns:people.person.spouse_s ?y .\n?y ns:people.marriage.from ?x .\n}\n",
        "sexpr": "(JOIN (R people.marriage.from) (JOIN (R people.person.spouse_s) m.01sg7_))",
        "normed_sexpr": "( JOIN ( R [ people , marriage , from ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Allen Iverson ] ) )",
        "gold_entity_map": {
            "m.01sg7_": "Allen Iverson"
        },
        "gold_relation_map": {
            "people.person.spouse_s": "people , person , spouse s",
            "people.marriage.from": "people , marriage , from"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1391",
        "question": "when did the battle of thermopylae occur",
        "comp_type": null,
        "answer": [
            "-479"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014px1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014px1 ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.014px1)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ Battle of Thermopylae ] )",
        "gold_entity_map": {
            "m.014px1": "Battle of Thermopylae"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1392",
        "question": "where did eleanor roosevelt go to school",
        "comp_type": null,
        "answer": [
            "m.03j_v35",
            "m.06thjt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02n9k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02n9k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.02n9k))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Eleanor Roosevelt ] ) )",
        "gold_entity_map": {
            "m.02n9k": "Eleanor Roosevelt"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1400",
        "question": "who played jacob black",
        "comp_type": null,
        "answer": [
            "m.07ldhs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qd_td)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qd_td ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.02qd_td))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Jacob Black ] ) )",
        "gold_entity_map": {
            "m.02qd_td": "Jacob Black"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1402",
        "question": "what movies star adam sandler",
        "comp_type": null,
        "answer": [
            "m.010rdrd1",
            "m.0118fw_v",
            "m.012z_7zt",
            "m.01h3y_",
            "m.01x_hw",
            "m.023vcd",
            "m.02bhsc",
            "m.02d003",
            "m.02dxrm",
            "m.02f6g5",
            "m.02hwd1n",
            "m.02hxhz",
            "m.02m7tn",
            "m.02ph9tm",
            "m.02q3pj",
            "m.02qdrjx",
            "m.02tgz4",
            "m.02ylg6",
            "m.036z1n",
            "m.03qfpk",
            "m.03z20c",
            "m.047419",
            "m.047svrl",
            "m.04p7q_",
            "m.05s14k",
            "m.05yxmk",
            "m.0640m69",
            "m.06j0d5",
            "m.070rc_",
            "m.074w86",
            "m.07hq75",
            "m.07kb7vh",
            "m.07ktmd",
            "m.087pfc",
            "m.095z4q",
            "m.0bshwmp",
            "m.0ch3qr1",
            "m.0crryph",
            "m.0d0stl",
            "m.0f2sx4",
            "m.0gj96ln",
            "m.0glpgxk",
            "m.0gwgn1k",
            "m.0j_z7p9",
            "m.0jwnx61",
            "m.0mzt5cs",
            "m.0v_ckgv",
            "m.0w7c5jm",
            "m.0w7c7c3",
            "m.0zrq8j3",
            "m.0zrxc1v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pz91 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0pz91))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Adam Sandler ] ) )",
        "gold_entity_map": {
            "m.0pz91": "Adam Sandler"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1405",
        "question": "where did president kennedy go to school",
        "comp_type": null,
        "answer": [
            "m.01mpwj",
            "m.02bb47",
            "m.02hdpx",
            "m.03ksy",
            "m.03qs17",
            "m.05yk0g",
            "m.05zl0",
            "m.08kml_",
            "m.0b7824",
            "m.0ccg42"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0d3k14))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ John F. Kennedy ] ) )",
        "gold_entity_map": {
            "m.0d3k14": "John F. Kennedy"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1407",
        "question": "what happened at fukushima daiichi nuclear plant",
        "comp_type": null,
        "answer": [
            "m.05czkfp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vkzy2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vkzy2 ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.notable_object ?x .\n}\n",
        "sexpr": "(JOIN (R common.notable_for.notable_object) (JOIN (R common.topic.notable_for) m.02vkzy2))",
        "normed_sexpr": "( JOIN ( R [ common , notable for , notable object ] ) ( JOIN ( R [ common , topic , notable for ] ) [ Fukushima Daiichi Nuclear Power Plant ] ) )",
        "gold_entity_map": {
            "m.02vkzy2": "Fukushima Daiichi Nuclear Power Plant"
        },
        "gold_relation_map": {
            "common.notable_for.notable_object": "common , notable for , notable object",
            "common.topic.notable_for": "common , topic , notable for"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1408",
        "question": "who was louis kossuth",
        "comp_type": null,
        "answer": [
            "m.04gc2",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.021xrk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.021xrk ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.021xrk)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Lajos Kossuth ] )",
        "gold_entity_map": {
            "m.021xrk": "Lajos Kossuth"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1409",
        "question": "what country do arabic people come from",
        "comp_type": null,
        "answer": [
            "m.02pfy17",
            "m.0466nw8",
            "m.07478ps",
            "m.0c09hgt",
            "m.0gwgnk",
            "m.0jt7v76"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xff)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xff ns:people.ethnicity.includes_groups ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.includes_groups) m.0xff)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , includes groups ] ) [ Arabs ] )",
        "gold_entity_map": {
            "m.0xff": "Arabs"
        },
        "gold_relation_map": {
            "people.ethnicity.includes_groups": "people , ethnicity , includes groups"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1410",
        "question": "when did the red sox win the pennant",
        "comp_type": null,
        "answer": [
            "m.018n8",
            "m.0268bkj",
            "m.044ym6",
            "m.0469hv",
            "m.04tf98",
            "m.04tg7d",
            "m.04tg7r",
            "m.0ds324c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01d5z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01d5z ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.01d5z)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Boston Red Sox ] )",
        "gold_entity_map": {
            "m.01d5z": "Boston Red Sox"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1411",
        "question": "where did harry truman die",
        "comp_type": null,
        "answer": [
            "m.04f_d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09bg4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09bg4l ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.09bg4l)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Harry S. Truman ] )",
        "gold_entity_map": {
            "m.09bg4l": "Harry S. Truman"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    }
]