[
    {
        "ID": "WebQTrn-1",
        "question": "what character did natalie portman play in star wars",
        "comp_type": null,
        "answer": [
            "m.0drf_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09l3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09l3p ns:film.actor.film ?y .\n?y ns:film.performance.character ?x .\n?y ns:film.performance.film ns:m.0ddt_ .\n}\n",
        "sexpr": "(JOIN (R film.performance.character) (AND (JOIN film.performance.film m.0ddt_) (JOIN (R film.actor.film) m.09l3p)))",
        "normed_sexpr": "( JOIN ( R [ film , performance , character ] ) ( AND ( JOIN [ film , performance , film ] [ Star Wars Episode I: The Phantom Menace ] ) ( JOIN ( R [ film , actor , film ] ) [ Natalie Portman ] ) ) )",
        "gold_entity_map": {
            "m.0ddt_": "Star Wars Episode I: The Phantom Menace",
            "m.09l3p": "Natalie Portman"
        },
        "gold_relation_map": {
            "film.performance.character": "film , performance , character",
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-4",
        "question": "what kind of money to take to bahamas",
        "comp_type": null,
        "answer": [
            "m.01l6dm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0160w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0160w ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0160w)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Bahamas ] )",
        "gold_entity_map": {
            "m.0160w": "Bahamas"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-7",
        "question": "where are the nfl redskins from",
        "comp_type": null,
        "answer": [
            "m.0rh6k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084l5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084l5 ns:sports.sports_team.location ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.location) m.084l5)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , location ] ) [ Washington Redskins ] )",
        "gold_entity_map": {
            "m.084l5": "Washington Redskins"
        },
        "gold_relation_map": {
            "sports.sports_team.location": "sports , sports team , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-8",
        "question": "where did saki live",
        "comp_type": null,
        "answer": [
            "m.05ql8_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07484)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07484 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.07484)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Saki ] )",
        "gold_entity_map": {
            "m.07484": "Saki"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-9",
        "question": "how old is sacha baron cohen",
        "comp_type": null,
        "answer": [
            "1971-10-13"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c9c0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c9c0 ns:people.person.date_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.date_of_birth) m.0c9c0)",
        "normed_sexpr": "( JOIN ( R [ people , person , date of birth ] ) [ Sacha Baron Cohen ] )",
        "gold_entity_map": {
            "m.0c9c0": "Sacha Baron Cohen"
        },
        "gold_relation_map": {
            "people.person.date_of_birth": "people , person , date of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-11",
        "question": "what time zone am i in cleveland ohio",
        "comp_type": null,
        "answer": [
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01sn3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01sn3 ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.01sn3)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Cleveland ] )",
        "gold_entity_map": {
            "m.01sn3": "Cleveland"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-14",
        "question": "where is rome italy located on a map",
        "comp_type": null,
        "answer": [
            "m.03rjj",
            "m.04q_g",
            "m.098phg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c62 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.06c62)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Rome ] )",
        "gold_entity_map": {
            "m.06c62": "Rome"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-15",
        "question": "what is nina dobrev nationality",
        "comp_type": null,
        "answer": [
            "m.015qh",
            "m.0d060g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027nwk2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027nwk2 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.027nwk2)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Nina Dobrev ] )",
        "gold_entity_map": {
            "m.027nwk2": "Nina Dobrev"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-17",
        "question": "which kennedy died first",
        "comp_type": null,
        "answer": [
            "m.020t1x"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE { \n  ns:m.0fbrl ns:people.family.members ?x .  # Kennedy Family\n  ?x ns:people.deceased_person.date_of_death ?d .\n}\nORDER BY ?d\nLIMIT 1",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0fbrl": "Kennedy family"
        },
        "gold_relation_map": {
            "people.family.members": "people , family , members",
            "people.deceased_person.date_of_death": "people , deceased person , date of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-22",
        "question": "what to see near sedona arizona",
        "comp_type": null,
        "answer": [
            "m.026h8t6",
            "m.02qswpp",
            "m.02ty7n",
            "m.04crz42",
            "m.04xgf_s",
            "m.07k8z2",
            "m.0dlm2c7",
            "m.0dqzqc",
            "m.0f44c_",
            "m.0g5qfch",
            "m.0gj9fwx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ny57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ny57 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0ny57)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Sedona ] )",
        "gold_entity_map": {
            "m.0ny57": "Sedona"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-24",
        "question": "what form of government does russia have today",
        "comp_type": null,
        "answer": [
            "m.01dw03",
            "m.0c9rw5",
            "m.0j729"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.06bnz)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Russia ] )",
        "gold_entity_map": {
            "m.06bnz": "Russia"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-31",
        "question": "who was ishmael 's mom",
        "comp_type": null,
        "answer": [
            "m.01sq9c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ghr4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ghr4 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.parents) m.01ghr4))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Ishmael ] ) )",
        "gold_entity_map": {
            "m.02zsn": "Female",
            "m.01ghr4": "Ishmael"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-32",
        "question": "what was malcolm x trying to accomplish",
        "comp_type": null,
        "answer": [
            "m.074v_1j",
            "m.0g4pf68"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03f2h01)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03f2h01 ns:base.activism.activist.area_of_activism ?x .\n}\n",
        "sexpr": "(JOIN (R base.activism.activist.area_of_activism) m.03f2h01)",
        "normed_sexpr": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Malcolm X ] )",
        "gold_entity_map": {
            "m.03f2h01": "Malcolm X"
        },
        "gold_relation_map": {
            "base.activism.activist.area_of_activism": "base , activism , activist , area of activism"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-33",
        "question": "where are the netherlands on a world map",
        "comp_type": null,
        "answer": [
            "m.049nq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059j2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059j2 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.059j2)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Netherlands ] )",
        "gold_entity_map": {
            "m.059j2": "Netherlands"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-35",
        "question": "what are the major cities in france",
        "comp_type": null,
        "answer": [
            "m.05qtj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.0f8l9c)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ France ] )",
        "gold_entity_map": {
            "m.0f8l9c": "France"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-36",
        "question": "what city did esther live in",
        "comp_type": null,
        "answer": [
            "m.0gf0n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pn7 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02pn7)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Esther ] )",
        "gold_entity_map": {
            "m.02pn7": "Esther"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-38",
        "question": "what is saint nicholas known for",
        "comp_type": null,
        "answer": [
            "m.066mx9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f9q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f9q7 ns:book.book_subject.works ?x .\n}\n",
        "sexpr": "(JOIN (R book.book_subject.works) m.0f9q7)",
        "normed_sexpr": "( JOIN ( R [ book , book subject , works ] ) [ Saint Nicholas ] )",
        "gold_entity_map": {
            "m.0f9q7": "Saint Nicholas"
        },
        "gold_relation_map": {
            "book.book_subject.works": "book , book subject , works"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-40",
        "question": "what is cher 's son 's name",
        "comp_type": null,
        "answer": [
            "m.01w4bt1",
            "m.0br66"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vtj38)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vtj38 ns:people.person.children ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.children) m.01vtj38))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , children ] ) [ Cher ] ) )",
        "gold_entity_map": {
            "m.05zppz": "Male",
            "m.01vtj38": "Cher"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children",
            "people.person.gender": "people , person , gender"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-42",
        "question": "what party was andrew jackson",
        "comp_type": null,
        "answer": [
            "m.020lwv",
            "m.07wf9",
            "m.0d075m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.0rlz))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Andrew Jackson ] ) )",
        "gold_entity_map": {
            "m.0rlz": "Andrew Jackson"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-44",
        "question": "what county is the city of hampton va in",
        "comp_type": null,
        "answer": [],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mnsf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mnsf ns:location.hud_county_place.place ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.place) m.0mnsf)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , place ] ) [ Hampton ] )",
        "gold_entity_map": {
            "m.0mnsf": "Hampton"
        },
        "gold_relation_map": {
            "location.hud_county_place.place": "location , hud county place , place"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-47",
        "question": "what county is heathrow airport in",
        "comp_type": null,
        "answer": [
            "m.04pxy3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03jn4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03jn4 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01n7 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01n7) (JOIN (R location.location.containedby) m.03jn4))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Location ] ) ( JOIN ( R [ location , location , containedby ] ) [ London Heathrow Airport ] ) )",
        "gold_entity_map": {
            "m.01n7": "Location",
            "m.03jn4": "London Heathrow Airport"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01n7": "Location"
        }
    },
    {
        "ID": "WebQTrn-53",
        "question": "what year did william jennings bryan run for president",
        "comp_type": null,
        "answer": [
            "m.0b4pfj",
            "m.0dv63j",
            "m.0fr77c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b3tf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b3tf ns:base.politicalconventions.presidential_nominee.nominated_at ?x .\n}\n",
        "sexpr": "(JOIN (R base.politicalconventions.presidential_nominee.nominated_at) m.0b3tf)",
        "normed_sexpr": "( JOIN ( R [ base , politicalconventions , presidential nominee , nominated at ] ) [ William Jennings Bryan ] )",
        "gold_entity_map": {
            "m.0b3tf": "William Jennings Bryan"
        },
        "gold_relation_map": {
            "base.politicalconventions.presidential_nominee.nominated_at": "base , politicalconventions , presidential nominee , nominated at"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-54",
        "question": "what was the name of frederick douglass book",
        "comp_type": null,
        "answer": [
            "m.03c5dpz",
            "m.03clq8t",
            "m.04kh2k",
            "m.067mzxk",
            "m.067x2lp",
            "m.068c5tc",
            "m.068jkrg",
            "m.0697p24",
            "m.06bq6w2",
            "m.06c1dmk",
            "m.06fr4s7",
            "m.06jjj7m",
            "m.06kf95n",
            "m.06ktxh7",
            "m.06kvgsm",
            "m.06kxqpj",
            "m.06m91zr",
            "m.06mj8s0",
            "m.06mkpqq",
            "m.06mkz59",
            "m.06mz4m1",
            "m.06p5ykp",
            "m.06r6hzr",
            "m.06ry31_",
            "m.06twn1l",
            "m.06tws33",
            "m.06ty1ql",
            "m.06vbs0d",
            "m.0c1t2v2",
            "m.0fpb93x",
            "m.0fpb946",
            "m.0y50n2g",
            "m.0y50n39",
            "m.0y50n4h",
            "m.0y50n7t",
            "m.0y50ngp",
            "m.0y50njy",
            "m.0y50nxt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zg0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zg0 ns:book.author.works_written ?x .\n?x ns:common.topic.notable_types ns:m.01xryvm .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01xryvm) (JOIN (R book.author.works_written) m.02zg0))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Book ] ) ( JOIN ( R [ book , author , works written ] ) [ Frederick Douglass ] ) )",
        "gold_entity_map": {
            "m.02zg0": "Frederick Douglass",
            "m.01xryvm": "Book"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {
            "m.01xryvm": "Book"
        }
    },
    {
        "ID": "WebQTrn-55",
        "question": "who was queen victoria 's parents called",
        "comp_type": null,
        "answer": [
            "m.01c50q",
            "m.024hvp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cw10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cw10 ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.0cw10)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Queen Victoria ] )",
        "gold_entity_map": {
            "m.0cw10": "Queen Victoria"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-60",
        "question": "what countries do people speak portuguese",
        "comp_type": null,
        "answer": [
            "m.015fr",
            "m.01nqj",
            "m.02kcz",
            "m.02lx0",
            "m.034m8",
            "m.036b_",
            "m.04thp",
            "m.04wlh",
            "m.05r4w",
            "m.0d05w3",
            "m.0d060g",
            "m.0hg5",
            "m.0hzlz",
            "m.0j4b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05zjd ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.countries_spoken_in) m.05zjd)",
        "normed_sexpr": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Portuguese Language ] )",
        "gold_entity_map": {
            "m.05zjd": "Portuguese Language"
        },
        "gold_relation_map": {
            "language.human_language.countries_spoken_in": "language , human language , countries spoken in"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-62",
        "question": "what are the names of walt disney kids",
        "comp_type": null,
        "answer": [
            "m.064ndq",
            "m.07kyh5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081nh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081nh ns:people.person.children ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.children) m.081nh)",
        "normed_sexpr": "( JOIN ( R [ people , person , children ] ) [ Walt Disney ] )",
        "gold_entity_map": {
            "m.081nh": "Walt Disney"
        },
        "gold_relation_map": {
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-63",
        "question": "who is in the band bush",
        "comp_type": null,
        "answer": [
            "m.014qv7",
            "m.01vs4sv",
            "m.01vs4t_",
            "m.01vs4vw",
            "m.01wrrdk",
            "m.03d_qbn",
            "m.08f647",
            "m.0h88bb2",
            "m.0j1v9tm",
            "m.0zdb8q6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01727v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01727v ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.member) (JOIN (R music.musical_group.member) m.01727v))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , member ] ) ( JOIN ( R [ music , musical group , member ] ) [ Bush ] ) )",
        "gold_entity_map": {
            "m.01727v": "Bush"
        },
        "gold_relation_map": {
            "music.musical_group.member": "music , musical group , member",
            "music.group_membership.member": "music , group membership , member"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-65",
        "question": "what timezone is australia gmt",
        "comp_type": null,
        "answer": [
            "m.0y497_m",
            "m.0y497zw",
            "m.0y4980d",
            "m.0y498qn",
            "m.0y498v7",
            "m.0y49954",
            "m.0y49994",
            "m.0y499p1",
            "m.0y49btq",
            "m.0y4dpjf",
            "m.0y4dr4c",
            "m.0y4drym"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chghy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chghy ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0chghy)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Australia ] )",
        "gold_entity_map": {
            "m.0chghy": "Australia"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-69",
        "question": "what tv show did joey lawrence play on",
        "comp_type": null,
        "answer": [
            "m.026_g9w",
            "m.02xwgb",
            "m.036y7h",
            "m.0b6kw6d",
            "m.0g0tw9",
            "m.0lc1qx5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pr9kj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pr9kj ns:tv.tv_actor.starring_roles ?y .\n?y ns:tv.regular_tv_appearance.series ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.series) (JOIN (R tv.tv_actor.starring_roles) m.01pr9kj))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , series ] ) ( JOIN ( R [ tv , tv actor , starring roles ] ) [ Joey Lawrence ] ) )",
        "gold_entity_map": {
            "m.01pr9kj": "Joey Lawrence"
        },
        "gold_relation_map": {
            "tv.tv_actor.starring_roles": "tv , tv actor , starring roles",
            "tv.regular_tv_appearance.series": "tv , regular tv appearance , series"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-70",
        "question": "what timezone is denver co",
        "comp_type": null,
        "answer": [
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cl1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cl1 ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.02cl1)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Denver ] )",
        "gold_entity_map": {
            "m.02cl1": "Denver"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-72",
        "question": "where does jackie french live",
        "comp_type": null,
        "answer": [
            "m.06y57"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c9xl9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c9xl9 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0c9xl9)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jackie French ] )",
        "gold_entity_map": {
            "m.0c9xl9": "Jackie French"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-73",
        "question": "what form of government was practiced in sparta",
        "comp_type": null,
        "answer": [
            "m.04mlzp",
            "m.04szc",
            "m.06cx9",
            "m.09dcy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09472)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09472 ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.09472)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Sparta ] )",
        "gold_entity_map": {
            "m.09472": "Sparta"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    }
]