[
    {
        "ID": "WebQTrn-719",
        "question": "what has anna kendrick been in",
        "comp_type": null,
        "answer": [
            "g.11b6v7j7y9",
            "m.0105n27v",
            "m.011jhcqv",
            "m.011jt0_l",
            "m.0123kwtx",
            "m.012nlb0j",
            "m.013bfwl1",
            "m.027sfwn",
            "m.03nm_fh",
            "m.04n33f0",
            "m.05pdh86",
            "m.05t0_2v",
            "m.06_x996",
            "m.0728fz",
            "m.075wx7_",
            "m.075wx89",
            "m.0cmdwwg",
            "m.0czd7xd",
            "m.0djz0rc",
            "m.0gtsxr4",
            "m.0gwdqfj",
            "m.0gz6b6g",
            "m.0h16nwt",
            "m.0h97w42",
            "m.0hr6d1j",
            "m.0n5zm57",
            "m.0n5zm5k",
            "m.0p8xf5w",
            "m.0v998k8",
            "m.0w1dkh1",
            "m.0w29f81",
            "m.0w29fxm",
            "m.0w2sx8x",
            "m.0wdnycs",
            "m.0y4nmtc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04066xj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04066xj ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.04066xj))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Anna Kendrick ] ) )",
        "gold_entity_map": {
            "m.04066xj": "Anna Kendrick"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-721",
        "question": "what are the team colors for the pittsburgh steelers",
        "comp_type": null,
        "answer": [
            "m.019sc",
            "m.01l849",
            "m.083jv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.sports_team.colors ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.colors) m.05tfm)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , colors ] ) [ Pittsburgh Steelers ] )",
        "gold_entity_map": {
            "m.05tfm": "Pittsburgh Steelers"
        },
        "gold_relation_map": {
            "sports.sports_team.colors": "sports , sports team , colors"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-723",
        "question": "what did roy rogers die of",
        "comp_type": null,
        "answer": [
            "m.01l2m3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mc6h1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mc6h1 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01mc6h1)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Roy Rogers ] )",
        "gold_entity_map": {
            "m.01mc6h1": "Roy Rogers"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-724",
        "question": "what is calabria italy",
        "comp_type": null,
        "answer": [
            "m.02_1y_3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c61p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c61p ns:common.topic.notable_types ?x .\n}\n",
        "sexpr": "(JOIN (R common.topic.notable_types) m.0c61p)",
        "normed_sexpr": "( JOIN ( R [ common , topic , notable types ] ) [ Calabria ] )",
        "gold_entity_map": {
            "m.0c61p": "Calabria"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-728",
        "question": "what years did andrew jackson run for president",
        "comp_type": null,
        "answer": [
            "m.04dnyqg",
            "m.04dnyvt",
            "m.04dnyy4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:government.politician.election_campaigns ?x .\n}\n",
        "sexpr": "(JOIN (R government.politician.election_campaigns) m.0rlz)",
        "normed_sexpr": "( JOIN ( R [ government , politician , election campaigns ] ) [ Andrew Jackson ] )",
        "gold_entity_map": {
            "m.0rlz": "Andrew Jackson"
        },
        "gold_relation_map": {
            "government.politician.election_campaigns": "government , politician , election campaigns"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-729",
        "question": "what 4 countries make up great britain",
        "comp_type": null,
        "answer": [
            "m.025ndl",
            "m.02jx1",
            "m.0576g9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034cm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034cm ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.034cm))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Great Britain ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.034cm": "Great Britain"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-731",
        "question": "how many languages are there in the philippines",
        "comp_type": null,
        "answer": [
            "m.01jb8r",
            "m.01zfd7",
            "m.025hmd",
            "m.02h40lc",
            "m.02hxntx",
            "m.02p9hz",
            "m.032db0",
            "m.03323g",
            "m.07qv_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05v8c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05v8c ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.05v8c)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Philippines ] )",
        "gold_entity_map": {
            "m.05v8c": "Philippines"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-736",
        "question": "where is the columbia university located",
        "comp_type": null,
        "answer": [
            "m.02_286",
            "m.059rby",
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cf5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cf5 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01cf5)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Barnard College ] )",
        "gold_entity_map": {
            "m.01cf5": "Barnard College"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-738",
        "question": "what did the scientist thomson discover",
        "comp_type": null,
        "answer": [
            "m.02xz0f",
            "m.03ycsl",
            "m.08rnn2",
            "m.0ctgpr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j68z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j68z ns:symbols.name_source.namesakes ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.name_source.namesakes) m.0j68z)",
        "normed_sexpr": "( JOIN ( R [ symbols , name source , namesakes ] ) [ Joseph John Thomson ] )",
        "gold_entity_map": {
            "m.0j68z": "Joseph John Thomson"
        },
        "gold_relation_map": {
            "symbols.name_source.namesakes": "symbols , name source , namesakes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-739",
        "question": "where did john boehner come from",
        "comp_type": null,
        "answer": [
            "m.0yy2f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.039rwf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.039rwf ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.039rwf)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ John Boehner ] )",
        "gold_entity_map": {
            "m.039rwf": "John Boehner"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-743",
        "question": "what did julian fellowes write",
        "comp_type": null,
        "answer": [
            "m.04t4zhj",
            "m.04t4zj0",
            "m.06lwf82",
            "m.09ynmb",
            "m.0c1v8yb",
            "m.0dkd0z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mcjs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mcjs ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.05mcjs)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Julian Fellowes ] )",
        "gold_entity_map": {
            "m.05mcjs": "Julian Fellowes"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-744",
        "question": "where does selena gomez live map",
        "comp_type": null,
        "answer": [
            "m.02_286"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gs6vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gs6vr ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0gs6vr))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Selena Gomez ] ) )",
        "gold_entity_map": {
            "m.0gs6vr": "Selena Gomez"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-747",
        "question": "what is venus named for",
        "comp_type": null,
        "answer": [
            "m.09cxs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09bcm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09bcm ns:symbols.namesake.named_after ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.namesake.named_after) m.09bcm)",
        "normed_sexpr": "( JOIN ( R [ symbols , namesake , named after ] ) [ Venus ] )",
        "gold_entity_map": {
            "m.09bcm": "Venus"
        },
        "gold_relation_map": {
            "symbols.namesake.named_after": "symbols , namesake , named after"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-748",
        "question": "who did john fox coach for",
        "comp_type": null,
        "answer": [
            "m.01y3c",
            "m.0289q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06_73l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06_73l ns:sports.sports_team_coach.teams_coached ?y .\n?y ns:sports.sports_team_coach_tenure.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_coach_tenure.team) (JOIN (R sports.sports_team_coach.teams_coached) m.06_73l))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team coach tenure , team ] ) ( JOIN ( R [ sports , sports team coach , teams coached ] ) [ John Fox ] ) )",
        "gold_entity_map": {
            "m.06_73l": "John Fox"
        },
        "gold_relation_map": {
            "sports.sports_team_coach_tenure.team": "sports , sports team coach tenure , team",
            "sports.sports_team_coach.teams_coached": "sports , sports team coach , teams coached"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-750",
        "question": "what years have the dodgers won the world series",
        "comp_type": null,
        "answer": [
            "m.04j7dq",
            "m.04j7ml",
            "m.04tfkz",
            "m.04tfp1",
            "m.04tfrv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04mjl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04mjl ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.04mjl)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Los Angeles Dodgers ] )",
        "gold_entity_map": {
            "m.04mjl": "Los Angeles Dodgers"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-751",
        "question": "what did farrah have surgery for",
        "comp_type": null,
        "answer": [
            "m.02vxm4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01j851)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01j851 ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.01j851)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Farrah Fawcett ] )",
        "gold_entity_map": {
            "m.01j851": "Farrah Fawcett"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-758",
        "question": "who owns the cleveland browns",
        "comp_type": null,
        "answer": [
            "m.0b84nt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xvb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xvb ns:sports.professional_sports_team.owner_s ?x .\n}\n",
        "sexpr": "(JOIN (R sports.professional_sports_team.owner_s) m.01xvb)",
        "normed_sexpr": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Cleveland Browns ] )",
        "gold_entity_map": {
            "m.01xvb": "Cleveland Browns"
        },
        "gold_relation_map": {
            "sports.professional_sports_team.owner_s": "sports , professional sports team , owner s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-759",
        "question": "what language do jewish speak",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.02hx72b",
            "m.02q7hd1",
            "m.033qhv",
            "m.033r5w",
            "m.0394p3",
            "m.039d68",
            "m.03cp6j",
            "m.03hkp",
            "m.03wxv4",
            "m.04p7x",
            "m.04x5zg",
            "m.04x6fd",
            "m.04x7hz",
            "m.04zxk0",
            "m.057k1c",
            "m.05k_d6",
            "m.05m7l7",
            "m.05mcpc",
            "m.05p1ky",
            "m.05pfcj",
            "m.064_8sq",
            "m.06b_j",
            "m.06nm1",
            "m.0880p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041rx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041rx ns:people.ethnicity.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.languages_spoken) m.041rx)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Jewish people ] )",
        "gold_entity_map": {
            "m.041rx": "Jewish people"
        },
        "gold_relation_map": {
            "people.ethnicity.languages_spoken": "people , ethnicity , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-765",
        "question": "what airport is closer to downtown houston",
        "comp_type": null,
        "answer": [
            "m.0136st",
            "m.01k_yv",
            "m.01kyd9",
            "m.03nr98z",
            "m.03nr9n_",
            "m.03nr9sf",
            "m.03ns7k6",
            "m.0417b3c",
            "m.04181rz",
            "m.04lf_z3",
            "m.04lg049",
            "m.04lh7kl",
            "m.04zw7jj",
            "m.0744_b",
            "m.0bgpss"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03l2n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03l2n ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.03l2n)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Houston ] )",
        "gold_entity_map": {
            "m.03l2n": "Houston"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-767",
        "question": "what city is fc schalke 04 in",
        "comp_type": null,
        "answer": [
            "m.018fc9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024_ql)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024_ql ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.024_ql))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ FC Schalke 04 ] ) )",
        "gold_entity_map": {
            "m.024_ql": "FC Schalke 04"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-769",
        "question": "where did giovanni da verrazano come from",
        "comp_type": null,
        "answer": [
            "m.0c33cs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6d2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6d2 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0k6d2)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Giovanni da Verrazzano ] )",
        "gold_entity_map": {
            "m.0k6d2": "Giovanni da Verrazzano"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-770",
        "question": "what airport is close to daytona beach florida",
        "comp_type": null,
        "answer": [
            "m.02w45sm",
            "m.03byvk1",
            "m.07jwl0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rsjf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rsjf ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.0rsjf)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Daytona Beach ] )",
        "gold_entity_map": {
            "m.0rsjf": "Daytona Beach"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-775",
        "question": "what group is aubrey o'day in",
        "comp_type": null,
        "answer": [
            "m.0134hbzj",
            "m.0dtmg6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dpd2h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dpd2h ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.group) (JOIN (R music.group_member.membership) m.0dpd2h))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , group ] ) ( JOIN ( R [ music , group member , membership ] ) [ Aubrey O'Day ] ) )",
        "gold_entity_map": {
            "m.0dpd2h": "Aubrey O'Day"
        },
        "gold_relation_map": {
            "music.group_membership.group": "music , group membership , group",
            "music.group_member.membership": "music , group member , membership"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-780",
        "question": "who invented arabic alphabet",
        "comp_type": null,
        "answer": [
            "m.05gpzl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xn6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xn6 ns:language.language_writing_system.parent_writing_systems ?x .\n}\n",
        "sexpr": "(JOIN (R language.language_writing_system.parent_writing_systems) m.0xn6)",
        "normed_sexpr": "( JOIN ( R [ language , language writing system , parent writing systems ] ) [ Arabic alphabet ] )",
        "gold_entity_map": {
            "m.0xn6": "Arabic alphabet"
        },
        "gold_relation_map": {
            "language.language_writing_system.parent_writing_systems": "language , language writing system , parent writing systems"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-781",
        "question": "where was president lyndon johnson from",
        "comp_type": null,
        "answer": [
            "m.0101sj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f7fy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f7fy ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0f7fy)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Lyndon B. Johnson ] )",
        "gold_entity_map": {
            "m.0f7fy": "Lyndon B. Johnson"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-785",
        "question": "what years did barry bonds play",
        "comp_type": null,
        "answer": [
            "m.025ygqm",
            "m.025ygws",
            "m.026fmqm",
            "m.027mvrc",
            "m.0285r5d",
            "m.02h7r_9",
            "m.02h7rz_",
            "m.02h7s0d",
            "m.02h7s15",
            "m.02h7s1b",
            "m.02h7s1z",
            "m.02h7s2l",
            "m.02h7s57",
            "m.02h7s86",
            "m.02h7s8p",
            "m.02h7sbq",
            "m.02h7sbw",
            "m.02h7sch",
            "m.02h7sct",
            "m.02h7sd8",
            "m.02h7sdf",
            "m.0dx84s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01dk_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01dk_ ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.season ?x .\n}\n",
        "sexpr": "(JOIN (R baseball.batting_statistics.season) (JOIN (R baseball.baseball_player.batting_stats) m.01dk_))",
        "normed_sexpr": "( JOIN ( R [ baseball , batting statistics , season ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Barry Bonds ] ) )",
        "gold_entity_map": {
            "m.01dk_": "Barry Bonds"
        },
        "gold_relation_map": {
            "baseball.batting_statistics.season": "baseball , batting statistics , season",
            "baseball.baseball_player.batting_stats": "baseball , baseball player , batting stats"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-786",
        "question": "who played emma frost",
        "comp_type": null,
        "answer": [
            "m.03509l",
            "m.03v1jf",
            "m.0fs1sc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.033pl2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.033pl2 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.033pl2))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Emma Frost ] ) )",
        "gold_entity_map": {
            "m.033pl2": "Emma Frost"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-788",
        "question": "what clubs has peter crouch played for",
        "comp_type": null,
        "answer": [
            "m.01cwm1",
            "m.02qhlm",
            "m.04ltf",
            "m.0bl8l",
            "m.0hvjr",
            "m.0k_l4",
            "m.0ljbg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03y5_6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03y5_6 ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.03y5_6))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Peter Crouch ] ) )",
        "gold_entity_map": {
            "m.03y5_6": "Peter Crouch"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-794",
        "question": "where is the syracuse university",
        "comp_type": null,
        "answer": [
            "m.059rby",
            "m.071cn",
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.078bz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.078bz ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.078bz)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Syracuse University ] )",
        "gold_entity_map": {
            "m.078bz": "Syracuse University"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-795",
        "question": "what has mario lopez been in",
        "comp_type": null,
        "answer": [
            "m.0261c2_",
            "m.026mcr5",
            "m.02qrsmm",
            "m.03grjz7",
            "m.03m7584",
            "m.04j2ftt",
            "m.04j2k0y",
            "m.04j301y",
            "m.05_5_22",
            "m.06plw2",
            "m.06qxnz",
            "m.09g9kh9",
            "m.09kk_4",
            "m.0c014wb",
            "m.0c3twgr",
            "m.0cs08lb",
            "m.0czc86",
            "m.0dgrklv",
            "m.0h4hl9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02w5q6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02w5q6 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.02w5q6))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Mario Lopez ] ) )",
        "gold_entity_map": {
            "m.02w5q6": "Mario Lopez"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    }
]