[
    {
        "ID": "WebQTrn-1803",
        "question": "what political party did john bell belong to",
        "comp_type": null,
        "answer": [
            "m.01s0cz",
            "m.01spy8",
            "m.02_dv1",
            "m.07wdw",
            "m.07wf9",
            "m.0d075m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035vw8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035vw8 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.035vw8))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ John Bell ] ) )",
        "gold_entity_map": {
            "m.035vw8": "John Bell"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1805",
        "question": "what religion is mary queen of scots",
        "comp_type": null,
        "answer": [
            "m.0c8wxp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.055l1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.055l1 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.055l1)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Mary, Queen of Scots ] )",
        "gold_entity_map": {
            "m.055l1": "Mary, Queen of Scots"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1807",
        "question": "where is port st johns florida",
        "comp_type": null,
        "answer": [
            "m.02xry",
            "m.09c7w0",
            "m.0jgj7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rhs4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rhs4 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0rhs4)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Port St. John ] )",
        "gold_entity_map": {
            "m.0rhs4": "Port St. John"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1808",
        "question": "what teams does kroenke own",
        "comp_type": null,
        "answer": [
            "m.01kkjq",
            "m.06x76",
            "m.0jbqf",
            "m.0jmdb",
            "m.0xbm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dg6f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dg6f6 ns:sports.sports_team_owner.teams_owned ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_owner.teams_owned) m.0dg6f6)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team owner , teams owned ] ) [ Stan Kroenke ] )",
        "gold_entity_map": {
            "m.0dg6f6": "Stan Kroenke"
        },
        "gold_relation_map": {
            "sports.sports_team_owner.teams_owned": "sports , sports team owner , teams owned"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1809",
        "question": "where was the battle of shiloh",
        "comp_type": null,
        "answer": [
            "m.07h34",
            "m.0mtch"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0127mr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0127mr ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0127mr)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of Shiloh ] )",
        "gold_entity_map": {
            "m.0127mr": "Battle of Shiloh"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1811",
        "question": "where is kate spade from",
        "comp_type": null,
        "answer": [
            "m.04f_d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bkdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bkdx ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.06bkdx)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Kate Spade ] )",
        "gold_entity_map": {
            "m.06bkdx": "Kate Spade"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1812",
        "question": "what countries are in the caribbean",
        "comp_type": null,
        "answer": [
            "m.0162v",
            "m.0168t",
            "m.02phy_9",
            "m.05byy",
            "m.05r7t",
            "m.06ryl",
            "m.06s0l",
            "m.0bwhs8r",
            "m.0n3g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261m ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.0261m))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Caribbean ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.0261m": "Caribbean"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-1815",
        "question": "what party was woodrow wilson from",
        "comp_type": null,
        "answer": [
            "m.0d075m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083q7 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.083q7))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Woodrow Wilson ] ) )",
        "gold_entity_map": {
            "m.083q7": "Woodrow Wilson"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1818",
        "question": "what did ben hall do",
        "comp_type": null,
        "answer": [
            "m.0fckr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08sx40)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08sx40 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.08sx40)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Ben Hall ] )",
        "gold_entity_map": {
            "m.08sx40": "Ben Hall"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1825",
        "question": "what division did the baltimore colts play in",
        "comp_type": null,
        "answer": [
            "m.068g_2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03wnh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03wnh ns:american_football.football_team.division ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.division) m.03wnh)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , division ] ) [ Indianapolis Colts ] )",
        "gold_entity_map": {
            "m.03wnh": "Indianapolis Colts"
        },
        "gold_relation_map": {
            "american_football.football_team.division": "american football , football team , division"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1830",
        "question": "what ethnicity are people from iran",
        "comp_type": null,
        "answer": [
            "m.03nvq",
            "m.09743",
            "m.09f5v",
            "m.0bymc",
            "m.0c29q8",
            "m.0h9bz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04nrnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04nrnz ns:people.ethnicity.includes_groups ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.includes_groups) m.04nrnz)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , includes groups ] ) [ Iranian peoples ] )",
        "gold_entity_map": {
            "m.04nrnz": "Iranian peoples"
        },
        "gold_relation_map": {
            "people.ethnicity.includes_groups": "people , ethnicity , includes groups"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1836",
        "question": "what country did francis drake represent",
        "comp_type": null,
        "answer": [
            "m.024pcx",
            "m.02jx1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.031t2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.031t2 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.031t2)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Francis Drake ] )",
        "gold_entity_map": {
            "m.031t2": "Francis Drake"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1837",
        "question": "what timezone is indianapolis indiana in",
        "comp_type": null,
        "answer": [
            "m.02hcv8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ftxw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ftxw ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0ftxw)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Indianapolis ] )",
        "gold_entity_map": {
            "m.0ftxw": "Indianapolis"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1840",
        "question": "what books did lincoln write",
        "comp_type": null,
        "answer": [
            "m.05c_79h",
            "m.05c_f7l",
            "m.05yq8nb",
            "m.066yn4z",
            "m.0673mv3",
            "m.068b0v9",
            "m.068nrrf",
            "m.069bhf3",
            "m.06cygqy",
            "m.06dyrpv",
            "m.06fl0v_",
            "m.06g06ld",
            "m.06g1chq",
            "m.06g3j11",
            "m.06gqt1k",
            "m.06hmfmc",
            "m.06hn5dd",
            "m.06j5xzx",
            "m.06kjp__",
            "m.06krc3w",
            "m.06l5jgq",
            "m.06lt3v9",
            "m.06mgy7c",
            "m.06mngvt",
            "m.06mzpmv",
            "m.06n0txx",
            "m.06ncmyq",
            "m.06q__t8",
            "m.06rlzdx",
            "m.06v7q2v",
            "m.06vlrpv",
            "m.0bhjd84",
            "m.0bhjd87",
            "m.0bhjd8b",
            "m.0bhjd8f",
            "m.0bhjd8j",
            "m.0bqqy7y",
            "m.0bqqy82",
            "m.0bqqy87",
            "m.0bqqy8d",
            "m.0bqqy8k",
            "m.0bqqy8q",
            "m.0c1t0dg",
            "m.0c1t0dk",
            "m.0c1t0dn",
            "m.0c1t0dr",
            "m.0c1t0dv",
            "m.0c1t0dy",
            "m.0c1t0f0",
            "m.0c1t0f3",
            "m.0c1t0f6",
            "m.0c1t0f9",
            "m.0c1t0fd",
            "m.0c1t0fh",
            "m.0c1t0fl",
            "m.0c1t0fp",
            "m.0c1t0fs",
            "m.0c1t0fw",
            "m.0c1t0fz",
            "m.0c1t0g1",
            "m.0c1t0g4",
            "m.0c1t0g7",
            "m.0c1t0gb",
            "m.0c1t0gf",
            "m.0c1t0gj",
            "m.0c1t0gm",
            "m.0c1t0gq",
            "m.0chv00",
            "m.0py1qgr",
            "m.0y4kc50"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.0gzh)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Abraham Lincoln ] )",
        "gold_entity_map": {
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1842",
        "question": "what did corey haim act in",
        "comp_type": null,
        "answer": [
            "m.016kmf",
            "m.02vn90b",
            "m.02xb1zf",
            "m.031ssn",
            "m.034vk8",
            "m.036k42",
            "m.03gtwh_",
            "m.04gph00",
            "m.05g12v",
            "m.06zn6ky",
            "m.07x6zk",
            "m.080cw8",
            "m.08c18v",
            "m.08cjtf",
            "m.09bdph",
            "m.09bfrf",
            "m.09djr_",
            "m.09gqhc",
            "m.09hd1l",
            "m.09jkqt",
            "m.09jlst",
            "m.09jnbv",
            "m.09jnjc",
            "m.09kk_4",
            "m.09kktv",
            "m.09kml0",
            "m.09kpss",
            "m.09kq4h",
            "m.09kqbg",
            "m.09kqwb",
            "m.09kv40",
            "m.09kvhc",
            "m.09lfqv",
            "m.0b6h4fc",
            "m.0b8s869",
            "m.0bv8vqd",
            "m.0bwhk07",
            "m.0h0znl7",
            "m.0h4yh2k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kyn0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kyn0 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.01kyn0))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Corey Haim ] ) )",
        "gold_entity_map": {
            "m.01kyn0": "Corey Haim"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1843",
        "question": "who is the publisher of the wall street journal",
        "comp_type": null,
        "answer": [
            "m.0clj7",
            "m.0sxdg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017b3j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017b3j ns:book.newspaper.owner ?x .\n}\n",
        "sexpr": "(JOIN (R book.newspaper.owner) m.017b3j)",
        "normed_sexpr": "( JOIN ( R [ book , newspaper , owner ] ) [ The Wall Street Journal ] )",
        "gold_entity_map": {
            "m.017b3j": "The Wall Street Journal"
        },
        "gold_relation_map": {
            "book.newspaper.owner": "book , newspaper , owner"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1845",
        "question": "what do tibetan people speak",
        "comp_type": null,
        "answer": [
            "m.01kbdv",
            "m.01r2l",
            "m.02hx61y",
            "m.02hx8f0",
            "m.064r7fk",
            "m.0h0t4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l0ty)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l0ty ns:people.ethnicity.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.languages_spoken) m.01l0ty)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Tibetan people ] )",
        "gold_entity_map": {
            "m.01l0ty": "Tibetan people"
        },
        "gold_relation_map": {
            "people.ethnicity.languages_spoken": "people , ethnicity , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1846",
        "question": "what form of government does afghanistan have",
        "comp_type": null,
        "answer": [
            "m.01fgl7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jdd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jdd ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.0jdd)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Afghanistan ] )",
        "gold_entity_map": {
            "m.0jdd": "Afghanistan"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1848",
        "question": "what position did john stockton play",
        "comp_type": null,
        "answer": [
            "m.02sf_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r6lw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r6lw ns:basketball.basketball_player.position_s ?x .\n}\n",
        "sexpr": "(JOIN (R basketball.basketball_player.position_s) m.01r6lw)",
        "normed_sexpr": "( JOIN ( R [ basketball , basketball player , position s ] ) [ John Stockton ] )",
        "gold_entity_map": {
            "m.01r6lw": "John Stockton"
        },
        "gold_relation_map": {
            "basketball.basketball_player.position_s": "basketball , basketball player , position s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1852",
        "question": "who played bernie focker",
        "comp_type": null,
        "answer": [
            "m.0bl2g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.087gyr3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.087gyr3 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.087gyr3))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Bernie Focker ] ) )",
        "gold_entity_map": {
            "m.087gyr3": "Bernie Focker"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1856",
        "question": "where is universal studios california theme park",
        "comp_type": null,
        "answer": [
            "m.0285tn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qsy8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qsy8 ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R location.location.containedby) m.05qsy8))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ location , location , containedby ] ) [ Universal Studios Hollywood ] ) )",
        "gold_entity_map": {
            "m.05qsy8": "Universal Studios Hollywood",
            "m.01m9": "City/Town/Village"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-1857",
        "question": "where the grimm brothers were born",
        "comp_type": null,
        "answer": [
            "m.028_0l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.046nx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.046nx ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.046nx)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jacob Grimm ] )",
        "gold_entity_map": {
            "m.046nx": "Jacob Grimm"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1858",
        "question": "what sport is popular in china",
        "comp_type": null,
        "answer": [
            "m.026p73l",
            "m.026wfcr",
            "m.02p_3xb",
            "m.02r4hn_",
            "m.02v_s16",
            "m.03c1v2g",
            "m.03d1rtp",
            "m.03gt8qn",
            "m.03lygq",
            "m.03qhjj9",
            "m.03qhjys",
            "m.03tx5m",
            "m.03ylztx",
            "m.04_12zx",
            "m.043rwjh",
            "m.04gqs4t",
            "m.04gwb2l",
            "m.04mz1tr",
            "m.04n0n07",
            "m.04n43m5",
            "m.04n4zfv",
            "m.04n53nh",
            "m.04n5qgw",
            "m.04qbn26",
            "m.051xccw",
            "m.0521w0d",
            "m.05p_j5",
            "m.05q1_v",
            "m.05q1wm",
            "m.05q21y",
            "m.05q230",
            "m.05q24s",
            "m.05q264",
            "m.05q26v",
            "m.05q27j",
            "m.05q2bb",
            "m.05q2d5",
            "m.05qdgz",
            "m.069_v9b",
            "m.074zsw",
            "m.08x_xh",
            "m.0bwvnm",
            "m.0gczkp",
            "m.0glgx6",
            "m.0h31g8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05w3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05w3 ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.0d05w3)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ China ] )",
        "gold_entity_map": {
            "m.0d05w3": "China"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1863",
        "question": "who made the ancient egyptian pyramids",
        "comp_type": null,
        "answer": [
            "m.0kg9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036mk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036mk ns:base.worldwonders.ancient_wonder.wonder_creator ?x .\n}\n",
        "sexpr": "(JOIN (R base.worldwonders.ancient_wonder.wonder_creator) m.036mk)",
        "normed_sexpr": "( JOIN ( R [ base , worldwonders , ancient wonder , wonder creator ] ) [ Great Pyramid of Giza ] )",
        "gold_entity_map": {
            "m.036mk": "Great Pyramid of Giza"
        },
        "gold_relation_map": {
            "base.worldwonders.ancient_wonder.wonder_creator": "base , worldwonders , ancient wonder , wonder creator"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1865",
        "question": "where did the san diego chargers originate",
        "comp_type": null,
        "answer": [
            "m.06mprtt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rpd ns:sports.sports_team.previously_known_as ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.previously_known_as) m.06rpd)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , previously known as ] ) [ San Diego Chargers ] )",
        "gold_entity_map": {
            "m.06rpd": "San Diego Chargers"
        },
        "gold_relation_map": {
            "sports.sports_team.previously_known_as": "sports , sports team , previously known as"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1868",
        "question": "who was king george v father",
        "comp_type": null,
        "answer": [
            "m.0cm03"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cmpn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cmpn ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.0cmpn))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ George V ] ) )",
        "gold_entity_map": {
            "m.0cmpn": "George V",
            "m.05zppz": "Male"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1873",
        "question": "what happened to nagasaki",
        "comp_type": null,
        "answer": [
            "m.010s1gny",
            "m.035jnk",
            "m.0czc6wq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05gqf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05gqf ns:location.location.events ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.events) m.05gqf)",
        "normed_sexpr": "( JOIN ( R [ location , location , events ] ) [ Nagasaki ] )",
        "gold_entity_map": {
            "m.05gqf": "Nagasaki"
        },
        "gold_relation_map": {
            "location.location.events": "location , location , events"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1875",
        "question": "what movies did james franco play in",
        "comp_type": null,
        "answer": [
            "g.11b7f0w03f",
            "g.11b7k0v3hq",
            "m.010pdd45",
            "m.010qclb4",
            "m.0125_5q5",
            "m.012s1d",
            "m.0135_65p",
            "m.026_5f7",
            "m.027bbtg",
            "m.02825nf",
            "m.02vmj_0",
            "m.02wgk1",
            "m.031dtk",
            "m.0340hj",
            "m.03c3tpw",
            "m.03hkch7",
            "m.0411ygx",
            "m.04j0plv",
            "m.04mzkcp",
            "m.04p2fy8",
            "m.06ksnc",
            "m.073cyc",
            "m.073f2t",
            "m.07k8rt4",
            "m.07kdkfj",
            "m.07kg878",
            "m.080lkt7",
            "m.0830vk",
            "m.0907zk",
            "m.09gb_4p",
            "m.09v_zl",
            "m.09v54x",
            "m.0bbd8t9",
            "m.0bppn_",
            "m.0btyf5z",
            "m.0bvn25",
            "m.0c34n5",
            "m.0crrmdj",
            "m.0crthhx",
            "m.0crtslz",
            "m.0crw8tk",
            "m.0crxlns",
            "m.0ct37m0",
            "m.0dk297",
            "m.0dk937",
            "m.0dqcs3",
            "m.0fvbd5",
            "m.0g57n3s",
            "m.0g7pm1",
            "m.0g9_64m",
            "m.0ghhrl8",
            "m.0gjcnch",
            "m.0gwz9sl",
            "m.0gx160j",
            "m.0gxbc__",
            "m.0gxbcvz",
            "m.0gxbcw8",
            "m.0gxbd09",
            "m.0gxbd16",
            "m.0gxbd1r",
            "m.0gysshc",
            "m.0gywj6f",
            "m.0gz5fq",
            "m.0h25k5l",
            "m.0hn8s1j",
            "m.0hr256b",
            "m.0hz4j2j",
            "m.0j2b8qf",
            "m.0jmx259",
            "m.0n05bkp",
            "m.0nfljp9",
            "m.0ngns90",
            "m.0ngxr14",
            "m.0ngxr4w",
            "m.0q2lm3f",
            "m.0t51133",
            "m.0tl4n6t",
            "m.0v1zf3t",
            "m.0v25xrh",
            "m.0v26gl_",
            "m.0v275l3",
            "m.0v39cn4",
            "m.0w1fbk2",
            "m.0w4swb_",
            "m.0ztkpwz",
            "m.0zwqnxs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05bnp0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05bnp0 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.05bnp0))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ James Franco ] ) )",
        "gold_entity_map": {
            "m.05bnp0": "James Franco"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    }
]