[
    {
        "ID": "WebQTrn-3563",
        "question": "where to go in florida for vacation",
        "comp_type": null,
        "answer": [
            "m.02zjt1",
            "m.0b6d60t",
            "m.0dl60w",
            "m.0n53kv5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02xry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02xry ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.02xry)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Florida ] )",
        "gold_entity_map": {
            "m.02xry": "Florida"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3566",
        "question": "who plays shao kahn",
        "comp_type": null,
        "answer": [
            "m.02gf_l",
            "m.0f702q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.037btz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.037btz ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.037btz))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Shao Kahn ] ) )",
        "gold_entity_map": {
            "m.037btz": "Shao Kahn"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3567",
        "question": "what did douglas engelbart invent",
        "comp_type": null,
        "answer": [
            "m.020lf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027_g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027_g ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.027_g)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ Douglas Engelbart ] )",
        "gold_entity_map": {
            "m.027_g": "Douglas Engelbart"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3568",
        "question": "where did chef chuck hughes go to school",
        "comp_type": null,
        "answer": [
            "m.01s7pm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06kj3z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06kj3z ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.06kj3z))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Chuck Hughes ] ) )",
        "gold_entity_map": {
            "m.06kj3z": "Chuck Hughes"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3569",
        "question": "who plays marvin eriksen",
        "comp_type": null,
        "answer": [
            "m.01x0sy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nf3nb6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nf3nb6 ns:tv.tv_character.appeared_in_tv_episodes ?y .\n?y ns:tv.tv_guest_role.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.tv_guest_role.actor) (JOIN (R tv.tv_character.appeared_in_tv_episodes) m.0nf3nb6))",
        "normed_sexpr": "( JOIN ( R [ tv , tv guest role , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv episodes ] ) [ Marvin Eriksen Sr. ] ) )",
        "gold_entity_map": {
            "m.0nf3nb6": "Marvin Eriksen Sr."
        },
        "gold_relation_map": {
            "tv.tv_character.appeared_in_tv_episodes": "tv , tv character , appeared in tv episodes",
            "tv.tv_guest_role.actor": "tv , tv guest role , actor"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3571",
        "question": "where is fiat abarth made",
        "comp_type": null,
        "answer": [
            "m.07mgr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j4r5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j4r5 ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.0j4r5))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Abarth ] ) )",
        "gold_entity_map": {
            "m.0j4r5": "Abarth"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3572",
        "question": "where was tommy steele born",
        "comp_type": null,
        "answer": [
            "m.0n8y8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01np2lh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01np2lh ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01np2lh)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Tommy Steele ] )",
        "gold_entity_map": {
            "m.01np2lh": "Tommy Steele"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3573",
        "question": "what does chad michael murray play in",
        "comp_type": null,
        "answer": [
            "m.0_gbp0r",
            "m.01067b9q",
            "m.011c9f76",
            "m.02cxj_",
            "m.02rhlv1",
            "m.060v34",
            "m.06y60c",
            "m.0c015zb",
            "m.0dgs3mp",
            "m.0f9x7r",
            "m.0fpjb4z",
            "m.0ft693q",
            "m.0ghghlt",
            "m.0gxw8cp",
            "m.0h_cvyh",
            "m.0pcfg64",
            "m.0q2lh3h",
            "m.0vplztk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bmn4p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bmn4p ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0bmn4p))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Chad Michael Murray ] ) )",
        "gold_entity_map": {
            "m.0bmn4p": "Chad Michael Murray"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3575",
        "question": "what are some important events in ancient egypt",
        "comp_type": null,
        "answer": [
            "m.01qq1q",
            "m.01wc29",
            "m.02sl7g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kg9 ns:location.location.events ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.events) m.0kg9)",
        "normed_sexpr": "( JOIN ( R [ location , location , events ] ) [ Ancient Egypt ] )",
        "gold_entity_map": {
            "m.0kg9": "Ancient Egypt"
        },
        "gold_relation_map": {
            "location.location.events": "location , location , events"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3579",
        "question": "where are you if you're in khartoum",
        "comp_type": null,
        "answer": [
            "m.06tw8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04d_m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04d_m ns:base.biblioness.bibs_location.country ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.country) m.04d_m)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Khartoum ] )",
        "gold_entity_map": {
            "m.04d_m": "Khartoum"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.country": "base , biblioness , bibs location , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3580",
        "question": "where did fred west work",
        "comp_type": null,
        "answer": [
            "m.02vk771"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01cjf6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01cjf6 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01cjf6)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Fred West ] )",
        "gold_entity_map": {
            "m.01cjf6": "Fred West"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3586",
        "question": "what nestle owns",
        "comp_type": null,
        "answer": [
            "m.02vjn0",
            "m.03q9wy3",
            "m.03q9x41",
            "m.03q9x47",
            "m.03qtd73",
            "m.03qtd7r",
            "m.03qtd9w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01556g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01556g ns:business.business_operation.industry ?x .\n}\n",
        "sexpr": "(JOIN (R business.business_operation.industry) m.01556g)",
        "normed_sexpr": "( JOIN ( R [ business , business operation , industry ] ) [ Nestlé ] )",
        "gold_entity_map": {
            "m.01556g": "Nestlé"
        },
        "gold_relation_map": {
            "business.business_operation.industry": "business , business operation , industry"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3589",
        "question": "where does the st. joe river start",
        "comp_type": null,
        "answer": [
            "m.02p3sy_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02809z6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02809z6 ns:geography.river.origin ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.origin) m.02809z6)",
        "normed_sexpr": "( JOIN ( R [ geography , river , origin ] ) [ Saint Joe River ] )",
        "gold_entity_map": {
            "m.02809z6": "Saint Joe River"
        },
        "gold_relation_map": {
            "geography.river.origin": "geography , river , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3592",
        "question": "when does nasdaq start trading",
        "comp_type": null,
        "answer": [
            "1971-02-04"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dq_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dq_ ns:organization.organization.date_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.date_founded) m.05dq_)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , date founded ] ) [ NASDAQ ] )",
        "gold_entity_map": {
            "m.05dq_": "NASDAQ"
        },
        "gold_relation_map": {
            "organization.organization.date_founded": "organization , organization , date founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3597",
        "question": "what language do they speak in guyana south america",
        "comp_type": null,
        "answer": [
            "m.02h40lc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034m8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034m8 ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.034m8)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Guyana ] )",
        "gold_entity_map": {
            "m.034m8": "Guyana"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3598",
        "question": "what year were the new york yankees established",
        "comp_type": null,
        "answer": [
            "1901"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cqt41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cqt41 ns:sports.sports_team.founded ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.founded) m.0cqt41)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , founded ] ) [ New York Yankees ] )",
        "gold_entity_map": {
            "m.0cqt41": "New York Yankees"
        },
        "gold_relation_map": {
            "sports.sports_team.founded": "sports , sports team , founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3600",
        "question": "what city was nelson mandela born in",
        "comp_type": null,
        "answer": [
            "m.02q_z4c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g7q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g7q ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R people.person.place_of_birth) m.05g7q))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Nelson Mandela ] ) )",
        "gold_entity_map": {
            "m.05g7q": "Nelson Mandela",
            "m.01m9": "City/Town/Village"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-3603",
        "question": "what did frankie lymon die from",
        "comp_type": null,
        "answer": [
            "m.02kp1qn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mlkv5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mlkv5 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01mlkv5)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Frankie Lymon ] )",
        "gold_entity_map": {
            "m.01mlkv5": "Frankie Lymon"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3606",
        "question": "what was matthias schleiden known for",
        "comp_type": null,
        "answer": [
            "m.02h6p1f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dd3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dd3q ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0dd3q)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Matthias Jakob Schleiden ] )",
        "gold_entity_map": {
            "m.0dd3q": "Matthias Jakob Schleiden"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3607",
        "question": "what country was jesus born",
        "comp_type": null,
        "answer": [],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.045m1_ ns:people.person.place_of_birth ?y . # Jesus\n  ?y ns:location.location.containedby ?x .\n  ?x ns:common.topic.notable_types ns:m.01mp . # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.045m1_": "Jesus Christ",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-3609",
        "question": "who is kristen stewart parents",
        "comp_type": null,
        "answer": [
            "m.07sggh4",
            "m.07sgghb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07swvb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07swvb ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.07swvb)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Kristen Stewart ] )",
        "gold_entity_map": {
            "m.07swvb": "Kristen Stewart"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3612",
        "question": "what is kate spade",
        "comp_type": null,
        "answer": [
            "m.02hqyhw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bkdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bkdx ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.06bkdx)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Kate Spade ] )",
        "gold_entity_map": {
            "m.06bkdx": "Kate Spade"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3616",
        "question": "where is louisville ne",
        "comp_type": null,
        "answer": [
            "m.05fhy",
            "m.0n7q7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x50_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x50_ ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0x50_)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Louisville ] )",
        "gold_entity_map": {
            "m.0x50_": "Louisville"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3625",
        "question": "where is united arab located",
        "comp_type": null,
        "answer": [
            "m.0150_4",
            "m.02qkt",
            "m.02rm8kw",
            "m.04wsz",
            "m.0cvmv",
            "m.0j0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j1z8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j1z8 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0j1z8)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ United Arab Emirates ] )",
        "gold_entity_map": {
            "m.0j1z8": "United Arab Emirates"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3628",
        "question": "what is duncan bannatyne",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.015cjr",
            "m.025sppp",
            "m.02hrh1q",
            "m.09x_r",
            "m.0dypbr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bw7qg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bw7qg ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0bw7qg)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Duncan Bannatyne ] )",
        "gold_entity_map": {
            "m.0bw7qg": "Duncan Bannatyne"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3630",
        "question": "when did bradley cooper 's dad die",
        "comp_type": null,
        "answer": [
            "2011"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.01_xtx ns:people.person.parents ?y . # Bradley Cooper\n  ?y ns:people.person.gender ns:m.05zppz . # Male\n  ?y ns:people.deceased_person.date_of_death ?x .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01_xtx": "Bradley Cooper",
            "m.05zppz": "Male"
        },
        "gold_relation_map": {
            "people.deceased_person.date_of_death": "people , deceased person , date of death",
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3632",
        "question": "what to do in perth scotland",
        "comp_type": null,
        "answer": [
            "m.02qpplk",
            "m.05_5q3x",
            "m.05skl2",
            "m.06zpxmh",
            "m.0bh99kx",
            "m.0ck07z",
            "m.0dfrjw",
            "m.0h7qg7",
            "m.0k6_2rk",
            "m.0k6_2s0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g133)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g133 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0g133)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Perth ] )",
        "gold_entity_map": {
            "m.0g133": "Perth"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3641",
        "question": "where did president andrew jackson grew up",
        "comp_type": null,
        "answer": [
            "m.054qtk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rlz ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0rlz)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Andrew Jackson ] )",
        "gold_entity_map": {
            "m.0rlz": "Andrew Jackson"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3644",
        "question": "where the murray river located",
        "comp_type": null,
        "answer": [
            "m.09pkq0",
            "m.0chghy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_4l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_4l ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.04_4l)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Murray River ] )",
        "gold_entity_map": {
            "m.04_4l": "Murray River"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3649",
        "question": "what year did reggie bush get drafted",
        "comp_type": null,
        "answer": [
            "m.09l0x9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cb70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cb70 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.05cb70))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Reggie Bush ] ) )",
        "gold_entity_map": {
            "m.05cb70": "Reggie Bush"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3650",
        "question": "what was sherlock holmes famous for",
        "comp_type": null,
        "answer": [
            "m.011__xll"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rkl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rkl ns:fictional_universe.fictional_character.occupation ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.occupation) m.06rkl)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , occupation ] ) [ Sherlock Holmes ] )",
        "gold_entity_map": {
            "m.06rkl": "Sherlock Holmes"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.occupation": "fictional universe , fictional character , occupation"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3653",
        "question": "who is roger bacon inventor of",
        "comp_type": null,
        "answer": [
            "m.030c3d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06g98)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06g98 ns:law.inventor.inventions ?x .\n}\n",
        "sexpr": "(JOIN (R law.inventor.inventions) m.06g98)",
        "normed_sexpr": "( JOIN ( R [ law , inventor , inventions ] ) [ Roger Bacon ] )",
        "gold_entity_map": {
            "m.06g98": "Roger Bacon"
        },
        "gold_relation_map": {
            "law.inventor.inventions": "law , inventor , inventions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3655",
        "question": "what city was woodstock held in",
        "comp_type": null,
        "answer": [
            "m.0y9lg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.085kv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.085kv ns:time.event.locations ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R time.event.locations) m.085kv))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ time , event , locations ] ) [ Woodstock ] ) )",
        "gold_entity_map": {
            "m.085kv": "Woodstock",
            "m.01m9": "City/Town/Village"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-3657",
        "question": "what was one thing benjamin franklin is famous for",
        "comp_type": null,
        "answer": [
            "m.029mmz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:base.argumentmaps.innovator.original_ideas ?x .\n}\n",
        "sexpr": "(JOIN (R base.argumentmaps.innovator.original_ideas) m.019fz)",
        "normed_sexpr": "( JOIN ( R [ base , argumentmaps , innovator , original ideas ] ) [ Benjamin Franklin ] )",
        "gold_entity_map": {
            "m.019fz": "Benjamin Franklin"
        },
        "gold_relation_map": {
            "base.argumentmaps.innovator.original_ideas": "base , argumentmaps , innovator , original ideas"
        },
        "gold_type_map": {}
    }
]