[
    {
        "ID": "WebQTrn-3660",
        "question": "who started southwest airlines",
        "comp_type": null,
        "answer": [
            "m.03wk_6",
            "m.047pxff"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gztl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gztl ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.0gztl)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Southwest Airlines ] )",
        "gold_entity_map": {
            "m.0gztl": "Southwest Airlines"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3664",
        "question": "who is abraham descended from",
        "comp_type": null,
        "answer": [
            "m.0j0hf",
            "m.0pkp466"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pwb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pwb ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.0pwb)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Abraham ] )",
        "gold_entity_map": {
            "m.0pwb": "Abraham"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3665",
        "question": "what did atticus finch do",
        "comp_type": null,
        "answer": [
            "m.04gc2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pk0sd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pk0sd ns:fictional_universe.fictional_character.occupation ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.occupation) m.02pk0sd)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , occupation ] ) [ Atticus Finch ] )",
        "gold_entity_map": {
            "m.02pk0sd": "Atticus Finch"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.occupation": "fictional universe , fictional character , occupation"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3668",
        "question": "what language does people in france speak",
        "comp_type": null,
        "answer": [
            "m.017k6",
            "m.01m69",
            "m.01pr4b",
            "m.0247v",
            "m.02ckss",
            "m.02cw59",
            "m.02hrcsr",
            "m.02hwllm",
            "m.02hx2bx",
            "m.02jcw",
            "m.02y3v",
            "m.033bw8",
            "m.04k39q",
            "m.05l0r",
            "m.064_8sq",
            "m.09hw0w",
            "m.0l2r0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0f8l9c)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ France ] )",
        "gold_entity_map": {
            "m.0f8l9c": "France"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3669",
        "question": "where is the spratly islands located",
        "comp_type": null,
        "answer": [
            "m.0j0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06trw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06trw ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.06trw)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Spratly Islands ] )",
        "gold_entity_map": {
            "m.06trw": "Spratly Islands"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3670",
        "question": "where did hammurabi come from",
        "comp_type": null,
        "answer": [
            "m.01cyh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03qlj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03qlj ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.03qlj)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Hammurabi ] )",
        "gold_entity_map": {
            "m.03qlj": "Hammurabi"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3675",
        "question": "where is st helens park nsw",
        "comp_type": null,
        "answer": [
            "m.05fly"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07pbxd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07pbxd ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.07pbxd)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ St Helens Park ] )",
        "gold_entity_map": {
            "m.07pbxd": "St Helens Park"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3676",
        "question": "who killed david ruffin",
        "comp_type": null,
        "answer": [
            "m.01tf_6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qh81)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qh81 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.04qh81)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ David Ruffin ] )",
        "gold_entity_map": {
            "m.04qh81": "David Ruffin"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3678",
        "question": "what is d capital city of south africa",
        "comp_type": null,
        "answer": [
            "m.01yj2",
            "m.067z4",
            "m.0c499"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.0hzlz)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ South Africa ] )",
        "gold_entity_map": {
            "m.0hzlz": "South Africa"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3684",
        "question": "who owns the sf giants owner",
        "comp_type": null,
        "answer": [
            "m.03cyzbv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0713r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0713r ns:sports.professional_sports_team.owner_s ?x .\n}\n",
        "sexpr": "(JOIN (R sports.professional_sports_team.owner_s) m.0713r)",
        "normed_sexpr": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ San Francisco Giants ] )",
        "gold_entity_map": {
            "m.0713r": "San Francisco Giants"
        },
        "gold_relation_map": {
            "sports.professional_sports_team.owner_s": "sports , professional sports team , owner s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3686",
        "question": "what is the capital of kentucky known for its bluegrass",
        "comp_type": null,
        "answer": [
            "m.0fvvg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0498y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0498y ns:location.us_state.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.us_state.capital) m.0498y)",
        "normed_sexpr": "( JOIN ( R [ location , us state , capital ] ) [ Kentucky ] )",
        "gold_entity_map": {
            "m.0498y": "Kentucky"
        },
        "gold_relation_map": {
            "location.us_state.capital": "location , us state , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3702",
        "question": "who voices lola bunny in looney tunes",
        "comp_type": null,
        "answer": [
            "m.024my5",
            "m.0fm5ld"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0534r8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0534r8 ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0534r8))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Lola Bunny ] ) )",
        "gold_entity_map": {
            "m.0534r8": "Lola Bunny"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3708",
        "question": "what is jonathan swift famous for",
        "comp_type": null,
        "answer": [
            "m.02449y",
            "m.02xhgwq",
            "m.05xjb",
            "m.05z96",
            "m.0cbd2",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_dj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_dj ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03_dj)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Jonathan Swift ] )",
        "gold_entity_map": {
            "m.03_dj": "Jonathan Swift"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3713",
        "question": "when is the diwali festival",
        "comp_type": null,
        "answer": [
            "m.04rc2q7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fpj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fpj ns:time.holiday.day_of_year ?x .\n}\n",
        "sexpr": "(JOIN (R time.holiday.day_of_year) m.019fpj)",
        "normed_sexpr": "( JOIN ( R [ time , holiday , day of year ] ) [ Diwali ] )",
        "gold_entity_map": {
            "m.019fpj": "Diwali"
        },
        "gold_relation_map": {
            "time.holiday.day_of_year": "time , holiday , day of year"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3716",
        "question": "what did hitler do bad",
        "comp_type": null,
        "answer": [
            "m.0148d",
            "m.05hyf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:base.activism.activist.area_of_activism ?x .\n}\n",
        "sexpr": "(JOIN (R base.activism.activist.area_of_activism) m.07_m9_)",
        "normed_sexpr": "( JOIN ( R [ base , activism , activist , area of activism ] ) [ Adolf Hitler ] )",
        "gold_entity_map": {
            "m.07_m9_": "Adolf Hitler"
        },
        "gold_relation_map": {
            "base.activism.activist.area_of_activism": "base , activism , activist , area of activism"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3717",
        "question": "where is murray kentucky",
        "comp_type": null,
        "answer": [
            "m.0nnqt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0td1z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0td1z ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0td1z)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Murray ] )",
        "gold_entity_map": {
            "m.0td1z": "Murray"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3719",
        "question": "where is mount vernon texas",
        "comp_type": null,
        "answer": [
            "m.0mrrn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0101gj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0101gj ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0101gj)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Mount Vernon ] )",
        "gold_entity_map": {
            "m.0101gj": "Mount Vernon"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3725",
        "question": "what guitar does duane allman play",
        "comp_type": null,
        "answer": [
            "m.02j9dp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01qyy3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01qyy3 ns:music.guitarist.guitars_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.guitarist.guitars_played) m.01qyy3)",
        "normed_sexpr": "( JOIN ( R [ music , guitarist , guitars played ] ) [ Duane Allman ] )",
        "gold_entity_map": {
            "m.01qyy3": "Duane Allman"
        },
        "gold_relation_map": {
            "music.guitarist.guitars_played": "music , guitarist , guitars played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3734",
        "question": "what party did paul keating belong to",
        "comp_type": null,
        "answer": [
            "m.0q96"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05y28)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05y28 ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.05y28))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Paul Keating ] ) )",
        "gold_entity_map": {
            "m.05y28": "Paul Keating"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3735",
        "question": "what book did w.e.b. dubois wrote",
        "comp_type": null,
        "answer": [
            "m.04txj55",
            "m.04txj5m",
            "m.04txj61",
            "m.04txj6h",
            "m.04txj6y",
            "m.04txj7c",
            "m.04txj7t",
            "m.04txj87",
            "m.04txj8p",
            "m.04txj8z",
            "m.04v16rg",
            "m.04v16ry",
            "m.04v16sp",
            "m.04v16t4",
            "m.04v16td",
            "m.04v16tw",
            "m.04v16v4",
            "m.04v16vf",
            "m.04v16vp",
            "m.04v16w4",
            "m.04v16wf",
            "m.04v16wy",
            "m.04v16x6",
            "m.04v16xr",
            "m.04v189_",
            "m.04v18cd",
            "m.04v18cz",
            "m.04v18df",
            "m.04v18dw",
            "m.04v18fb",
            "m.04v18ft",
            "m.04v1cq7",
            "m.04v1cqr",
            "m.04v1cr6",
            "m.04v1csx",
            "m.04v1ct4",
            "m.04v1ctd",
            "m.04v1ctw",
            "m.04v1cv3",
            "m.04v1cvd",
            "m.04v1cvn",
            "m.04v1cvy",
            "m.04v1cyb",
            "m.04vkbvg",
            "m.04vkbvr",
            "m.04vkbw0",
            "m.04vkbwh",
            "m.04vkbwz",
            "m.04vkbx7",
            "m.04vkbyy",
            "m.04vkg4x",
            "m.04vkg5x",
            "m.04vkhsq",
            "m.04vtrpc",
            "m.04vtrpv",
            "m.04vtrqb",
            "m.04vtrql",
            "m.04vtrqw",
            "m.04vtrrl",
            "m.04vtrrv",
            "m.04vtrs9",
            "m.04vtrtc",
            "m.04vtrtv",
            "m.04vtrzg",
            "m.04vts1k",
            "m.04vts20",
            "m.04vts2b",
            "m.04vts2m",
            "m.04vts32",
            "m.04vts3c",
            "m.04vts3z",
            "m.04vts4f",
            "m.04vts4q",
            "m.04vts55",
            "m.04vts5n",
            "m.04vts6y",
            "m.04vtsmt",
            "m.04vtsn8",
            "m.04vtsnr",
            "m.04vtsp6",
            "m.04vtspp",
            "m.04vtsq4",
            "m.04vtsqg",
            "m.04vtsrq",
            "m.059cl2m",
            "m.059cl3f",
            "m.059cl3y",
            "m.059cl4f",
            "m.059cl4y",
            "m.059cl5f",
            "m.059cl5q",
            "m.059cl60",
            "m.059cl6b",
            "m.059cl6m",
            "m.059cl6y",
            "m.059cl77",
            "m.059cl7j",
            "m.059cl7v",
            "m.059cl84",
            "m.059cl8l",
            "m.059cl8y",
            "m.059cl9d",
            "m.059cl9x",
            "m.059clbd",
            "m.059clbx",
            "m.059clcd",
            "m.059clcx",
            "m.059cldd",
            "m.059cldx",
            "m.059clf5",
            "m.059clfg",
            "m.059clfr",
            "m.059clg2",
            "m.059clgc",
            "m.059clgp",
            "m.059clgz",
            "m.059clh8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mddq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mddq ns:book.author.book_editions_published ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.book_editions_published) m.0mddq)",
        "normed_sexpr": "( JOIN ( R [ book , author , book editions published ] ) [ W. E. B. Du Bois ] )",
        "gold_entity_map": {
            "m.0mddq": "W. E. B. Du Bois"
        },
        "gold_relation_map": {
            "book.author.book_editions_published": "book , author , book editions published"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3737",
        "question": "where is art smith from",
        "comp_type": null,
        "answer": [
            "m.0rkvq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027560_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027560_ ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.027560_)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Art Smith ] )",
        "gold_entity_map": {
            "m.027560_": "Art Smith"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3743",
        "question": "what to do in venice beach ca",
        "comp_type": null,
        "answer": [
            "m.01z4sg",
            "m.027l5dg",
            "m.02rfng5",
            "m.047b_hk",
            "m.047c1tt",
            "m.05p3m29",
            "m.09z99h",
            "m.0f7zgx",
            "m.0fy0rf",
            "m.0hr5dd1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_fl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_fl ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.07_fl)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Venice ] )",
        "gold_entity_map": {
            "m.07_fl": "Venice"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3746",
        "question": "where is fresno texas located",
        "comp_type": null,
        "answer": [
            "m.0mrs1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.010190)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.010190 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.010190)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Fresno ] )",
        "gold_entity_map": {
            "m.010190": "Fresno"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3750",
        "question": "what team rasheed wallace",
        "comp_type": null,
        "answer": [
            "m.0bwjj",
            "m.0jm3v",
            "m.0jm5b",
            "m.0jm64",
            "m.0jm8l",
            "m.0jmm4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hdjz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hdjz ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.02hdjz))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Rasheed Wallace ] ) )",
        "gold_entity_map": {
            "m.02hdjz": "Rasheed Wallace"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3769",
        "question": "what county is orlando fl in",
        "comp_type": null,
        "answer": [
            "m.0jrtv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ply0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ply0 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0ply0)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Orlando ] )",
        "gold_entity_map": {
            "m.0ply0": "Orlando"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3773",
        "question": "where did sir donald bradman live",
        "comp_type": null,
        "answer": [
            "m.04_356"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lylw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lylw ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0lylw)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Don Bradman ] )",
        "gold_entity_map": {
            "m.0lylw": "Don Bradman"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3775",
        "question": "what is the name of the broncos mascot",
        "comp_type": null,
        "answer": [
            "m.0_h1qbn",
            "m.027l54x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0289q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0289q ns:sports.sports_team.team_mascot ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.team_mascot) m.0289q)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , team mascot ] ) [ Denver Broncos ] )",
        "gold_entity_map": {
            "m.0289q": "Denver Broncos"
        },
        "gold_relation_map": {
            "sports.sports_team.team_mascot": "sports , sports team , team mascot"
        },
        "gold_type_map": {}
    }
]