[
    {
        "ID": "WebQTrn-2446",
        "question": "where does manny pacquiao live",
        "comp_type": null,
        "answer": [
            "m.01rfwg",
            "m.03fyt0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03pmbb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03pmbb ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.03pmbb))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Manny Pacquiao ] ) )",
        "gold_entity_map": {
            "m.03pmbb": "Manny Pacquiao"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2447",
        "question": "when were the duggar kids born",
        "comp_type": null,
        "answer": [
            "1988-03-03",
            "1990-01-12",
            "1991-05-17",
            "1992-11-04",
            "1993-12-21",
            "1995-01-20",
            "1996-08-28",
            "1997-10-28",
            "1998-12-30",
            "2000-04-21",
            "2001-07-07",
            "2002-11-15",
            "2004-05-23",
            "2005-10-11",
            "2007-08-02",
            "2008-12-18",
            "2009-12-10"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.089twl ns:people.person.children ?z .\n?z ns:people.person.date_of_birth ?x .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {},
        "gold_relation_map": {
            "people.person.date_of_birth": "people , person , date of birth",
            "people.person.children": "people , person , children"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2448",
        "question": "where did pharaoh hatshepsut live",
        "comp_type": null,
        "answer": [
            "m.02k54"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gj3r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gj3r ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0gj3r)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Hatshepsut ] )",
        "gold_entity_map": {
            "m.0gj3r": "Hatshepsut"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2452",
        "question": "where did the seminole native americans live",
        "comp_type": null,
        "answer": [
            "m.05mph"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0198dl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0198dl ns:people.ethnicity.geographic_distribution ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.geographic_distribution) m.0198dl)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Seminole ] )",
        "gold_entity_map": {
            "m.0198dl": "Seminole"
        },
        "gold_relation_map": {
            "people.ethnicity.geographic_distribution": "people , ethnicity , geographic distribution"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2453",
        "question": "what county is plymouth ia in",
        "comp_type": null,
        "answer": [
            "m.0nsfl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sswj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sswj ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0sswj)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Plymouth ] )",
        "gold_entity_map": {
            "m.0sswj": "Plymouth"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2454",
        "question": "what airlines fly into ontario international airport",
        "comp_type": null,
        "answer": [
            "m.01srh1",
            "m.026tgjz",
            "m.02ppptb",
            "m.06xnkm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01l4_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01l4_l ns:aviation.airport.hub_for ?x .\n}\n",
        "sexpr": "(JOIN (R aviation.airport.hub_for) m.01l4_l)",
        "normed_sexpr": "( JOIN ( R [ aviation , airport , hub for ] ) [ Ontario International Airport ] )",
        "gold_entity_map": {
            "m.01l4_l": "Ontario International Airport"
        },
        "gold_relation_map": {
            "aviation.airport.hub_for": "aviation , airport , hub for"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2455",
        "question": "what school did kurt vonnegut go to",
        "comp_type": null,
        "answer": [
            "m.01qgr3",
            "m.01w3v",
            "m.02q2x61",
            "m.03bnd9",
            "m.07wrz",
            "m.0cwx_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049gc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049gc ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.049gc))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Kurt Vonnegut ] ) )",
        "gold_entity_map": {
            "m.049gc": "Kurt Vonnegut"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2457",
        "question": "where did henry hudson come from",
        "comp_type": null,
        "answer": [
            "m.02jx1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c065)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c065 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0c065)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Henry Hudson ] )",
        "gold_entity_map": {
            "m.0c065": "Henry Hudson"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2458",
        "question": "which continent is costa rica located",
        "comp_type": null,
        "answer": [
            "m.059g4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01p8s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01p8s ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.01p8s)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Costa Rica ] )",
        "gold_entity_map": {
            "m.01p8s": "Costa Rica"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2459",
        "question": "what movies has halle berry starred in",
        "comp_type": null,
        "answer": [
            "m.01265dl4",
            "m.014kq6",
            "m.016f62",
            "m.01bn3l",
            "m.01qb5d",
            "m.026s0mx",
            "m.0273yvf",
            "m.02ql071",
            "m.02v8kmz",
            "m.02vr9lr",
            "m.0344gc",
            "m.034fj2",
            "m.03cd0x",
            "m.03cj29",
            "m.03mh94",
            "m.03qfr0",
            "m.03tv11",
            "m.04jrzl",
            "m.04sbsq",
            "m.04yft1h",
            "m.0695g8",
            "m.06gb1w",
            "m.0727__",
            "m.07vc1p",
            "m.086s7z",
            "m.087kv6",
            "m.08bzc3",
            "m.08r9v6",
            "m.09fgyt",
            "m.0d1s9b",
            "m.0d7nyly",
            "m.0d90m",
            "m.0dgcgl",
            "m.0dlk_qn",
            "m.0fphf3v",
            "m.0g4fnsc",
            "m.0gh65c5",
            "m.0gyxl7y",
            "m.0hqrx",
            "m.0hz7vs4",
            "m.0kv750",
            "m.0r3r5jz",
            "m.0y59lrv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03knl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03knl ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.03knl))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Halle Berry ] ) )",
        "gold_entity_map": {
            "m.03knl": "Halle Berry"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2460",
        "question": "what was the capital of ancient israel",
        "comp_type": null,
        "answer": [
            "m.01hxx6",
            "m.01p205",
            "m.0430_",
            "m.0b__9_0",
            "m.0ch27v_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04fry)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04fry ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.04fry)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Kingdom of Israel ] )",
        "gold_entity_map": {
            "m.04fry": "Kingdom of Israel"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2466",
        "question": "where is reggie bush from",
        "comp_type": null,
        "answer": [
            "m.0r57n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cb70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cb70 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.05cb70)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Reggie Bush ] )",
        "gold_entity_map": {
            "m.05cb70": "Reggie Bush"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2467",
        "question": "what has sara paxton been in",
        "comp_type": null,
        "answer": [
            "m.027qv_z",
            "m.027s88w",
            "m.02qd6kv",
            "m.02vz8ls",
            "m.0309c5",
            "m.036g88",
            "m.03k93x",
            "m.04j2jrv",
            "m.05b3jh0",
            "m.0754ns",
            "m.091f4r",
            "m.0b2f_2",
            "m.0bmw81",
            "m.0by0lmk",
            "m.0d7907",
            "m.0dsb6l1",
            "m.0fmpqc",
            "m.0gvttx5",
            "m.0gyd5y6",
            "m.0gynnws",
            "m.0h26kbw",
            "m.0h2j98j",
            "m.0h2j9dq",
            "m.0h2j9gj",
            "m.0h2j9hf",
            "m.0hnk_h_",
            "m.0lgpmxy",
            "m.0lgpmz6",
            "m.0lgpmzr",
            "m.0my1sv9",
            "m.0tkf_0d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.075ms_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.075ms_ ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.075ms_))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Sara Paxton ] ) )",
        "gold_entity_map": {
            "m.075ms_": "Sara Paxton"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2473",
        "question": "what is mexico city time zone",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sqj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sqj ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.04sqj)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Mexico City ] )",
        "gold_entity_map": {
            "m.04sqj": "Mexico City"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2476",
        "question": "who is the head coach of the indianapolis colts",
        "comp_type": null,
        "answer": [
            "m.03mbsxm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03wnh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03wnh ns:american_football.football_team.current_head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.current_head_coach) m.03wnh)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , current head coach ] ) [ Indianapolis Colts ] )",
        "gold_entity_map": {
            "m.03wnh": "Indianapolis Colts"
        },
        "gold_relation_map": {
            "american_football.football_team.current_head_coach": "american football , football team , current head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2478",
        "question": "what is the syracuse university mascot",
        "comp_type": null,
        "answer": [
            "m.03c0lxb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.078bz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.078bz ns:education.educational_institution.mascot ?x .\n}\n",
        "sexpr": "(JOIN (R education.educational_institution.mascot) m.078bz)",
        "normed_sexpr": "( JOIN ( R [ education , educational institution , mascot ] ) [ Syracuse University ] )",
        "gold_entity_map": {
            "m.078bz": "Syracuse University"
        },
        "gold_relation_map": {
            "education.educational_institution.mascot": "education , educational institution , mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2483",
        "question": "where does the shannon river end",
        "comp_type": null,
        "answer": [
            "m.02py6xf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0m_dt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0m_dt ns:geography.river.mouth ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.mouth) m.0m_dt)",
        "normed_sexpr": "( JOIN ( R [ geography , river , mouth ] ) [ River Shannon ] )",
        "gold_entity_map": {
            "m.0m_dt": "River Shannon"
        },
        "gold_relation_map": {
            "geography.river.mouth": "geography , river , mouth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2487",
        "question": "what drug did mitch hedberg overdose on",
        "comp_type": null,
        "answer": [
            "m.02kp1qn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vzgl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vzgl ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.02vzgl)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Mitch Hedberg ] )",
        "gold_entity_map": {
            "m.02vzgl": "Mitch Hedberg"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2490",
        "question": "what is british columbia",
        "comp_type": null,
        "answer": [
            "m.0hzcdlq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015jr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015jr ns:base.aareas.schema.administrative_area.administrative_area_type ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_area_type) m.015jr)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative area type ] ) [ British Columbia ] )",
        "gold_entity_map": {
            "m.015jr": "British Columbia"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_area_type": "base , aareas , schema , administrative area , administrative area type"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2491",
        "question": "what language do you speak in austria",
        "comp_type": null,
        "answer": [
            "m.0140n_",
            "m.01841n",
            "m.02hwyss",
            "m.02ztjwg",
            "m.04306rv",
            "m.06zvd",
            "m.0k0sb",
            "m.0k0sv",
            "m.0k1b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h7x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h7x ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.0h7x)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Austria ] )",
        "gold_entity_map": {
            "m.0h7x": "Austria"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2494",
        "question": "where did roger moore live",
        "comp_type": null,
        "answer": [
            "m.04jpl",
            "m.062m9r",
            "m.0nc84"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017lqp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017lqp ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.017lqp))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Roger Moore ] ) )",
        "gold_entity_map": {
            "m.017lqp": "Roger Moore"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2504",
        "question": "where did carmen electra grow up",
        "comp_type": null,
        "answer": [
            "m.013jdh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lbp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lbp ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01lbp)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Carmen Electra ] )",
        "gold_entity_map": {
            "m.01lbp": "Carmen Electra"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2506",
        "question": "what famous book did benjamin franklin wrote",
        "comp_type": null,
        "answer": [
            "m.01zwbg",
            "m.02s9g3g",
            "m.03c67p8",
            "m.041027",
            "m.04g063c",
            "m.04t1zmd",
            "m.04t1zmn",
            "m.04t1zmx",
            "m.04t1zn4",
            "m.04w5ynd",
            "m.05b22sd",
            "m.05q9nw8",
            "m.0638kh",
            "m.066ymc6",
            "m.069v34p",
            "m.06bc5yn",
            "m.06dqc2w",
            "m.06f96j7",
            "m.06fl24x",
            "m.06gsgp3",
            "m.06gw6_b",
            "m.06hvzsn",
            "m.06j_wqp",
            "m.06jq4kg",
            "m.06l923t",
            "m.06ln9sy",
            "m.06lsf_m",
            "m.06m0y80",
            "m.06n38yt",
            "m.06n8wr1",
            "m.06pnj_d",
            "m.06q2529",
            "m.06spsy3",
            "m.06thfrr",
            "m.07v5q",
            "m.0b28ym",
            "m.0bhjdhz",
            "m.0bhjdj_",
            "m.0bhjdj1",
            "m.0bhjdj4",
            "m.0bhjdj7",
            "m.0bhjdjb",
            "m.0bhjdjj",
            "m.0bhjdjq",
            "m.0bhjdjt",
            "m.0bhjdjx",
            "m.0bhjdk2",
            "m.0bhjdk5",
            "m.0bhjdk8",
            "m.0bhjdkc",
            "m.0bhjdkg",
            "m.0bhjdkk",
            "m.0bhjdkn",
            "m.0bhjdkr",
            "m.0bhjdkv",
            "m.0bhjdky",
            "m.0bhjdl0",
            "m.0bhjdl6",
            "m.0bhjdl9",
            "m.0bhjdld",
            "m.0bhjdlh",
            "m.0bhjdll",
            "m.0bqqyl_",
            "m.0bqqyld",
            "m.0bqqylh",
            "m.0bqqyln",
            "m.0bqqylw",
            "m.0bqqym2",
            "m.0bqqym6",
            "m.0bqqymc",
            "m.0bqqymg",
            "m.0bqqyml",
            "m.0bqqymr",
            "m.0bqqymv",
            "m.0bqqymy",
            "m.0bqqyn2",
            "m.0bqqyn8",
            "m.0bqqynk",
            "m.0bqqynp",
            "m.0bqqyns",
            "m.0c1t1dy",
            "m.0c1t1f0",
            "m.0c1t1f3",
            "m.0c1t1f6",
            "m.0c1t1f9",
            "m.0c1t1fd",
            "m.0c1t1fh",
            "m.0c1t1fl",
            "m.0c1t1fp",
            "m.0c1t1fs",
            "m.0c1t1fw",
            "m.0c1t1fz",
            "m.0c1t1g1",
            "m.0c1t1g4",
            "m.0c1t1g7",
            "m.0c1t1gb",
            "m.0c1t1gf",
            "m.0c1t1gj",
            "m.0c1t1gm",
            "m.0c1t1gq",
            "m.0c1t1gt",
            "m.0c1t1gx",
            "m.0c1t1h2",
            "m.0c1t1h5",
            "m.0c1t1h8",
            "m.0c1t1hc",
            "m.0c1t1hg",
            "m.0c1t1hk",
            "m.0c1t1hn",
            "m.0c1t1hr",
            "m.0dytg4y",
            "m.0f5j2d",
            "m.0xptgyh",
            "m.0y5sd3_",
            "m.0y5sd60",
            "m.0y5sd6w",
            "m.0y5sd7_",
            "m.0y5sd7d",
            "m.0y5sd9_",
            "m.0y5sd9c",
            "m.0y5sdbl",
            "m.0y5sdc8",
            "m.0y5sdds",
            "m.0y5sdfb",
            "m.0y5sdfp",
            "m.0y5sdg1",
            "m.0y5sdgc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.019fz)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Benjamin Franklin ] )",
        "gold_entity_map": {
            "m.019fz": "Benjamin Franklin"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2507",
        "question": "what band does adam levine sing for",
        "comp_type": null,
        "answer": [
            "m.02k5sc",
            "m.06kkj8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.044mfr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.044mfr ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.group) (JOIN (R music.group_member.membership) m.044mfr))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , group ] ) ( JOIN ( R [ music , group member , membership ] ) [ Adam Levine ] ) )",
        "gold_entity_map": {
            "m.044mfr": "Adam Levine"
        },
        "gold_relation_map": {
            "music.group_membership.group": "music , group membership , group",
            "music.group_member.membership": "music , group member , membership"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2509",
        "question": "where did robert hooke get his education",
        "comp_type": null,
        "answer": [
            "m.01722w",
            "m.07tgn",
            "m.0yls9",
            "m.0ymff"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d6j4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d6j4 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0d6j4))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Robert Hooke ] ) )",
        "gold_entity_map": {
            "m.0d6j4": "Robert Hooke"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2513",
        "question": "who has won the most fa cup",
        "comp_type": null,
        "answer": [
            "m.050fh",
            "m.0xbm"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n    {\n      SELECT ?x (COUNT(?x) as ?count)\n      WHERE {\n          ns:m.02_p0 ns:sports.sports_award_type.winners ?y .\n          ?y ns:sports.sports_award.award_winner ?x .\n      }\n    }\n    {\n      SELECT (MAX(?count) AS ?maxCount)\n      WHERE {\n        SELECT ?x (COUNT(?x) as ?count) \n        WHERE {\n          ns:m.02_p0 ns:sports.sports_award_type.winners ?y .\n          ?y ns:sports.sports_award.award_winner ?x .\n        }\n      }\n    }\n    FILTER (?maxCount = ?count)\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.02_p0": "FA Cup"
        },
        "gold_relation_map": {
            "sports.sports_award_type.winners": "sports , sports award type , winners",
            "sports.sports_award.award_winner": "sports , sports award , award winner"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2514",
        "question": "what time is kansas in",
        "comp_type": null,
        "answer": [
            "m.02fqwt",
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0488g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0488g ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0488g)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Kansas ] )",
        "gold_entity_map": {
            "m.0488g": "Kansas"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2515",
        "question": "what time is in san diego california",
        "comp_type": null,
        "answer": [
            "m.02lcqs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.071vr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.071vr ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.071vr)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ San Diego ] )",
        "gold_entity_map": {
            "m.071vr": "San Diego"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2517",
        "question": "when did hurricane irene hit ct",
        "comp_type": null,
        "answer": [
            "m.0fq0n_y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02p70bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02p70bg ns:meteorology.tropical_cyclone.tropical_cyclone_season ?x .\n}\n",
        "sexpr": "(JOIN (R meteorology.tropical_cyclone.tropical_cyclone_season) m.02p70bg)",
        "normed_sexpr": "( JOIN ( R [ meteorology , tropical cyclone , tropical cyclone season ] ) [ Hurricane Irene ] )",
        "gold_entity_map": {
            "m.02p70bg": "Hurricane Irene"
        },
        "gold_relation_map": {
            "meteorology.tropical_cyclone.tropical_cyclone_season": "meteorology , tropical cyclone , tropical cyclone season"
        },
        "gold_type_map": {}
    }
]