[
    {
        "ID": "WebQTrn-395",
        "question": "where is the nation of palestine",
        "comp_type": null,
        "answer": [
            "m.01ffbn",
            "m.02qkt",
            "m.04l_r",
            "m.04wsz",
            "m.04zy7t9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.047876)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.047876 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.047876)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Palestine ] )",
        "gold_entity_map": {
            "m.047876": "Palestine"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-397",
        "question": "what countries speak english primarily",
        "comp_type": null,
        "answer": [
            "m.014tss",
            "m.0153fg",
            "m.015psd",
            "m.0160w",
            "m.0162v",
            "m.0164b",
            "m.0165b",
            "m.0166v",
            "m.0168t",
            "m.016bbl",
            "m.019rg5",
            "m.01ds_f",
            "m.01n8qg",
            "m.01nln",
            "m.01nty",
            "m.01p5l",
            "m.01p6l",
            "m.01rgp4",
            "m.01s8rk",
            "m.020d5",
            "m.020p1",
            "m.022p8v",
            "m.024pcx",
            "m.026wtlf",
            "m.027g22f",
            "m.027nb",
            "m.02khs",
            "m.02phz12",
            "m.02wmy",
            "m.02wt0",
            "m.03_xj",
            "m.03188",
            "m.033nj_",
            "m.034m8",
            "m.034tl",
            "m.035dk",
            "m.035hm",
            "m.035yg",
            "m.0366c",
            "m.03d5b9c",
            "m.03h64",
            "m.03rk0",
            "m.03rt9",
            "m.03t1s",
            "m.047t_",
            "m.049nq",
            "m.04hvw",
            "m.04hzj",
            "m.04tr1",
            "m.04v3q",
            "m.04v6v",
            "m.04wcf",
            "m.05b2h",
            "m.05bcl",
            "m.05bmq",
            "m.05br2",
            "m.05byy",
            "m.05cgv",
            "m.05cnr",
            "m.05cqm",
            "m.05qkp",
            "m.05r7t",
            "m.05rznz",
            "m.05sb1",
            "m.05tr7",
            "m.05v8c",
            "m.05vd5",
            "m.06dfg",
            "m.06jnv",
            "m.06q1r",
            "m.06ryl",
            "m.06s_2",
            "m.06s0l",
            "m.06s6l",
            "m.06s9y",
            "m.06sw9",
            "m.06t2t",
            "m.06tnn",
            "m.06tw8",
            "m.06v36",
            "m.07dzf",
            "m.07fb6",
            "m.07fr_",
            "m.07fsv",
            "m.07ssc",
            "m.07tp2",
            "m.07ww5",
            "m.07z5n",
            "m.088q4",
            "m.088vb",
            "m.09lxtg",
            "m.09wfqp",
            "m.0bq0p9",
            "m.0c3fp",
            "m.0c4b8",
            "m.0ctw_b",
            "m.0d060g",
            "m.0dkly",
            "m.0h8d",
            "m.0hdx8",
            "m.0hzlz",
            "m.0j5g9",
            "m.0l3h",
            "m.0n3g"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n    ?x ns:location.country.official_language ns:m.02h40lc .\n    ?x ns:common.topic.notable_types ns:m.01mp .   # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.02h40lc": "English Language",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-399",
        "question": "what is in liverpool england",
        "comp_type": null,
        "answer": [
            "m.019gnm",
            "m.02c3ll",
            "m.02vvzf",
            "m.02vw4c",
            "m.036gxj",
            "m.040gbq",
            "m.040gw4",
            "m.04150b",
            "m.04bz00",
            "m.05d5yy",
            "m.06h8xk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lh6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lh6 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.04lh6)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Liverpool ] )",
        "gold_entity_map": {
            "m.04lh6": "Liverpool"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-400",
        "question": "what state is harvard college located",
        "comp_type": null,
        "answer": [
            "m.05k7sb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mpwj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mpwj ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.0kpys4 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.0kpys4) (JOIN (R location.location.containedby) m.01mpwj))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ US State ] ) ( JOIN ( R [ location , location , containedby ] ) [ Harvard College ] ) )",
        "gold_entity_map": {
            "m.01mpwj": "Harvard College",
            "m.0kpys4": "US State"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.0kpys4": "US State"
        }
    },
    {
        "ID": "WebQTrn-401",
        "question": "where was leonardo da vinci when he died",
        "comp_type": null,
        "answer": [
            "m.01jvvc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04lg6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04lg6 ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.04lg6)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Leonardo da Vinci ] )",
        "gold_entity_map": {
            "m.04lg6": "Leonardo da Vinci"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-403",
        "question": "what is the time zone in oklahoma city",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fvzg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fvzg ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0fvzg)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Oklahoma City ] )",
        "gold_entity_map": {
            "m.0fvzg": "Oklahoma City"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-404",
        "question": "what killed whitney houston",
        "comp_type": null,
        "answer": [
            "m.01g27f",
            "m.01s1m",
            "m.02nx6jb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.086qd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.086qd ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.086qd)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Whitney Houston ] )",
        "gold_entity_map": {
            "m.086qd": "Whitney Houston"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-407",
        "question": "what is mount st helens",
        "comp_type": null,
        "answer": [
            "m.015kp7",
            "m.07_9_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.094xz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.094xz ns:geography.mountain.mountain_type ?x .\n}\n",
        "sexpr": "(JOIN (R geography.mountain.mountain_type) m.094xz)",
        "normed_sexpr": "( JOIN ( R [ geography , mountain , mountain type ] ) [ Mount St. Helens ] )",
        "gold_entity_map": {
            "m.094xz": "Mount St. Helens"
        },
        "gold_relation_map": {
            "geography.mountain.mountain_type": "geography , mountain , mountain type"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-408",
        "question": "what airport is closest to sandals grande in st lucia",
        "comp_type": null,
        "answer": [
            "m.02zrg2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06s0l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06s0l ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.06s0l)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Saint Lucia ] )",
        "gold_entity_map": {
            "m.06s0l": "Saint Lucia"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-415",
        "question": "who is esther hicks",
        "comp_type": null,
        "answer": [
            "m.0cbd2",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06_0rt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06_0rt ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.06_0rt)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Esther Hicks ] )",
        "gold_entity_map": {
            "m.06_0rt": "Esther Hicks"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-416",
        "question": "what does michael vick do",
        "comp_type": null,
        "answer": [
            "m.01xr66",
            "m.02h665k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027f42)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027f42 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.027f42)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Michael Vick ] )",
        "gold_entity_map": {
            "m.027f42": "Michael Vick"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-423",
        "question": "what to do in laughlin nevada",
        "comp_type": null,
        "answer": [
            "m.092v_6",
            "m.092zr1",
            "m.093h23"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.020bkmh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.020bkmh ns:location.location.contains ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.contains) m.020bkmh)",
        "normed_sexpr": "( JOIN ( R [ location , location , contains ] ) [ Laughlin ] )",
        "gold_entity_map": {
            "m.020bkmh": "Laughlin"
        },
        "gold_relation_map": {
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-424",
        "question": "who plays princess padme in star wars",
        "comp_type": null,
        "answer": [
            "m.041fcq",
            "m.09l3p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0drf_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0drf_ ns:film.film_character.portrayed_in_films ?y .\n?y ns:film.performance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.actor) (JOIN (R film.film_character.portrayed_in_films) m.0drf_))",
        "normed_sexpr": "( JOIN ( R [ film , performance , actor ] ) ( JOIN ( R [ film , film character , portrayed in films ] ) [ Padmé Amidala ] ) )",
        "gold_entity_map": {
            "m.0drf_": "Padmé Amidala"
        },
        "gold_relation_map": {
            "film.performance.actor": "film , performance , actor",
            "film.film_character.portrayed_in_films": "film , film character , portrayed in films"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-426",
        "question": "who was louis riel",
        "comp_type": null,
        "answer": [
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qqn ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.04qqn)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Louis Riel ] )",
        "gold_entity_map": {
            "m.04qqn": "Louis Riel"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-429",
        "question": "where is abraham lincoln hometown",
        "comp_type": null,
        "answer": [
            "m.0tgmk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0gzh)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Abraham Lincoln ] )",
        "gold_entity_map": {
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-430",
        "question": "what disease did helen keller",
        "comp_type": null,
        "answer": [
            "m.014wq_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.03ppx)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Helen Keller ] )",
        "gold_entity_map": {
            "m.03ppx": "Helen Keller"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-434",
        "question": "what is the atlanta braves mascot",
        "comp_type": null,
        "answer": [
            "m.07vbb7",
            "m.07vbfd",
            "m.07vbvp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x2p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x2p ns:sports.sports_team.team_mascot ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.team_mascot) m.0x2p)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , team mascot ] ) [ Atlanta Braves ] )",
        "gold_entity_map": {
            "m.0x2p": "Atlanta Braves"
        },
        "gold_relation_map": {
            "sports.sports_team.team_mascot": "sports , sports team , team mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-437",
        "question": "where was greenpeace an international environmental organization founded",
        "comp_type": null,
        "answer": [
            "m.080h2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036qv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036qv ns:organization.organization.place_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.place_founded) m.036qv)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , place founded ] ) [ Greenpeace ] )",
        "gold_entity_map": {
            "m.036qv": "Greenpeace"
        },
        "gold_relation_map": {
            "organization.organization.place_founded": "organization , organization , place founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-440",
        "question": "what was the first name of the washington redskins",
        "comp_type": null,
        "answer": [
            "m.06mp_z5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.084l5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.084l5 ns:sports.sports_team.previously_known_as ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.previously_known_as) m.084l5)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , previously known as ] ) [ Washington Redskins ] )",
        "gold_entity_map": {
            "m.084l5": "Washington Redskins"
        },
        "gold_relation_map": {
            "sports.sports_team.previously_known_as": "sports , sports team , previously known as"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-441",
        "question": "what sports do they do in canada",
        "comp_type": null,
        "answer": [
            "m.02py_tx",
            "m.02r0htt",
            "m.02z6d6n",
            "m.035tjy",
            "m.037qf6",
            "m.03hggnl",
            "m.03qkv16",
            "m.03qnf8s",
            "m.03y8wtx",
            "m.043q413",
            "m.0478z33",
            "m.04cys3k",
            "m.04g1h9d",
            "m.04jfltf",
            "m.04t88g",
            "m.053r9v9",
            "m.055_233",
            "m.05b__p7",
            "m.05zf1x",
            "m.06_8jv",
            "m.0639sd",
            "m.096fft",
            "m.0blnl8",
            "m.0bmkh28",
            "m.0dq638",
            "m.0fkjqy",
            "m.0gf59h",
            "m.0h2rrm",
            "m.0h6125",
            "m.0h625n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.0d060g)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ Canada ] )",
        "gold_entity_map": {
            "m.0d060g": "Canada"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-443",
        "question": "who is the arizona cardinals football coach",
        "comp_type": null,
        "answer": [
            "m.027wt58"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ws7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ws7 ns:american_football.football_team.current_head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.current_head_coach) m.0ws7)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , current head coach ] ) [ Arizona Cardinals ] )",
        "gold_entity_map": {
            "m.0ws7": "Arizona Cardinals"
        },
        "gold_relation_map": {
            "american_football.football_team.current_head_coach": "american football , football team , current head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-446",
        "question": "what was marilyn monroe known for",
        "comp_type": null,
        "answer": [
            "m.01d_h8",
            "m.02hrh1q",
            "m.05mwvd",
            "m.09l65",
            "m.0d1pc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wqr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wqr ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.04wqr)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Marilyn Monroe ] )",
        "gold_entity_map": {
            "m.04wqr": "Marilyn Monroe"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-450",
        "question": "who are the colorado eagles",
        "comp_type": null,
        "answer": [
            "m.025698k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.068_gr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.068_gr ns:common.topic.notable_for ?y .\n?y ns:common.notable_for.notable_object ?x .\n}\n",
        "sexpr": "(JOIN (R common.notable_for.notable_object) (JOIN (R common.topic.notable_for) m.068_gr))",
        "normed_sexpr": "( JOIN ( R [ common , notable for , notable object ] ) ( JOIN ( R [ common , topic , notable for ] ) [ Colorado Eagles ] ) )",
        "gold_entity_map": {
            "m.068_gr": "Colorado Eagles"
        },
        "gold_relation_map": {
            "common.notable_for.notable_object": "common , notable for , notable object",
            "common.topic.notable_for": "common , topic , notable for"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-453",
        "question": "what currency do they accept in kenya",
        "comp_type": null,
        "answer": [
            "m.05yxpb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019rg5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019rg5 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.019rg5)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Kenya ] )",
        "gold_entity_map": {
            "m.019rg5": "Kenya"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-459",
        "question": "where is the best place to vacation in the dominican republic",
        "comp_type": null,
        "answer": [
            "m.025vdyx",
            "m.03yhz4z",
            "m.04qjzz",
            "m.04vwf5x",
            "m.064nfcw",
            "m.09v9100",
            "m.0j5ymqb",
            "m.0jsr82_",
            "m.0jy_b9f",
            "m.0jy_b9n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.027rn)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Dominican Republic ] )",
        "gold_entity_map": {
            "m.027rn": "Dominican Republic"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-461",
        "question": "where was brad pitt born",
        "comp_type": null,
        "answer": [
            "m.0z9lj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c6qh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c6qh ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0c6qh)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Brad Pitt ] )",
        "gold_entity_map": {
            "m.0c6qh": "Brad Pitt"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-462",
        "question": "what position does vernon davis play",
        "comp_type": null,
        "answer": [
            "m.02g_7z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0br8m3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0br8m3 ns:american_football.football_player.position_s ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_player.position_s) m.0br8m3)",
        "normed_sexpr": "( JOIN ( R [ american football , football player , position s ] ) [ Vernon Davis ] )",
        "gold_entity_map": {
            "m.0br8m3": "Vernon Davis"
        },
        "gold_relation_map": {
            "american_football.football_player.position_s": "american football , football player , position s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-463",
        "question": "where is the euro 2012 tournament",
        "comp_type": null,
        "answer": [
            "m.02qbpd",
            "m.02sn34",
            "m.035m6",
            "m.05xnv",
            "m.081m_",
            "m.082sy9",
            "m.0845b",
            "m.0d7_n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t1s0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t1s0 ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.06t1s0)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ UEFA Euro 2012 ] )",
        "gold_entity_map": {
            "m.06t1s0": "UEFA Euro 2012"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-465",
        "question": "what to see and do in malta",
        "comp_type": null,
        "answer": [
            "m.025tp71",
            "m.02r4lsr",
            "m.0497sp",
            "m.04kl4s",
            "m.05p2xz0",
            "m.0bhbzxt",
            "m.0h5ffz",
            "m.0j1hrfj",
            "m.0jz58y5",
            "m.0jz59fs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04v3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04v3q ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.04v3q)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Malta ] )",
        "gold_entity_map": {
            "m.04v3q": "Malta"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-467",
        "question": "what state is rick santorum from",
        "comp_type": null,
        "answer": [
            "m.0mmzt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fgd3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fgd3 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01fgd3)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Rick Santorum ] )",
        "gold_entity_map": {
            "m.01fgd3": "Rick Santorum"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-470",
        "question": "what is jonas brothers names",
        "comp_type": null,
        "answer": [
            "m.0417yh9",
            "m.04cr6qv",
            "m.04d_mtq",
            "m.04f7c55"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cbm64)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cbm64 ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.member) (JOIN (R music.musical_group.member) m.0cbm64))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , member ] ) ( JOIN ( R [ music , musical group , member ] ) [ Jonas Brothers ] ) )",
        "gold_entity_map": {
            "m.0cbm64": "Jonas Brothers"
        },
        "gold_relation_map": {
            "music.musical_group.member": "music , musical group , member",
            "music.group_membership.member": "music , group membership , member"
        },
        "gold_type_map": {}
    }
]