[
    {
        "ID": "WebQTrn-1878",
        "question": "what to do in palo alto ca with kids",
        "comp_type": null,
        "answer": [
            "m.029fr3",
            "m.02mw8v",
            "m.02q09z8",
            "m.04fx6c",
            "m.06_4n7_",
            "m.0878f",
            "m.097pyg",
            "m.0bmnsf",
            "m.0gfflw8",
            "m.0j67y9q",
            "m.0jwjx3f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f04c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f04c ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0f04c)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Palo Alto ] )",
        "gold_entity_map": {
            "m.0f04c": "Palo Alto"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1879",
        "question": "what country did jacques cartier came from",
        "comp_type": null,
        "answer": [
            "m.0f8l9c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j8t3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j8t3 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.0j8t3)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Jacques Cartier ] )",
        "gold_entity_map": {
            "m.0j8t3": "Jacques Cartier"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1884",
        "question": "what represents ghana",
        "comp_type": null,
        "answer": [
            "m.02c0s8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035dk ns:symbols.flag_referent.flag ?y .\n?y ns:symbols.flag_use.flag ?x .\n}\n",
        "sexpr": "(JOIN (R symbols.flag_use.flag) (JOIN (R symbols.flag_referent.flag) m.035dk))",
        "normed_sexpr": "( JOIN ( R [ symbols , flag use , flag ] ) ( JOIN ( R [ symbols , flag referent , flag ] ) [ Ghana ] ) )",
        "gold_entity_map": {
            "m.035dk": "Ghana"
        },
        "gold_relation_map": {
            "symbols.flag_use.flag": "symbols , flag use , flag",
            "symbols.flag_referent.flag": "symbols , flag referent , flag"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1886",
        "question": "where did carrie underwood live",
        "comp_type": null,
        "answer": [
            "m.0z7zm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.058s57)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.058s57 ns:music.artist.origin ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.origin) m.058s57)",
        "normed_sexpr": "( JOIN ( R [ music , artist , origin ] ) [ Carrie Underwood ] )",
        "gold_entity_map": {
            "m.058s57": "Carrie Underwood"
        },
        "gold_relation_map": {
            "music.artist.origin": "music , artist , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1888",
        "question": "when did carolina hurricanes win the cup",
        "comp_type": null,
        "answer": [
            "m.02d08dj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j8cb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j8cb ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0j8cb)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Carolina Hurricanes ] )",
        "gold_entity_map": {
            "m.0j8cb": "Carolina Hurricanes"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1890",
        "question": "who currently owns the steelers",
        "comp_type": null,
        "answer": [
            "m.03nrwfz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05tfm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05tfm ns:sports.professional_sports_team.owner_s ?x .\n}\n",
        "sexpr": "(JOIN (R sports.professional_sports_team.owner_s) m.05tfm)",
        "normed_sexpr": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ Pittsburgh Steelers ] )",
        "gold_entity_map": {
            "m.05tfm": "Pittsburgh Steelers"
        },
        "gold_relation_map": {
            "sports.professional_sports_team.owner_s": "sports , professional sports team , owner s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1891",
        "question": "where was toni braxton born and raised",
        "comp_type": null,
        "answer": [
            "m.0ttlb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h9_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h9_l ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02h9_l)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Toni Braxton ] )",
        "gold_entity_map": {
            "m.02h9_l": "Toni Braxton"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1894",
        "question": "where is shoreview mn",
        "comp_type": null,
        "answer": [
            "m.0nh57"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wfmh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wfmh ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0wfmh)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Shoreview ] )",
        "gold_entity_map": {
            "m.0wfmh": "Shoreview"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1895",
        "question": "what did maria theresa rule",
        "comp_type": null,
        "answer": [
            "m.01d8l",
            "m.03gj2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0czh6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0czh6 ns:royalty.monarch.kingdom ?x .\n}\n",
        "sexpr": "(JOIN (R royalty.monarch.kingdom) m.0czh6)",
        "normed_sexpr": "( JOIN ( R [ royalty , monarch , kingdom ] ) [ Maria Theresa ] )",
        "gold_entity_map": {
            "m.0czh6": "Maria Theresa"
        },
        "gold_relation_map": {
            "royalty.monarch.kingdom": "royalty , monarch , kingdom"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1896",
        "question": "what was jack london 's education",
        "comp_type": null,
        "answer": [
            "m.025ygr9",
            "m.02zd460"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bt23)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bt23 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0bt23))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jack London ] ) )",
        "gold_entity_map": {
            "m.0bt23": "Jack London"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1903",
        "question": "what county is bradenton fl located in",
        "comp_type": null,
        "answer": [
            "m.0jrmq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rmwd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rmwd ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0rmwd)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Bradenton ] )",
        "gold_entity_map": {
            "m.0rmwd": "Bradenton"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1906",
        "question": "what is the philadelphia church of god",
        "comp_type": null,
        "answer": [
            "m.0ppgx02"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ldnm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ldnm ns:base.schemastaging.non_profit_extra.classification ?x .\n}\n",
        "sexpr": "(JOIN (R base.schemastaging.non_profit_extra.classification) m.04ldnm)",
        "normed_sexpr": "( JOIN ( R [ base , schemastaging , non profit extra , classification ] ) [ Philadelphia Church of God ] )",
        "gold_entity_map": {
            "m.04ldnm": "Philadelphia Church of God"
        },
        "gold_relation_map": {
            "base.schemastaging.non_profit_extra.classification": "base , schemastaging , non profit extra , classification"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1913",
        "question": "where does luke skywalker live in star wars",
        "comp_type": null,
        "answer": [
            "m.0kcq0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f1bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f1bg ns:fictional_universe.fictional_character.places_lived ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.places_lived) m.0f1bg)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , places lived ] ) [ Luke Skywalker ] )",
        "gold_entity_map": {
            "m.0f1bg": "Luke Skywalker"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.places_lived": "fictional universe , fictional character , places lived"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1919",
        "question": "what did doctor kevorkian do",
        "comp_type": null,
        "answer": [
            "m.02nxqmh",
            "m.03gq2jw",
            "m.05t4q",
            "m.09jwl",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ctkj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ctkj ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01ctkj)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Jack Kevorkian ] )",
        "gold_entity_map": {
            "m.01ctkj": "Jack Kevorkian"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1920",
        "question": "where is chowchilla located",
        "comp_type": null,
        "answer": [
            "m.0l2gz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r186)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r186 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0r186)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Chowchilla ] )",
        "gold_entity_map": {
            "m.0r186": "Chowchilla"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1921",
        "question": "what country is vatican city in",
        "comp_type": null,
        "answer": [
            "m.03rjj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ytt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ytt ns:base.biblioness.bibs_location.country ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.country) m.07ytt)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Vatican City ] )",
        "gold_entity_map": {
            "m.07ytt": "Vatican City"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.country": "base , biblioness , bibs location , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1926",
        "question": "what did john howard study at university",
        "comp_type": null,
        "answer": [
            "m.01rr_d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chh05)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chh05 ns:people.person.education ?y .\n?y ns:education.education.degree ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.degree) (JOIN (R people.person.education) m.0chh05))",
        "normed_sexpr": "( JOIN ( R [ education , education , degree ] ) ( JOIN ( R [ people , person , education ] ) [ John Howard ] ) )",
        "gold_entity_map": {
            "m.0chh05": "John Howard"
        },
        "gold_relation_map": {
            "people.person.education": "people , person , education",
            "education.education.degree": "education , education , degree"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1927",
        "question": "what did duke ellington do",
        "comp_type": null,
        "answer": [
            "m.01c72t",
            "m.025352",
            "m.029bkp",
            "m.02hrh1q",
            "m.04l1gwb",
            "m.05vyk",
            "m.09jwl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bdlj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bdlj ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0bdlj)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Duke Ellington ] )",
        "gold_entity_map": {
            "m.0bdlj": "Duke Ellington"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1932",
        "question": "where are the atlanta falcons located",
        "comp_type": null,
        "answer": [
            "m.013yq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wsr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wsr ns:sports.sports_team.location ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.location) m.0wsr)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , location ] ) [ Atlanta Falcons ] )",
        "gold_entity_map": {
            "m.0wsr": "Atlanta Falcons"
        },
        "gold_relation_map": {
            "sports.sports_team.location": "sports , sports team , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1933",
        "question": "what is st francis patron saint of",
        "comp_type": null,
        "answer": [
            "Animals",
            "The Enviroment"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032p8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.032p8 ns:base.saints.saint.patronage ?x .\n}\n",
        "sexpr": "(JOIN (R base.saints.saint.patronage) m.032p8)",
        "normed_sexpr": "( JOIN ( R [ base , saints , saint , patronage ] ) [ Francis of Assisi ] )",
        "gold_entity_map": {
            "m.032p8": "Francis of Assisi"
        },
        "gold_relation_map": {
            "base.saints.saint.patronage": "base , saints , saint , patronage"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1938",
        "question": "what type of government does israel",
        "comp_type": null,
        "answer": [
            "m.018wl5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.03spz)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Israel ] )",
        "gold_entity_map": {
            "m.03spz": "Israel"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1941",
        "question": "where is downtown littleton",
        "comp_type": null,
        "answer": [
            "m.01n4w",
            "m.09c7w0",
            "m.0flbm",
            "m.0p03t",
            "m.0p0fc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g8lsf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g8lsf ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0g8lsf)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Littleton ] )",
        "gold_entity_map": {
            "m.0g8lsf": "Littleton"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1943",
        "question": "what division is cincinnati bengals in",
        "comp_type": null,
        "answer": [
            "m.068gzd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y49)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y49 ns:american_football.football_team.division ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.division) m.01y49)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , division ] ) [ Cincinnati Bengals ] )",
        "gold_entity_map": {
            "m.01y49": "Cincinnati Bengals"
        },
        "gold_relation_map": {
            "american_football.football_team.division": "american football , football team , division"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1945",
        "question": "where was toussaint charbonneau from",
        "comp_type": null,
        "answer": [
            "m.02p1lp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01wcc7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01wcc7 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01wcc7)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Toussaint Charbonneau ] )",
        "gold_entity_map": {
            "m.01wcc7": "Toussaint Charbonneau"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1947",
        "question": "what timezone is new mexico currently in",
        "comp_type": null,
        "answer": [
            "m.02hczc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05fjy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05fjy ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.05fjy)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ New Mexico ] )",
        "gold_entity_map": {
            "m.05fjy": "New Mexico"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1949",
        "question": "what is the legislature of missouri called",
        "comp_type": null,
        "answer": [
            "m.02zxrn",
            "m.03qj7vv",
            "m.0694qd",
            "m.069kvr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ych)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ych ns:government.governmental_jurisdiction.government_bodies ?x .\n}\n",
        "sexpr": "(JOIN (R government.governmental_jurisdiction.government_bodies) m.04ych)",
        "normed_sexpr": "( JOIN ( R [ government , governmental jurisdiction , government bodies ] ) [ Missouri ] )",
        "gold_entity_map": {
            "m.04ych": "Missouri"
        },
        "gold_relation_map": {
            "government.governmental_jurisdiction.government_bodies": "government , governmental jurisdiction , government bodies"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1950",
        "question": "what did harriet beecher stowe do as an abolitionist",
        "comp_type": null,
        "answer": [
            "g.15dq1ytr",
            "g.15dq9y23",
            "g.1hb_dnqy_",
            "m.013cf4cq",
            "m.01bfl4",
            "m.05kgsr",
            "m.066zl5r",
            "m.067121h",
            "m.0672sgp",
            "m.0676fkm",
            "m.067h0mw",
            "m.067p7nm",
            "m.0688bm6",
            "m.068j5b5",
            "m.068k0vx",
            "m.069c1_8",
            "m.069xp9p",
            "m.06b10pl",
            "m.06b1v73",
            "m.06b6613",
            "m.06bnnzy",
            "m.06bqcs4",
            "m.06bs6jg",
            "m.06c13vw",
            "m.06c301x",
            "m.06cz63w",
            "m.06d5sph",
            "m.06dfl80",
            "m.06dsbfy",
            "m.06f0scy",
            "m.06fgpg_",
            "m.06g4j_5",
            "m.06g5g0s",
            "m.06gkjg7",
            "m.06h9rz3",
            "m.06jh7sq",
            "m.06jr1pw",
            "m.06js41b",
            "m.06jw7v_",
            "m.06jyvf2",
            "m.06k51bl",
            "m.06kgy6l",
            "m.06kmnkr",
            "m.06l4myr",
            "m.06lcqwv",
            "m.06lfklj",
            "m.06lsp7b",
            "m.06mgylx",
            "m.06mptzz",
            "m.06n5fwm",
            "m.06ncf9p",
            "m.06ndh20",
            "m.06nh2f9",
            "m.06nhx6v",
            "m.06p_5zn",
            "m.06p182s",
            "m.06pd54z",
            "m.06pmx_5",
            "m.06psh0w",
            "m.06rh2ft",
            "m.06rp20p",
            "m.06skkpf",
            "m.06t4hf",
            "m.06tnnhg",
            "m.06txf7v",
            "m.06v7_ng",
            "m.06vjglg",
            "m.06vw7jc",
            "m.080p2fk",
            "m.0bbjf1x",
            "m.0bhjj4k",
            "m.0jgd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.015v00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.015v00 ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.015v00)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Harriet Beecher Stowe ] )",
        "gold_entity_map": {
            "m.015v00": "Harriet Beecher Stowe"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1954",
        "question": "where was the battle of appomattox located",
        "comp_type": null,
        "answer": [
            "m.01p_6k",
            "m.05c627j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054pn2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054pn2 ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.054pn2)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Battle of Appomattox Court House ] )",
        "gold_entity_map": {
            "m.054pn2": "Battle of Appomattox Court House"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1958",
        "question": "what time zone is fresno ca",
        "comp_type": null,
        "answer": [
            "m.02lcqs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0mzy7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0mzy7 ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0mzy7)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Fresno ] )",
        "gold_entity_map": {
            "m.0mzy7": "Fresno"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1960",
        "question": "what was the cause of death for sage stallone",
        "comp_type": null,
        "answer": [
            "m.0gk4g",
            "m.0lp66"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.091f9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.091f9c ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.091f9c)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Sage Stallone ] )",
        "gold_entity_map": {
            "m.091f9c": "Sage Stallone"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1961",
        "question": "where did queen isabella live",
        "comp_type": null,
        "answer": [
            "m.02z8x41"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jd6m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jd6m ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0jd6m)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Isabella I of Castile ] )",
        "gold_entity_map": {
            "m.0jd6m": "Isabella I of Castile"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1965",
        "question": "who won the super bowl xliv 2010",
        "comp_type": null,
        "answer": [
            "m.05g3v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_0gs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_0gs ns:sports.sports_championship_event.champion ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_championship_event.champion) m.04_0gs)",
        "normed_sexpr": "( JOIN ( R [ sports , sports championship event , champion ] ) [ Super Bowl XLIV ] )",
        "gold_entity_map": {
            "m.04_0gs": "Super Bowl XLIV"
        },
        "gold_relation_map": {
            "sports.sports_championship_event.champion": "sports , sports championship event , champion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1969",
        "question": "what years did the yankees win the championship",
        "comp_type": null,
        "answer": [
            "m.04j70r",
            "m.04j7sr",
            "m.04j7wv",
            "m.04jfmn",
            "m.04jfsz",
            "m.04n39cg",
            "m.04p1w0",
            "m.04td_r",
            "m.04tf_g",
            "m.04tfmb",
            "m.04tfmp",
            "m.04tfpd",
            "m.04tfpr",
            "m.04tfqf",
            "m.04tfr4",
            "m.04tfrh",
            "m.04tfs5",
            "m.04tfv7",
            "m.04tfwz",
            "m.04tfxn",
            "m.04tg0h",
            "m.04tg15",
            "m.04tg1w",
            "m.04tg3l",
            "m.04tg4_",
            "m.04tg4n",
            "m.0d1bbv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cqt41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cqt41 ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0cqt41)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ New York Yankees ] )",
        "gold_entity_map": {
            "m.0cqt41": "New York Yankees"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    }
]