[
    {
        "ID": "WebQTrn-2685",
        "question": "who inspired antonio vivaldi",
        "comp_type": null,
        "answer": [
            "m.03_f0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pth)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pth ns:influence.influence_node.influenced ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced) m.0pth)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced ] ) [ Antonio Vivaldi ] )",
        "gold_entity_map": {
            "m.0pth": "Antonio Vivaldi"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced": "influence , influence node , influenced"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2689",
        "question": "who started up mcdonalds",
        "comp_type": null,
        "answer": [
            "m.01n4dv",
            "m.0wf57dc",
            "m.0wf5829"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07gyp7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07gyp7 ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.07gyp7)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ McDonald's ] )",
        "gold_entity_map": {
            "m.07gyp7": "McDonald's"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2690",
        "question": "what major landforms are located in egypt",
        "comp_type": null,
        "answer": [
            "m.012v8q",
            "m.0284w",
            "m.04ggh49",
            "m.05sl2",
            "m.09d_r",
            "m.0cn9p5h"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.02k54 ns:location.location.contains ?y .\n?y ns:geography.geographical_feature.category ?x .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {},
        "gold_relation_map": {
            "geography.geographical_feature.category": "geography , geographical feature , category",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2691",
        "question": "who played nba finals 2010",
        "comp_type": null,
        "answer": [
            "m.0bwjj",
            "m.0jmk7"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  {\n    ns:m.0bx_x85 ns:sports.sports_championship_event.champion ?x .\n  }\n  UNION\n  {\n    ns:m.0bx_x85 ns:sports.sports_championship_event.runner_up ?x . \n  }\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0bx_x85": "2010 NBA Finals"
        },
        "gold_relation_map": {
            "sports.sports_championship_event.champion": "sports , sports championship event , champion",
            "sports.sports_championship_event.runner_up": "sports , sports championship event , runner up"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2697",
        "question": "what is st james palace",
        "comp_type": null,
        "answer": [
            "m.05zp8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yv_q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yv_q ns:architecture.building.building_function ?x .\n}\n",
        "sexpr": "(JOIN (R architecture.building.building_function) m.01yv_q)",
        "normed_sexpr": "( JOIN ( R [ architecture , building , building function ] ) [ St James's Palace ] )",
        "gold_entity_map": {
            "m.01yv_q": "St James's Palace"
        },
        "gold_relation_map": {
            "architecture.building.building_function": "architecture , building , building function"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2698",
        "question": "what airport to fly into to get to clearwater florida",
        "comp_type": null,
        "answer": [
            "m.03d2j65"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rqyx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rqyx ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.0rqyx)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Clearwater ] )",
        "gold_entity_map": {
            "m.0rqyx": "Clearwater"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2701",
        "question": "what currency do they use in qatar",
        "comp_type": null,
        "answer": [
            "m.05lf7w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0697s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0697s ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0697s)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Qatar ] )",
        "gold_entity_map": {
            "m.0697s": "Qatar"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2703",
        "question": "what did thoreau die from",
        "comp_type": null,
        "answer": [
            "m.07jwr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bwx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bwx3 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0bwx3)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Henry David Thoreau ] )",
        "gold_entity_map": {
            "m.0bwx3": "Henry David Thoreau"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2708",
        "question": "who is carl edwards racing for",
        "comp_type": null,
        "answer": [
            "m.06l92_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059s1q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059s1q ns:base.nascar.nascar_driver.team ?x .\n}\n",
        "sexpr": "(JOIN (R base.nascar.nascar_driver.team) m.059s1q)",
        "normed_sexpr": "( JOIN ( R [ base , nascar , nascar driver , team ] ) [ Carl Edwards ] )",
        "gold_entity_map": {
            "m.059s1q": "Carl Edwards"
        },
        "gold_relation_map": {
            "base.nascar.nascar_driver.team": "base , nascar , nascar driver , team"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2710",
        "question": "where are the florida marlins from",
        "comp_type": null,
        "answer": [
            "m.03msbs",
            "m.0f2v0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02__x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02__x ns:sports.sports_team.location ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.location) m.02__x)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , location ] ) [ Miami Marlins ] )",
        "gold_entity_map": {
            "m.02__x": "Miami Marlins"
        },
        "gold_relation_map": {
            "sports.sports_team.location": "sports , sports team , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2712",
        "question": "what language does romanian people speak",
        "comp_type": null,
        "answer": [
            "m.012psb",
            "m.02hxc3j",
            "m.02ztjwg",
            "m.08p4cr",
            "m.0cjk9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c1y ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.06c1y)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Romania ] )",
        "gold_entity_map": {
            "m.06c1y": "Romania"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2714",
        "question": "who nominated stephen g. breyer",
        "comp_type": null,
        "answer": [
            "m.0157m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016m0v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016m0v ns:people.appointee.position ?y .\n?y ns:people.appointment.appointed_by ?x .\n}\n",
        "sexpr": "(JOIN (R people.appointment.appointed_by) (JOIN (R people.appointee.position) m.016m0v))",
        "normed_sexpr": "( JOIN ( R [ people , appointment , appointed by ] ) ( JOIN ( R [ people , appointee , position ] ) [ Stephen Breyer ] ) )",
        "gold_entity_map": {
            "m.016m0v": "Stephen Breyer"
        },
        "gold_relation_map": {
            "people.appointee.position": "people , appointee , position",
            "people.appointment.appointed_by": "people , appointment , appointed by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2719",
        "question": "what did robin gibb died from",
        "comp_type": null,
        "answer": [
            "m.01dcqj",
            "m.03m3vr6",
            "m.0dq9p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0137hn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0137hn ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0137hn)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Robin Gibb ] )",
        "gold_entity_map": {
            "m.0137hn": "Robin Gibb"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2721",
        "question": "what were adolf hitler 's parents names",
        "comp_type": null,
        "answer": [
            "m.02p0d7",
            "m.0321wy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m9_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m9_ ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.07_m9_)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Adolf Hitler ] )",
        "gold_entity_map": {
            "m.07_m9_": "Adolf Hitler"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2723",
        "question": "what job does bill rancic have",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.02hrh1q",
            "m.03gjzk",
            "m.09x_r",
            "m.0cbd2",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02skv6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02skv6 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02skv6)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Bill Rancic ] )",
        "gold_entity_map": {
            "m.02skv6": "Bill Rancic"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2725",
        "question": "what does michael jackson like to eat",
        "comp_type": null,
        "answer": [
            "m.07_lq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:food.diet_follower.follows_diet ?x .\n}\n",
        "sexpr": "(JOIN (R food.diet_follower.follows_diet) m.09889g)",
        "normed_sexpr": "( JOIN ( R [ food , diet follower , follows diet ] ) [ Michael Jackson ] )",
        "gold_entity_map": {
            "m.09889g": "Michael Jackson"
        },
        "gold_relation_map": {
            "food.diet_follower.follows_diet": "food , diet follower , follows diet"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2726",
        "question": "who owns the new england patriots football team",
        "comp_type": null,
        "answer": [
            "m.050kkl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3b ns:sports.professional_sports_team.owner_s ?x .\n}\n",
        "sexpr": "(JOIN (R sports.professional_sports_team.owner_s) m.05g3b)",
        "normed_sexpr": "( JOIN ( R [ sports , professional sports team , owner s ] ) [ New England Patriots ] )",
        "gold_entity_map": {
            "m.05g3b": "New England Patriots"
        },
        "gold_relation_map": {
            "sports.professional_sports_team.owner_s": "sports , professional sports team , owner s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2729",
        "question": "what airport fly into for maui",
        "comp_type": null,
        "answer": [
            "m.01r3l2",
            "m.0398qm",
            "m.0398r9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jbs5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jbs5 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01xpjyz .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01xpjyz) (JOIN (R location.location.contains) m.0jbs5))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Airport ] ) ( JOIN ( R [ location , location , contains ] ) [ Maui ] ) )",
        "gold_entity_map": {
            "m.01xpjyz": "Airport",
            "m.0jbs5": "Maui"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01xpjyz": "Airport"
        }
    },
    {
        "ID": "WebQTrn-2730",
        "question": "what has lucy hale played in",
        "comp_type": null,
        "answer": [
            "m.02qrr8j",
            "m.05pbjnr",
            "m.0b6q30j",
            "m.0bq4q22",
            "m.0bwhdbl",
            "m.0crfwmx",
            "m.0gky0pl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0754d6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0754d6 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0754d6))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Lucy Hale ] ) )",
        "gold_entity_map": {
            "m.0754d6": "Lucy Hale"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2743",
        "question": "who is the coach of the la lakers",
        "comp_type": null,
        "answer": [
            "m.05jdzr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmk7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmk7 ns:basketball.basketball_team.head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R basketball.basketball_team.head_coach) m.0jmk7)",
        "normed_sexpr": "( JOIN ( R [ basketball , basketball team , head coach ] ) [ Los Angeles Lakers ] )",
        "gold_entity_map": {
            "m.0jmk7": "Los Angeles Lakers"
        },
        "gold_relation_map": {
            "basketball.basketball_team.head_coach": "basketball , basketball team , head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2744",
        "question": "what is the dominican republic 's capital",
        "comp_type": null,
        "answer": [
            "m.0fthl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027rn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027rn ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.027rn)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Dominican Republic ] )",
        "gold_entity_map": {
            "m.027rn": "Dominican Republic"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2750",
        "question": "what is the san francisco giants mascot",
        "comp_type": null,
        "answer": [
            "m.02q_hzh",
            "m.03_dwn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0713r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0713r ns:sports.sports_team.team_mascot ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.team_mascot) m.0713r)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , team mascot ] ) [ San Francisco Giants ] )",
        "gold_entity_map": {
            "m.0713r": "San Francisco Giants"
        },
        "gold_relation_map": {
            "sports.sports_team.team_mascot": "sports , sports team , team mascot"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2760",
        "question": "where did the arizona diamondbacks play",
        "comp_type": null,
        "answer": [
            "m.01k879"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0x0d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0x0d ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.0x0d)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Arizona Diamondbacks ] )",
        "gold_entity_map": {
            "m.0x0d": "Arizona Diamondbacks"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2761",
        "question": "what did fred davis do",
        "comp_type": null,
        "answer": [
            "m.02h665k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rhm_l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rhm_l ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02rhm_l)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Fred Davis ] )",
        "gold_entity_map": {
            "m.02rhm_l": "Fred Davis"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2762",
        "question": "what country was theodor schwann born in",
        "comp_type": null,
        "answer": [
            "m.025697"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040000)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040000 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.040000)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Theodor Schwann ] )",
        "gold_entity_map": {
            "m.040000": "Theodor Schwann"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2763",
        "question": "where is the fukushima daiichi located",
        "comp_type": null,
        "answer": [
            "m.0gqkx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vkzy2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vkzy2 ns:location.location.street_address ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R location.location.street_address) m.02vkzy2))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ location , location , street address ] ) [ Fukushima Daiichi Nuclear Power Plant ] ) )",
        "gold_entity_map": {
            "m.02vkzy2": "Fukushima Daiichi Nuclear Power Plant"
        },
        "gold_relation_map": {
            "location.location.street_address": "location , location , street address",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2764",
        "question": "what country was bin laden from",
        "comp_type": null,
        "answer": [
            "m.01z215"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05mg9)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05mg9 ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.05mg9)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Osama bin Laden ] )",
        "gold_entity_map": {
            "m.05mg9": "Osama bin Laden"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2766",
        "question": "where did darfur happen",
        "comp_type": null,
        "answer": [
            "m.02vtml"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d07gg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d07gg ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.0d07gg)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ War in Darfur ] )",
        "gold_entity_map": {
            "m.0d07gg": "War in Darfur"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2771",
        "question": "what movies has taylor momsen been in",
        "comp_type": null,
        "answer": [
            "m.025skpr",
            "m.0278x5r",
            "m.02r8_g6",
            "m.03z106",
            "m.06zqt3x",
            "m.0c0krr",
            "m.0crrc8",
            "m.0dgt4t",
            "m.0gkrt_f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.067qp2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.067qp2 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.067qp2))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Taylor Momsen ] ) )",
        "gold_entity_map": {
            "m.067qp2": "Taylor Momsen"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2773",
        "question": "what was henry ford best known for",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.025spv",
            "m.02h6nc9",
            "m.03sbb",
            "m.09j9h",
            "m.09x_r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gxm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gxm ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.03gxm)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Henry Ford ] )",
        "gold_entity_map": {
            "m.03gxm": "Henry Ford"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2775",
        "question": "what education does jeff corwin have",
        "comp_type": null,
        "answer": [
            "m.01ky7c",
            "m.02r7zpz",
            "m.035p0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03xsv3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03xsv3 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.03xsv3))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jeff Corwin ] ) )",
        "gold_entity_map": {
            "m.03xsv3": "Jeff Corwin"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2776",
        "question": "what movies has chris colfer been in",
        "comp_type": null,
        "answer": [
            "m.09g6jrt",
            "m.0gyj2ls",
            "m.0h1fktn",
            "m.0h4y8jg",
            "m.0ngl265"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07k51gd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07k51gd ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.07k51gd))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Chris Colfer ] ) )",
        "gold_entity_map": {
            "m.07k51gd": "Chris Colfer"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2777",
        "question": "where the queen of denmark lives",
        "comp_type": null,
        "answer": [
            "m.01lfy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2kv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2kv ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0g2kv))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Margrethe II of Denmark ] ) )",
        "gold_entity_map": {
            "m.0g2kv": "Margrethe II of Denmark"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2779",
        "question": "who was the real erin brockovich",
        "comp_type": null,
        "answer": [
            "m.012t_z",
            "m.015cjr",
            "m.01jbr2",
            "m.02hrh1q",
            "m.02n9jv",
            "m.07s467s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02nxk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02nxk ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02nxk)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Erin Brockovich ] )",
        "gold_entity_map": {
            "m.02nxk": "Erin Brockovich"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2781",
        "question": "what county is troy il in",
        "comp_type": null,
        "answer": [
            "m.0nv99"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0sch1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0sch1 ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0sch1)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Troy ] )",
        "gold_entity_map": {
            "m.0sch1": "Troy"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    }
]