[
    {
        "ID": "WebQTrn-3385",
        "question": "what did susan atkins die of",
        "comp_type": null,
        "answer": [
            "m.09969",
            "m.0qcr0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02h8k7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02h8k7 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.02h8k7)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Susan Atkins ] )",
        "gold_entity_map": {
            "m.02h8k7": "Susan Atkins"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3389",
        "question": "what country did marco polo come from",
        "comp_type": null,
        "answer": [
            "m.02wm6l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04wwh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04wwh ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.04wwh)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Marco Polo ] )",
        "gold_entity_map": {
            "m.04wwh": "Marco Polo"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3394",
        "question": "where did patrick henry live",
        "comp_type": null,
        "answer": [
            "m.0mns1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k5tb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k5tb ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0k5tb)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Patrick Henry ] )",
        "gold_entity_map": {
            "m.0k5tb": "Patrick Henry"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3395",
        "question": "what kind of government does mongolia",
        "comp_type": null,
        "answer": [
            "m.01dw03",
            "m.0glnsx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04w8f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04w8f ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.04w8f)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ Mongolia ] )",
        "gold_entity_map": {
            "m.04w8f": "Mongolia"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3397",
        "question": "where did jesse james die",
        "comp_type": null,
        "answer": [
            "m.0135p7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02khkd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02khkd ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.02khkd)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Jesse James ] )",
        "gold_entity_map": {
            "m.02khkd": "Jesse James"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3403",
        "question": "what happened to sir thomas cromwell",
        "comp_type": null,
        "answer": [
            "m.0jb19"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d05q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d05q ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0d05q)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Thomas Cromwell ] )",
        "gold_entity_map": {
            "m.0d05q": "Thomas Cromwell"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3412",
        "question": "where is victoria beckham from",
        "comp_type": null,
        "answer": [
            "m.01z26v"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cgfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cgfb ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0cgfb)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Victoria Beckham ] )",
        "gold_entity_map": {
            "m.0cgfb": "Victoria Beckham"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3416",
        "question": "who is daniel in the bible",
        "comp_type": null,
        "answer": [
            "m.066dv",
            "m.0cbd2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cts)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cts ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02cts)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Daniel ] )",
        "gold_entity_map": {
            "m.02cts": "Daniel"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3421",
        "question": "who is jojo simmons mother",
        "comp_type": null,
        "answer": [
            "m.0k2yz_5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.040j_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.040j_3 ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.02zsn .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.02zsn) (JOIN (R people.person.parents) m.040j_3))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Female ] ) ( JOIN ( R [ people , person , parents ] ) [ Joseph Simmons ] ) )",
        "gold_entity_map": {
            "m.040j_3": "Joseph Simmons",
            "m.02zsn": "Female"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3424",
        "question": "what year doug williams won the super bowl",
        "comp_type": null,
        "answer": [
            "m.0790_m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443ql)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443ql ns:sports.sports_award_winner.awards ?y .\n?y ns:sports.sports_award.season ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_award.season) (JOIN (R sports.sports_award_winner.awards) m.0443ql))",
        "normed_sexpr": "( JOIN ( R [ sports , sports award , season ] ) ( JOIN ( R [ sports , sports award winner , awards ] ) [ Doug Williams ] ) )",
        "gold_entity_map": {
            "m.0443ql": "Doug Williams"
        },
        "gold_relation_map": {
            "sports.sports_award_winner.awards": "sports , sports award winner , awards",
            "sports.sports_award.season": "sports , sports award , season"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3425",
        "question": "what country was osama bin laden killed in",
        "comp_type": null,
        "answer": [
            "m.05sb1"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x\nWHERE {\n  ns:m.05mg9 ns:people.deceased_person.place_of_death ?y . # Osama bin Laden\n  ?y ns:location.location.containedby ?x . \n  ?x ns:common.topic.notable_types ns:m.01mp .   # Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.05mg9": "Osama bin Laden",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-3432",
        "question": "what happened to rev. robert schuller",
        "comp_type": null,
        "answer": [
            "2015-04-02"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05vslll)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05vslll ns:people.deceased_person.date_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.date_of_death) m.05vslll)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , date of death ] ) [ Robert H. Schuller ] )",
        "gold_entity_map": {
            "m.05vslll": "Robert H. Schuller"
        },
        "gold_relation_map": {
            "people.deceased_person.date_of_death": "people , deceased person , date of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3436",
        "question": "where is located cornell university",
        "comp_type": null,
        "answer": [
            "m.03v_5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w3v ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.01w3v))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ Cornell University ] ) )",
        "gold_entity_map": {
            "m.01w3v": "Cornell University"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3440",
        "question": "what should i visit in venice",
        "comp_type": null,
        "answer": [
            "m.011zyz",
            "m.01d_55",
            "m.02_ph9",
            "m.02173k",
            "m.028597g",
            "m.03sp81",
            "m.03vslz",
            "m.07s5md0",
            "m.0cc21s",
            "m.0jw_d8z",
            "m.0pr3n",
            "m.0q41z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_pf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_pf ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.07_pf)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Venice ] )",
        "gold_entity_map": {
            "m.07_pf": "Venice"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3441",
        "question": "where james madison was born",
        "comp_type": null,
        "answer": [
            "m.0dl52g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0424m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0424m ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0424m)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ James Madison ] )",
        "gold_entity_map": {
            "m.0424m": "James Madison"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3446",
        "question": "where is tsonga born",
        "comp_type": null,
        "answer": [
            "m.04r5c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027q1_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027q1_3 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.027q1_3)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Jo-Wilfried Tsonga ] )",
        "gold_entity_map": {
            "m.027q1_3": "Jo-Wilfried Tsonga"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3448",
        "question": "what is paige halliwell 's powers",
        "comp_type": null,
        "answer": [
            "m.04kb1zt",
            "m.0fx57"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ymn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ymn7 ns:fictional_universe.fictional_character.powers_or_abilities ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.powers_or_abilities) m.01ymn7)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , powers or abilities ] ) [ Paige Matthews ] )",
        "gold_entity_map": {
            "m.01ymn7": "Paige Matthews"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.powers_or_abilities": "fictional universe , fictional character , powers or abilities"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3449",
        "question": "what did jean jacques rousseau write",
        "comp_type": null,
        "answer": [
            "g.112yg84tj",
            "g.1hc0g5tv2",
            "m.02z7wgs",
            "m.03p3fk",
            "m.04_00s",
            "m.04zyx7g",
            "m.05sy22j",
            "m.066v92k",
            "m.0673mbt",
            "m.067dxw6",
            "m.067h7_1",
            "m.068_gx2",
            "m.069gp83",
            "m.069tsz4",
            "m.06b1wks",
            "m.06b6z9_",
            "m.06b7nqx",
            "m.06bd5g9",
            "m.06bdwb4",
            "m.06bqv0m",
            "m.06c_mz5",
            "m.06c30_1",
            "m.06cb1_y",
            "m.06cdr3n",
            "m.06ckryk",
            "m.06clqwn",
            "m.06cq1lj",
            "m.06crq6n",
            "m.06dc490",
            "m.06dlbyn",
            "m.06dr1dg",
            "m.06dr6k7",
            "m.06dr6kh",
            "m.06dssdl",
            "m.06f4z1v",
            "m.06f944d",
            "m.06fbmlg",
            "m.06fplxl",
            "m.06g1g03",
            "m.06g83ms",
            "m.06ggtnh",
            "m.06grm6x",
            "m.06gyd8r",
            "m.06h16yb",
            "m.06h2w06",
            "m.06hb84s",
            "m.06hl1j8",
            "m.06hzj_x",
            "m.06j1wtt",
            "m.06jh05p",
            "m.06jky5c",
            "m.06kbjvb",
            "m.06khlfk",
            "m.06ktdj3",
            "m.06kx82b",
            "m.06l_b9r",
            "m.06lk597",
            "m.06llqsg",
            "m.06m0914",
            "m.06m86lk",
            "m.06m9gzw",
            "m.06mj7hk",
            "m.06mq85n",
            "m.06n_v_k",
            "m.06n1vnm",
            "m.06n8pct",
            "m.06nhdh1",
            "m.06p0q0n",
            "m.06pfhbz",
            "m.06pr0wy",
            "m.06pwtgv",
            "m.06pxfwm",
            "m.06q32h7",
            "m.06qhp98",
            "m.06qp18n",
            "m.06qwn0v",
            "m.06r86ll",
            "m.06rg48n",
            "m.06s85r0",
            "m.06sprg2",
            "m.06sq4s",
            "m.06t_9c9",
            "m.06tyct8",
            "m.06vcx9w",
            "m.06vgk6t",
            "m.06vjfqj",
            "m.06vkrw5",
            "m.06vndk0",
            "m.06vqvz2",
            "m.07hwv4",
            "m.088wfq",
            "m.0bmr1n",
            "m.0c1t4t_",
            "m.0c1t4t1",
            "m.0c1t4t7",
            "m.0c1t4tj",
            "m.0c1t4tq",
            "m.0c1t4tt",
            "m.0c1t4tx",
            "m.0c1t4v5",
            "m.0c1t4v8",
            "m.0c5fxs0",
            "m.0w0yttv",
            "m.0w0ywkv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0420y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0420y ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.0420y)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Jean-Jacques Rousseau ] )",
        "gold_entity_map": {
            "m.0420y": "Jean-Jacques Rousseau"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3450",
        "question": "what city is the state capital of washington",
        "comp_type": null,
        "answer": [
            "m.0fw1y"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081yw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081yw ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.capital) m.081yw)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Washington ] )",
        "gold_entity_map": {
            "m.081yw": "Washington"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.capital": "base , aareas , schema , administrative area , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3451",
        "question": "what does shawn johnson do",
        "comp_type": null,
        "answer": [
            "m.02hrh1q",
            "m.0385k",
            "m.0dypbr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026sgt0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026sgt0 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.026sgt0)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Shawn Johnson ] )",
        "gold_entity_map": {
            "m.026sgt0": "Shawn Johnson"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3453",
        "question": "where did nadia boulanger live",
        "comp_type": null,
        "answer": [
            "m.05qtj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02cx2m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02cx2m ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.02cx2m))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Nadia Boulanger ] ) )",
        "gold_entity_map": {
            "m.02cx2m": "Nadia Boulanger"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3462",
        "question": "what is there to do in montpelier vt",
        "comp_type": null,
        "answer": [
            "m.02h_zx",
            "m.03m93j1",
            "m.046frb",
            "m.04yr22z",
            "m.04yr24v",
            "m.04yr3vt",
            "m.059lxq3",
            "m.059m0t5",
            "m.059m198",
            "m.059qdds",
            "m.059qdq4",
            "m.059qdvl",
            "m.059qf07",
            "m.059qf82",
            "m.059qfky",
            "m.08p8jq",
            "m.0gsx_6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bjy7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bjy7 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0bjy7)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Montpelier ] )",
        "gold_entity_map": {
            "m.0bjy7": "Montpelier"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3464",
        "question": "when did michael jordan started playing basketball in the nba",
        "comp_type": null,
        "answer": [
            "1984"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.054c1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.054c1 ns:sports.pro_athlete.career_start ?x .\n}\n",
        "sexpr": "(JOIN (R sports.pro_athlete.career_start) m.054c1)",
        "normed_sexpr": "( JOIN ( R [ sports , pro athlete , career start ] ) [ Michael Jordan ] )",
        "gold_entity_map": {
            "m.054c1": "Michael Jordan"
        },
        "gold_relation_map": {
            "sports.pro_athlete.career_start": "sports , pro athlete , career start"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3466",
        "question": "in which city was president kennedy killed",
        "comp_type": null,
        "answer": [
            "m.0f2rq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.deceased_person.place_of_death ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R people.deceased_person.place_of_death) m.0d3k14))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , deceased person , place of death ] ) [ John F. Kennedy ] ) )",
        "gold_entity_map": {
            "m.0d3k14": "John F. Kennedy",
            "m.01m9": "City/Town/Village"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-3468",
        "question": "what is charlie sheen 's dad 's name",
        "comp_type": null,
        "answer": [
            "m.0hvb2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pllx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pllx ns:people.person.parents ?x .\n?x ns:people.person.gender ns:m.05zppz .\n}\n",
        "sexpr": "(AND (JOIN people.person.gender m.05zppz) (JOIN (R people.person.parents) m.01pllx))",
        "normed_sexpr": "( AND ( JOIN [ people , person , gender ] [ Male ] ) ( JOIN ( R [ people , person , parents ] ) [ Charlie Sheen ] ) )",
        "gold_entity_map": {
            "m.01pllx": "Charlie Sheen",
            "m.05zppz": "Male"
        },
        "gold_relation_map": {
            "people.person.gender": "people , person , gender",
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3469",
        "question": "how much mlb teams are there",
        "comp_type": null,
        "answer": [
            "m.01d5z",
            "m.01d6g",
            "m.01slc",
            "m.01yhm",
            "m.01yjl",
            "m.01ync",
            "m.01ypc",
            "m.02__x",
            "m.02zjfp",
            "m.03lpp_",
            "m.03m1n",
            "m.049n7",
            "m.04mjl",
            "m.04wmvz",
            "m.0512p",
            "m.051vz",
            "m.05g76",
            "m.05ll0s1",
            "m.05m_8",
            "m.05xvj",
            "m.061xq",
            "m.06wpc",
            "m.06x68",
            "m.0713r",
            "m.07147",
            "m.07l4z",
            "m.07l8f",
            "m.07l8x",
            "m.08k7gx",
            "m.0cqt41",
            "m.0x0d",
            "m.0x2p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09p14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09p14 ns:sports.sports_league.teams ?y .\n?y ns:sports.sports_league_participation.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_participation.team) (JOIN (R sports.sports_league.teams) m.09p14))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league participation , team ] ) ( JOIN ( R [ sports , sports league , teams ] ) [ Major League Baseball ] ) )",
        "gold_entity_map": {
            "m.09p14": "Major League Baseball"
        },
        "gold_relation_map": {
            "sports.sports_league.teams": "sports , sports league , teams",
            "sports.sports_league_participation.team": "sports , sports league participation , team"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3472",
        "question": "what sport do the harlem globetrotters play",
        "comp_type": null,
        "answer": [
            "m.018w8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01lwc3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01lwc3 ns:sports.sports_team.sport ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.sport) m.01lwc3)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , sport ] ) [ Harlem Globetrotters ] )",
        "gold_entity_map": {
            "m.01lwc3": "Harlem Globetrotters"
        },
        "gold_relation_map": {
            "sports.sports_team.sport": "sports , sports team , sport"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3474",
        "question": "where is poe buried now",
        "comp_type": null,
        "answer": [
            "m.04jlwk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lt8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lt8 ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.02lt8)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Edgar Allan Poe ] )",
        "gold_entity_map": {
            "m.02lt8": "Edgar Allan Poe"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3475",
        "question": "where is danish located",
        "comp_type": null,
        "answer": [
            "m.02j9z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k6nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k6nt ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0k6nt)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Denmark ] )",
        "gold_entity_map": {
            "m.0k6nt": "Denmark"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3480",
        "question": "who started mary kay",
        "comp_type": null,
        "answer": [
            "m.02crtt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05d8vj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05d8vj ns:organization.organization.founders ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.founders) m.05d8vj)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , founders ] ) [ Mary Kay ] )",
        "gold_entity_map": {
            "m.05d8vj": "Mary Kay"
        },
        "gold_relation_map": {
            "organization.organization.founders": "organization , organization , founders"
        },
        "gold_type_map": {}
    }
]