[
    {
        "ID": "WebQTrn-2602",
        "question": "what brand of guitar does steve vai play",
        "comp_type": null,
        "answer": [
            "m.03vk8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mxt_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mxt_ ns:music.guitarist.guitars_played ?x .\n?x ns:common.topic.notable_types ns:m.05czz29 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.05czz29) (JOIN (R music.guitarist.guitars_played) m.01mxt_))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Brand ] ) ( JOIN ( R [ music , guitarist , guitars played ] ) [ Steve Vai ] ) )",
        "gold_entity_map": {
            "m.05czz29": "Brand",
            "m.01mxt_": "Steve Vai"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "music.guitarist.guitars_played": "music , guitarist , guitars played"
        },
        "gold_type_map": {
            "m.05czz29": "Brand"
        }
    },
    {
        "ID": "WebQTrn-2603",
        "question": "what do hungarian people speak",
        "comp_type": null,
        "answer": [
            "m.02ztjwg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gj2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gj2 ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.03gj2)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Hungary ] )",
        "gold_entity_map": {
            "m.03gj2": "Hungary"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2605",
        "question": "in what town did ned kelly and his family grow up",
        "comp_type": null,
        "answer": [
            "m.08mh4_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014pyb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014pyb ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.014pyb)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Ned Kelly ] )",
        "gold_entity_map": {
            "m.014pyb": "Ned Kelly"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2606",
        "question": "what is bethenny frankel husband name",
        "comp_type": null,
        "answer": [
            "m.0j6k0h7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_l39)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_l39 ns:people.person.spouse_s ?y .\n?y ns:people.marriage.spouse ?x .\n}\n",
        "sexpr": "(JOIN (R people.marriage.spouse) (JOIN (R people.person.spouse_s) m.07_l39))",
        "normed_sexpr": "( JOIN ( R [ people , marriage , spouse ] ) ( JOIN ( R [ people , person , spouse s ] ) [ Bethenny Frankel ] ) )",
        "gold_entity_map": {
            "m.07_l39": "Bethenny Frankel"
        },
        "gold_relation_map": {
            "people.person.spouse_s": "people , person , spouse s",
            "people.marriage.spouse": "people , marriage , spouse"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2610",
        "question": "who influenced arthur conan doyle",
        "comp_type": null,
        "answer": [
            "m.01bdvj",
            "m.02lt8",
            "m.04093",
            "m.06lbp",
            "m.06y8v",
            "m.06zjbx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ky1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ky1 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.0ky1)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Arthur Conan Doyle ] )",
        "gold_entity_map": {
            "m.0ky1": "Arthur Conan Doyle"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2611",
        "question": "when was samuel pepys",
        "comp_type": null,
        "answer": [
            "m.07ssc",
            "m.0d05w3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06xxc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06xxc ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.06xxc)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Samuel Pepys ] )",
        "gold_entity_map": {
            "m.06xxc": "Samuel Pepys"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2615",
        "question": "what instrument does fela kuti play",
        "comp_type": null,
        "answer": [
            "m.02hnl",
            "m.0342h",
            "m.05148p4",
            "m.06ncr",
            "m.07gql"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01tw0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01tw0t ns:music.group_member.instruments_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_member.instruments_played) m.01tw0t)",
        "normed_sexpr": "( JOIN ( R [ music , group member , instruments played ] ) [ Fela Kuti ] )",
        "gold_entity_map": {
            "m.01tw0t": "Fela Kuti"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2618",
        "question": "where did woodrow wilson go to school",
        "comp_type": null,
        "answer": [
            "m.02pdhz",
            "m.05qgd9",
            "m.05zl0",
            "m.09kvv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.083q7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.083q7 ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.083q7))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Woodrow Wilson ] ) )",
        "gold_entity_map": {
            "m.083q7": "Woodrow Wilson"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2620",
        "question": "where can you buy amazon kindle",
        "comp_type": null,
        "answer": [
            "m.0mgkg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03d068f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03d068f ns:base.gadgets.gadget.brand ?x .\n}\n",
        "sexpr": "(JOIN (R base.gadgets.gadget.brand) m.03d068f)",
        "normed_sexpr": "( JOIN ( R [ base , gadgets , gadget , brand ] ) [ Amazon Kindle ] )",
        "gold_entity_map": {
            "m.03d068f": "Amazon Kindle"
        },
        "gold_relation_map": {
            "base.gadgets.gadget.brand": "base , gadgets , gadget , brand"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2623",
        "question": "what sports do people in france play",
        "comp_type": null,
        "answer": [
            "m.01l3vx",
            "m.0265nmb",
            "m.026t7kv",
            "m.02pnh1c",
            "m.02r4ht3",
            "m.02r6fjx",
            "m.02z62d_",
            "m.03c621f",
            "m.03d1s0h",
            "m.03nt95f",
            "m.03t49_",
            "m.03v1tr",
            "m.047v1fz",
            "m.059_t25",
            "m.05syjdc",
            "m.05syms_",
            "m.060wcb",
            "m.069wlg",
            "m.06b2z2",
            "m.06drlz",
            "m.06gd7y",
            "m.076_dy9",
            "m.09d8qr",
            "m.0b_nwg",
            "m.0b25q4",
            "m.0dghw5",
            "m.0dghwk",
            "m.0dghx8",
            "m.0dgj84",
            "m.0fyyrw",
            "m.0gksy2",
            "m.0gnygq",
            "m.0j7lffx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.0f8l9c)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ France ] )",
        "gold_entity_map": {
            "m.0f8l9c": "France"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2625",
        "question": "what language do native american indians speak",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.064_8sq",
            "m.06nm1",
            "m.0t_2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059_w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059_w ns:people.ethnicity.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.languages_spoken) m.059_w)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Native Americans in the United States ] )",
        "gold_entity_map": {
            "m.059_w": "Native Americans in the United States"
        },
        "gold_relation_map": {
            "people.ethnicity.languages_spoken": "people , ethnicity , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2626",
        "question": "where did tennessee williams live",
        "comp_type": null,
        "answer": [
            "m.04tgp",
            "m.06wxw",
            "m.0f2tj",
            "m.0wptj",
            "m.0wqzb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c4y8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c4y8 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0c4y8))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Tennessee Williams ] ) )",
        "gold_entity_map": {
            "m.0c4y8": "Tennessee Williams"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2630",
        "question": "where is port st lucie florida on the map",
        "comp_type": null,
        "answer": [
            "m.02xry",
            "m.09c7w0",
            "m.0f9080",
            "m.0jxjm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rsb4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rsb4 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0rsb4)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Port St. Lucie ] )",
        "gold_entity_map": {
            "m.0rsb4": "Port St. Lucie"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2633",
        "question": "who juan ponce de leon",
        "comp_type": null,
        "answer": [
            "m.040vc4s"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0123f1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0123f1 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0123f1)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Juan Ponce de León ] )",
        "gold_entity_map": {
            "m.0123f1": "Juan Ponce de León"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2637",
        "question": "where did the loma prieta earthquake occur",
        "comp_type": null,
        "answer": [
            "m.06pvr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mv1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mv1y ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.01mv1y)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ 1989 Loma Prieta earthquake ] )",
        "gold_entity_map": {
            "m.01mv1y": "1989 Loma Prieta earthquake"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2639",
        "question": "what is time zone in new orleans",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2tj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2tj ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0f2tj)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ New Orleans ] )",
        "gold_entity_map": {
            "m.0f2tj": "New Orleans"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2640",
        "question": "what type of poetry does john donne write",
        "comp_type": null,
        "answer": [
            "m.01lw_t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0413p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0413p ns:book.author.school_or_movement ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.school_or_movement) m.0413p)",
        "normed_sexpr": "( JOIN ( R [ book , author , school or movement ] ) [ John Donne ] )",
        "gold_entity_map": {
            "m.0413p": "John Donne"
        },
        "gold_relation_map": {
            "book.author.school_or_movement": "book , author , school or movement"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2641",
        "question": "where did helen keller die",
        "comp_type": null,
        "answer": [
            "m.0rd55"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03ppx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03ppx ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.03ppx)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Helen Keller ] )",
        "gold_entity_map": {
            "m.03ppx": "Helen Keller"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2646",
        "question": "where did johann sebastian bach live",
        "comp_type": null,
        "answer": [
            "m.0135kl",
            "m.01scv0",
            "m.047sq2",
            "m.04kf4",
            "m.04pwrt",
            "m.064_v2",
            "m.0cpyv",
            "m.0g8gq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_f0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_f0 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.03_f0))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Johann Sebastian Bach ] ) )",
        "gold_entity_map": {
            "m.03_f0": "Johann Sebastian Bach"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2648",
        "question": "what timezone is malaysia",
        "comp_type": null,
        "answer": [
            "m.0ch2v5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09pmkv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09pmkv ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.09pmkv)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Malaysia ] )",
        "gold_entity_map": {
            "m.09pmkv": "Malaysia"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2649",
        "question": "where is alex smith from",
        "comp_type": null,
        "answer": [
            "m.010rvx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dfhp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dfhp ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.05dfhp)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Alex Smith ] )",
        "gold_entity_map": {
            "m.05dfhp": "Alex Smith"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2650",
        "question": "where was alice walker born",
        "comp_type": null,
        "answer": [
            "m.0frf_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0bv70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0bv70 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0bv70)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Alice Walker ] )",
        "gold_entity_map": {
            "m.0bv70": "Alice Walker"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2655",
        "question": "when did joe mcelderry won x factor",
        "comp_type": null,
        "answer": [
            "m.06wcg5g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09d89qd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09d89qd ns:award.competitor.competitions_won ?x .\n}\n",
        "sexpr": "(JOIN (R award.competitor.competitions_won) m.09d89qd)",
        "normed_sexpr": "( JOIN ( R [ award , competitor , competitions won ] ) [ Joseph McElderry ] )",
        "gold_entity_map": {
            "m.09d89qd": "Joseph McElderry"
        },
        "gold_relation_map": {
            "award.competitor.competitions_won": "award , competitor , competitions won"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2657",
        "question": "who was the members of blackstreet",
        "comp_type": null,
        "answer": [
            "m.01t8c_8",
            "m.01wrbpv",
            "m.02rnwqn",
            "m.03f4qq_",
            "m.03h1wwg",
            "m.0b90b2",
            "m.0dhrg5",
            "m.0h4xf1r",
            "m.0h4xf2b",
            "m.0l239b8",
            "m.0wk_8qw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fm10)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fm10 ns:music.musical_group.member ?y .\n?y ns:music.group_membership.member ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.member) (JOIN (R music.musical_group.member) m.01fm10))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , member ] ) ( JOIN ( R [ music , musical group , member ] ) [ Blackstreet ] ) )",
        "gold_entity_map": {
            "m.01fm10": "Blackstreet"
        },
        "gold_relation_map": {
            "music.musical_group.member": "music , musical group , member",
            "music.group_membership.member": "music , group membership , member"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2660",
        "question": "what does a american rottweiler look like",
        "comp_type": null,
        "answer": [
            "m.019sc",
            "m.037zsb",
            "m.05n23l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01nw62)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01nw62 ns:base.petbreeds.dog_breed.color ?x .\n}\n",
        "sexpr": "(JOIN (R base.petbreeds.dog_breed.color) m.01nw62)",
        "normed_sexpr": "( JOIN ( R [ base , petbreeds , dog breed , color ] ) [ Rottweiler ] )",
        "gold_entity_map": {
            "m.01nw62": "Rottweiler"
        },
        "gold_relation_map": {
            "base.petbreeds.dog_breed.color": "base , petbreeds , dog breed , color"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2661",
        "question": "who created the character of sherlock holmes",
        "comp_type": null,
        "answer": [
            "m.0ky1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06rkl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06rkl ns:fictional_universe.fictional_character.character_created_by ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.character_created_by) m.06rkl)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , character created by ] ) [ Sherlock Holmes ] )",
        "gold_entity_map": {
            "m.06rkl": "Sherlock Holmes"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.character_created_by": "fictional universe , fictional character , character created by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2662",
        "question": "what does scottish people speak",
        "comp_type": null,
        "answer": [
            "m.01bvf",
            "m.01v58_",
            "m.05p2d",
            "m.070zw",
            "m.0h407"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06q1r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06q1r ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.06q1r)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Scotland ] )",
        "gold_entity_map": {
            "m.06q1r": "Scotland"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2663",
        "question": "who all has kim kardashian dated",
        "comp_type": null,
        "answer": [
            "m.01d1st",
            "m.01nr7rn",
            "m.033t8w",
            "m.039bpc",
            "m.0521n6",
            "m.05cb70"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261x8t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261x8t ns:base.popstra.celebrity.dated ?y .\n?y ns:base.popstra.dated.participant ?x .\n}\n",
        "sexpr": "(JOIN (R base.popstra.dated.participant) (JOIN (R base.popstra.celebrity.dated) m.0261x8t))",
        "normed_sexpr": "( JOIN ( R [ base , popstra , dated , participant ] ) ( JOIN ( R [ base , popstra , celebrity , dated ] ) [ Kim Kardashian ] ) )",
        "gold_entity_map": {
            "m.0261x8t": "Kim Kardashian"
        },
        "gold_relation_map": {
            "base.popstra.dated.participant": "base , popstra , dated , participant",
            "base.popstra.celebrity.dated": "base , popstra , celebrity , dated"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2671",
        "question": "what channel is the mtv vma awards on",
        "comp_type": null,
        "answer": [
            "m.04rqd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01r470)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01r470 ns:award.award.presented_by ?x .\n}\n",
        "sexpr": "(JOIN (R award.award.presented_by) m.01r470)",
        "normed_sexpr": "( JOIN ( R [ award , award , presented by ] ) [ MTV Video Music Award ] )",
        "gold_entity_map": {
            "m.01r470": "MTV Video Music Award"
        },
        "gold_relation_map": {
            "award.award.presented_by": "award , award , presented by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2674",
        "question": "where is usc from",
        "comp_type": null,
        "answer": [
            "m.06yxd",
            "m.09c7w0",
            "m.0fv_t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03tw2s)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03tw2s ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.03tw2s)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ University of South Carolina ] )",
        "gold_entity_map": {
            "m.03tw2s": "University of South Carolina"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2678",
        "question": "what to see in dallas tx",
        "comp_type": null,
        "answer": [
            "m.01phy6",
            "m.01vpjb",
            "m.0277mw9",
            "m.0285_gh",
            "m.02vk8s",
            "m.03byk46",
            "m.03c_nbv",
            "m.047dvy5",
            "m.059k_2",
            "m.059l1m",
            "m.06cdr9",
            "m.06h1db",
            "m.06q9lq",
            "m.06w96j",
            "m.077c_4",
            "m.07s8wz",
            "m.0c4k7b",
            "m.0ct4dp",
            "m.0fr_0v",
            "m.0g9v1q",
            "m.0glzkm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2rq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2rq ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0f2rq)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Dallas ] )",
        "gold_entity_map": {
            "m.0f2rq": "Dallas"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2680",
        "question": "what is president abraham lincoln known for",
        "comp_type": null,
        "answer": [
            "m.016fc2",
            "m.04gc2",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gzh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gzh ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0gzh)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Abraham Lincoln ] )",
        "gold_entity_map": {
            "m.0gzh": "Abraham Lincoln"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2683",
        "question": "what year did the vietnam war happen",
        "comp_type": null,
        "answer": [
            "1955-11-01"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_nf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_nf ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.07_nf)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ Vietnam War ] )",
        "gold_entity_map": {
            "m.07_nf": "Vietnam War"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    }
]