[
    {
        "ID": "WebQTrn-2786",
        "question": "where does the appalachian trail run through",
        "comp_type": null,
        "answer": [
            "m.02jwvm",
            "m.03rkq_",
            "m.0lm0n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0lyj0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0lyj0 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0lyj0)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Appalachian National Scenic Trail ] )",
        "gold_entity_map": {
            "m.0lyj0": "Appalachian National Scenic Trail"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2789",
        "question": "what unicef stands for",
        "comp_type": null,
        "answer": [
            "United Nations Children's Fund"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n  ns:m.0fxc0 ns:common.topic.alias ?x .\n  FILTER (lang(?x) = 'en')\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.0fxc0": "UNICEF"
        },
        "gold_relation_map": {
            "common.topic.alias": "common , topic , alias"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2793",
        "question": "what color are the baltimore ravens",
        "comp_type": null,
        "answer": [
            "m.019sc",
            "m.01l849",
            "m.083jv",
            "m.09ggk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:sports.sports_team.colors ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.colors) m.01ct6)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , colors ] ) [ Baltimore Ravens ] )",
        "gold_entity_map": {
            "m.01ct6": "Baltimore Ravens"
        },
        "gold_relation_map": {
            "sports.sports_team.colors": "sports , sports team , colors"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2796",
        "question": "what is tim tebow 's religion",
        "comp_type": null,
        "answer": [
            "m.01lp8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g7km1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g7km1 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.0g7km1)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Tim Tebow ] )",
        "gold_entity_map": {
            "m.0g7km1": "Tim Tebow"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2799",
        "question": "what does anderson cooper do",
        "comp_type": null,
        "answer": [
            "m.015cjr",
            "m.01d_h8",
            "m.03gjzk",
            "m.0d1pc",
            "m.0d8qb",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02z14n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02z14n ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.02z14n)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Anderson Cooper ] )",
        "gold_entity_map": {
            "m.02z14n": "Anderson Cooper"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2800",
        "question": "what movies did matt bomer play in",
        "comp_type": null,
        "answer": [
            "g.11b7k3tft3",
            "m.01262msv",
            "m.06dq4r",
            "m.090fjm",
            "m.0dr_xmk",
            "m.0h63gl9",
            "m.0hyn2x8",
            "m.0nffcbb",
            "m.0ngl265",
            "m.0r8phd0",
            "m.0tlt31w",
            "m.0y4jvvn",
            "m.0yt16nd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03pmk3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03pmk3 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.03pmk3))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Matt Bomer ] ) )",
        "gold_entity_map": {
            "m.03pmk3": "Matt Bomer"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2801",
        "question": "who is ellen bernstein",
        "comp_type": null,
        "answer": [
            "m.02hrh1q",
            "m.0377kt",
            "m.0d1pc",
            "m.0np9r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019f2f)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019f2f ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.019f2f)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Ellen Burstyn ] )",
        "gold_entity_map": {
            "m.019f2f": "Ellen Burstyn"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2803",
        "question": "when was reagan inaugurated",
        "comp_type": null,
        "answer": [
            "m.05bry73",
            "m.05bryb8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:base.inaugurations.inauguration_speaker.inauguration ?x .\n}\n",
        "sexpr": "(JOIN (R base.inaugurations.inauguration_speaker.inauguration) m.06c0j)",
        "normed_sexpr": "( JOIN ( R [ base , inaugurations , inauguration speaker , inauguration ] ) [ Ronald Reagan ] )",
        "gold_entity_map": {
            "m.06c0j": "Ronald Reagan"
        },
        "gold_relation_map": {
            "base.inaugurations.inauguration_speaker.inauguration": "base , inaugurations , inauguration speaker , inauguration"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2807",
        "question": "what did james k polk believe in",
        "comp_type": null,
        "answer": [
            "m.051kv",
            "m.0631_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042f1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042f1 ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.042f1)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ James K. Polk ] )",
        "gold_entity_map": {
            "m.042f1": "James K. Polk"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2808",
        "question": "what currency does south africa have",
        "comp_type": null,
        "answer": [
            "m.01rmbs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hzlz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hzlz ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0hzlz)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ South Africa ] )",
        "gold_entity_map": {
            "m.0hzlz": "South Africa"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2809",
        "question": "where did jerome david salinger died",
        "comp_type": null,
        "answer": [
            "m.0xk73"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.041_y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.041_y ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.041_y)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ J. D. Salinger ] )",
        "gold_entity_map": {
            "m.041_y": "J. D. Salinger"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2811",
        "question": "what airport is closest to cancun",
        "comp_type": null,
        "answer": [
            "m.05fkzs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01q98m)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01q98m ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.01q98m)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Cancún ] )",
        "gold_entity_map": {
            "m.01q98m": "Cancún"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2812",
        "question": "where is somalia located",
        "comp_type": null,
        "answer": [
            "m.0dg3n1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06tgw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06tgw ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.06tgw)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Somalia ] )",
        "gold_entity_map": {
            "m.06tgw": "Somalia"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2814",
        "question": "who is the head coach of the chicago blackhawks",
        "comp_type": null,
        "answer": [
            "m.03clfy"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jnlm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jnlm ns:ice_hockey.hockey_team.coach ?x .\n}\n",
        "sexpr": "(JOIN (R ice_hockey.hockey_team.coach) m.0jnlm)",
        "normed_sexpr": "( JOIN ( R [ ice hockey , hockey team , coach ] ) [ Chicago Blackhawks ] )",
        "gold_entity_map": {
            "m.0jnlm": "Chicago Blackhawks"
        },
        "gold_relation_map": {
            "ice_hockey.hockey_team.coach": "ice hockey , hockey team , coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2815",
        "question": "where was john f kennedy raised",
        "comp_type": null,
        "answer": [
            "m.0p9z5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d3k14)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d3k14 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0d3k14)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ John F. Kennedy ] )",
        "gold_entity_map": {
            "m.0d3k14": "John F. Kennedy"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2816",
        "question": "what does kat dennings star in",
        "comp_type": null,
        "answer": [
            "m.0125h18g",
            "m.02vq583",
            "m.03cyslc",
            "m.0408m53",
            "m.04cv8_z",
            "m.04gz04",
            "m.05my82g",
            "m.05qpqj6",
            "m.05ztyqq",
            "m.062zjtt",
            "m.06fpsx",
            "m.0811_b",
            "m.0bk6nc",
            "m.0crx4f4",
            "m.0d1tgy",
            "m.0frpxh",
            "m.0gxw7g1",
            "m.0h_cvyh",
            "m.0j9knfv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b0kzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b0kzw ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0b0kzw))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Kat Dennings ] ) )",
        "gold_entity_map": {
            "m.0b0kzw": "Kat Dennings"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2818",
        "question": "where does volga river start",
        "comp_type": null,
        "answer": [
            "m.05ktg3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h2hw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h2hw ns:geography.river.origin ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.origin) m.0h2hw)",
        "normed_sexpr": "( JOIN ( R [ geography , river , origin ] ) [ Volga River ] )",
        "gold_entity_map": {
            "m.0h2hw": "Volga River"
        },
        "gold_relation_map": {
            "geography.river.origin": "geography , river , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2819",
        "question": "what are the major sports played in venezuela",
        "comp_type": null,
        "answer": [
            "m.03mf9_m",
            "m.03w9ng1",
            "m.03zkr8",
            "m.0kn5hg6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07ylj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07ylj ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.07ylj)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ Venezuela ] )",
        "gold_entity_map": {
            "m.07ylj": "Venezuela"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2820",
        "question": "what did roger sherman do for a living",
        "comp_type": null,
        "answer": [
            "m.04gc2",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01mp_3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01mp_3 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01mp_3)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Roger Sherman ] )",
        "gold_entity_map": {
            "m.01mp_3": "Roger Sherman"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2826",
        "question": "where does eddie bravo teach",
        "comp_type": null,
        "answer": [
            "m.0jbrr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08rm_x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08rm_x ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.08rm_x))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Eddie Bravo ] ) )",
        "gold_entity_map": {
            "m.08rm_x": "Eddie Bravo"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2828",
        "question": "where does sally pearson live",
        "comp_type": null,
        "answer": [
            "m.0g4g7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0287hgn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0287hgn ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0287hgn))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Sally Pearson ] ) )",
        "gold_entity_map": {
            "m.0287hgn": "Sally Pearson"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2830",
        "question": "where is madeira",
        "comp_type": null,
        "answer": [
            "m.05r4w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.administrative_parent) m.04_z1)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , administrative parent ] ) [ Madeira ] )",
        "gold_entity_map": {
            "m.04_z1": "Madeira"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.administrative_parent": "base , aareas , schema , administrative area , administrative parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2831",
        "question": "what country is joseph prince from",
        "comp_type": null,
        "answer": [
            "m.06t2t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rjg1g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rjg1g ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02rjg1g)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Joseph Prince ] )",
        "gold_entity_map": {
            "m.02rjg1g": "Joseph Prince"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2836",
        "question": "where is the sistine chapel by michelangelo",
        "comp_type": null,
        "answer": [
            "m.07ytt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kbls)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kbls ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.containedby) m.0kbls))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , containedby ] ) [ Sistine Chapel ] ) )",
        "gold_entity_map": {
            "m.01mp": "Country",
            "m.0kbls": "Sistine Chapel"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-2840",
        "question": "where is christina aguilera from",
        "comp_type": null,
        "answer": [
            "m.0y62n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0127s7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0127s7 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0127s7)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Christina Aguilera ] )",
        "gold_entity_map": {
            "m.0127s7": "Christina Aguilera"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2841",
        "question": "what are fun things to do in philadelphia",
        "comp_type": null,
        "answer": [
            "m.01_yh5",
            "m.012h3h",
            "m.01h123",
            "m.0246rh",
            "m.0294_l",
            "m.02dqlt",
            "m.02v_wpr",
            "m.02vz87s",
            "m.02xktz",
            "m.03bx8tr",
            "m.03ckb2r",
            "m.03cvd3n",
            "m.04x8mj",
            "m.05ycst",
            "m.06_1bm",
            "m.06lbq9",
            "m.06z_sp5",
            "m.077pcr",
            "m.09qvxj",
            "m.0bhbkg",
            "m.0bhbq9",
            "m.0dl_db",
            "m.0fsw4_",
            "m.0h_9pvw",
            "m.0h7pp7c",
            "m.0jk_ntj",
            "m.0k149_w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dclg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dclg ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0dclg)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Philadelphia ] )",
        "gold_entity_map": {
            "m.0dclg": "Philadelphia"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2843",
        "question": "where did jackie robinson go to school",
        "comp_type": null,
        "answer": [
            "m.02gn8s",
            "m.0769_zc",
            "m.084wvj",
            "m.09f2j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443c ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0443c))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jackie Robinson ] ) )",
        "gold_entity_map": {
            "m.0443c": "Jackie Robinson"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2849",
        "question": "where was f scott fitzgerald education",
        "comp_type": null,
        "answer": [
            "m.023pj6",
            "m.05zl0",
            "m.0fh_my"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02zjd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02zjd ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.02zjd))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ F. Scott Fitzgerald ] ) )",
        "gold_entity_map": {
            "m.02zjd": "F. Scott Fitzgerald"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2854",
        "question": "where to go in phnom penh cambodia",
        "comp_type": null,
        "answer": [
            "m.026462",
            "m.02pjmts",
            "m.085f_0",
            "m.0b74mvg",
            "m.0cbw_y",
            "m.0cbws_",
            "m.0cbww1",
            "m.0cbxfv",
            "m.0gx_53z",
            "m.0lkvv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dlwj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dlwj ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0dlwj)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Phnom Penh ] )",
        "gold_entity_map": {
            "m.0dlwj": "Phnom Penh"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2855",
        "question": "what city was ronald reagan born in",
        "comp_type": null,
        "answer": [
            "m.0sj7b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:people.person.place_of_birth ?x .\n?x ns:common.topic.notable_types ns:m.01m9 .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01m9) (JOIN (R people.person.place_of_birth) m.06c0j))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ City/Town/Village ] ) ( JOIN ( R [ people , person , place of birth ] ) [ Ronald Reagan ] ) )",
        "gold_entity_map": {
            "m.01m9": "City/Town/Village",
            "m.06c0j": "Ronald Reagan"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01m9": "City/Town/Village"
        }
    },
    {
        "ID": "WebQTrn-2858",
        "question": "what to do in nadi fiji",
        "comp_type": null,
        "answer": [
            "m.03cybpb",
            "m.0921g5",
            "m.0934gl",
            "m.094tcx",
            "m.095sm6",
            "m.0jz1q62",
            "m.0jz1q6f",
            "m.0k6xpc5",
            "m.0k6xpst",
            "m.0k6xq19"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.022wr3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.022wr3 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.022wr3)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Nadi, Fiji ] )",
        "gold_entity_map": {
            "m.022wr3": "Nadi, Fiji"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2862",
        "question": "what is the postcode for seoul south korea",
        "comp_type": null,
        "answer": [
            "m.0cvrg0c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hsqf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hsqf ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0hsqf)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Seoul ] )",
        "gold_entity_map": {
            "m.0hsqf": "Seoul"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2865",
        "question": "where is bosnia",
        "comp_type": null,
        "answer": [
            "m.02j9z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0166b)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Bosnia and Herzegovina ] )",
        "gold_entity_map": {
            "m.0166b": "Bosnia and Herzegovina"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    }
]