[
    {
        "ID": "WebQTrn-78",
        "question": "what school did joan miro attend",
        "comp_type": null,
        "answer": [
            "m.06w5jjm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g_6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g_6k ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0g_6k))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Joan Mir ] ) )",
        "gold_entity_map": {
            "m.0g_6k": "Joan Mir"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-80",
        "question": "who was vincent van gogh inspired by",
        "comp_type": null,
        "answer": [
            "m.016s03",
            "m.01xnj",
            "m.0452w",
            "m.056100",
            "m.05t6y5",
            "m.063mx",
            "m.08hrl7",
            "m.0bskv2",
            "m.0fmjym",
            "m.0pwnh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07_m2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07_m2 ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.07_m2)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Vincent van Gogh ] )",
        "gold_entity_map": {
            "m.07_m2": "Vincent van Gogh"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-83",
        "question": "when did the new york knicks win a championship",
        "comp_type": null,
        "answer": [
            "m.0cs1kg",
            "m.0cs1x4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jm3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jm3v ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0jm3v)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ New York Knicks ] )",
        "gold_entity_map": {
            "m.0jm3v": "New York Knicks"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-86",
        "question": "where is jack daniels factory",
        "comp_type": null,
        "answer": [
            "m.07h34"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.021zmy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.021zmy ns:distilled_spirits.distillery.region ?x .\n}\n",
        "sexpr": "(JOIN (R distilled_spirits.distillery.region) m.021zmy)",
        "normed_sexpr": "( JOIN ( R [ distilled spirits , distillery , region ] ) [ Jack Daniel's ] )",
        "gold_entity_map": {
            "m.021zmy": "Jack Daniel's"
        },
        "gold_relation_map": {
            "distilled_spirits.distillery.region": "distilled spirits , distillery , region"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-88",
        "question": "where is santa clara university",
        "comp_type": null,
        "answer": [
            "m.01n7q",
            "m.09c7w0",
            "m.0r6cx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.027xx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.027xx3 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.027xx3)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Santa Clara University ] )",
        "gold_entity_map": {
            "m.027xx3": "Santa Clara University"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-90",
        "question": "where did timothy mcveigh go to prison",
        "comp_type": null,
        "answer": [
            "m.051c03"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07rp8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07rp8 ns:base.prison.prisoner.imprisoned ?y .\n?y ns:base.prison.imprisonment.prison ?x .\n}\n",
        "sexpr": "(JOIN (R base.prison.imprisonment.prison) (JOIN (R base.prison.prisoner.imprisoned) m.07rp8))",
        "normed_sexpr": "( JOIN ( R [ base , prison , imprisonment , prison ] ) ( JOIN ( R [ base , prison , prisoner , imprisoned ] ) [ Timothy McVeigh ] ) )",
        "gold_entity_map": {
            "m.07rp8": "Timothy McVeigh"
        },
        "gold_relation_map": {
            "base.prison.imprisonment.prison": "base , prison , imprisonment , prison",
            "base.prison.prisoner.imprisoned": "base , prison , prisoner , imprisoned"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-91",
        "question": "what sea does the yangtze river flow into",
        "comp_type": null,
        "answer": [
            "m.018smn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01y4t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01y4t ns:geography.river.mouth ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.mouth) m.01y4t)",
        "normed_sexpr": "( JOIN ( R [ geography , river , mouth ] ) [ Yangtze ] )",
        "gold_entity_map": {
            "m.01y4t": "Yangtze"
        },
        "gold_relation_map": {
            "geography.river.mouth": "geography , river , mouth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-97",
        "question": "where do the ny rangers play",
        "comp_type": null,
        "answer": [
            "m.0j_66"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hmtk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hmtk ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.0hmtk)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ New York Rangers ] )",
        "gold_entity_map": {
            "m.0hmtk": "New York Rangers"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-98",
        "question": "where is jefferson davis buried",
        "comp_type": null,
        "answer": [
            "m.048sj4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.043q0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.043q0 ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.043q0)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Jefferson Davis ] )",
        "gold_entity_map": {
            "m.043q0": "Jefferson Davis"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-101",
        "question": "what years have the dallas cowboys won the superbowl",
        "comp_type": null,
        "answer": [
            "m.076n1",
            "m.076q3",
            "m.076vy",
            "m.076w8",
            "m.076wz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02896)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02896 ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.02896)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Dallas Cowboys ] )",
        "gold_entity_map": {
            "m.02896": "Dallas Cowboys"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-102",
        "question": "what awards has louis sachar won",
        "comp_type": null,
        "answer": [
            "m.01cd7p",
            "m.027x4ws",
            "m.03p0vr7",
            "m.09kkqzd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bq8d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bq8d ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n",
        "sexpr": "(JOIN (R award.award_honor.award) (JOIN (R award.award_winner.awards_won) m.01bq8d))",
        "normed_sexpr": "( JOIN ( R [ award , award honor , award ] ) ( JOIN ( R [ award , award winner , awards won ] ) [ Louis Sachar ] ) )",
        "gold_entity_map": {
            "m.01bq8d": "Louis Sachar"
        },
        "gold_relation_map": {
            "award.award_honor.award": "award , award honor , award",
            "award.award_winner.awards_won": "award , award winner , awards won"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-108",
        "question": "where did benjamin franklin died",
        "comp_type": null,
        "answer": [
            "m.0dclg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.019fz)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Benjamin Franklin ] )",
        "gold_entity_map": {
            "m.019fz": "Benjamin Franklin"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-111",
        "question": "what is the local language of israel",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.03hkp",
            "m.04gd7",
            "m.04p7x",
            "m.0880p",
            "m.0jzc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.03spz)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Israel ] )",
        "gold_entity_map": {
            "m.03spz": "Israel"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-112",
        "question": "what city and state was the air force academy established",
        "comp_type": null,
        "answer": [
            "m.01vsl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k9wp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k9wp ns:organization.organization.headquarters ?y .\n?y ns:location.mailing_address.citytown ?x .\n}\n",
        "sexpr": "(JOIN (R location.mailing_address.citytown) (JOIN (R organization.organization.headquarters) m.0k9wp))",
        "normed_sexpr": "( JOIN ( R [ location , mailing address , citytown ] ) ( JOIN ( R [ organization , organization , headquarters ] ) [ United States Air Force Academy ] ) )",
        "gold_entity_map": {
            "m.0k9wp": "United States Air Force Academy"
        },
        "gold_relation_map": {
            "organization.organization.headquarters": "organization , organization , headquarters",
            "location.mailing_address.citytown": "location , mailing address , citytown"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-113",
        "question": "what 's the national sport of puerto rico",
        "comp_type": null,
        "answer": [
            "m.02p6lm8",
            "m.03wcnxr",
            "m.047g442",
            "m.04h5_c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05r7t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05r7t ns:sports.sports_team_location.teams ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_location.teams) m.05r7t)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team location , teams ] ) [ Puerto Rico ] )",
        "gold_entity_map": {
            "m.05r7t": "Puerto Rico"
        },
        "gold_relation_map": {
            "sports.sports_team_location.teams": "sports , sports team location , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-115",
        "question": "what did shawnee smith play in",
        "comp_type": null,
        "answer": [
            "m.025sc21",
            "m.02pcq92",
            "m.02pscpb",
            "m.02vgy2",
            "m.02x6dqb",
            "m.03cjx8n",
            "m.03v6q4",
            "m.03ylv0s",
            "m.0435vm",
            "m.04j2rlx",
            "m.04ljylq",
            "m.04ycv_f",
            "m.05jwph",
            "m.05n543z",
            "m.05qbdb8",
            "m.06_v8dw",
            "m.08tl9t",
            "m.08zjv6",
            "m.09fc83",
            "m.09rfh9",
            "m.0cfw7m_",
            "m.0crrh0v",
            "m.0crrmht",
            "m.0dz6hl",
            "m.0fpklgd",
            "m.0fq7dv_",
            "m.0fsclx",
            "m.0g4ftm9",
            "m.0gm0_nm",
            "m.0gw_7xk",
            "m.0m0plj9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06t3nj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06t3nj ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.06t3nj))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Shawnee Smith ] ) )",
        "gold_entity_map": {
            "m.06t3nj": "Shawnee Smith"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-124",
        "question": "what movie did angelina jolie direct",
        "comp_type": null,
        "answer": [
            "m.011q46b6",
            "m.0gttw8n",
            "m.0ngxp8g",
            "m.0wjk75w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f4vbz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f4vbz ns:film.director.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.director.film) m.0f4vbz)",
        "normed_sexpr": "( JOIN ( R [ film , director , film ] ) [ Angelina Jolie ] )",
        "gold_entity_map": {
            "m.0f4vbz": "Angelina Jolie"
        },
        "gold_relation_map": {
            "film.director.film": "film , director , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-126",
        "question": "where to visit near bangkok",
        "comp_type": null,
        "answer": [
            "m.01c1gj",
            "m.01d1vz",
            "m.02816l2",
            "m.02jh89",
            "m.02pksll",
            "m.02vnrfw",
            "m.02wwf3f",
            "m.03300t",
            "m.03hlbr1",
            "m.03hp67d",
            "m.03nr91r",
            "m.03t0m6",
            "m.047sllp",
            "m.04q452",
            "m.05s69t",
            "m.06nynb",
            "m.07_w5j",
            "m.07cz23",
            "m.07dj1f",
            "m.07qb9k",
            "m.080c8kl",
            "m.09dnj5",
            "m.09qjqb",
            "m.09rxcz",
            "m.0fp635",
            "m.0h6w70",
            "m.0vb3kfz"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fn2g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fn2g ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0fn2g)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Bangkok ] )",
        "gold_entity_map": {
            "m.0fn2g": "Bangkok"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-128",
        "question": "what year did tut became king",
        "comp_type": null,
        "answer": [
            "-1332"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hcc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hcc ns:base.ancientegypt.pharaoh.reign ?y .\n?y ns:measurement_unit.time_interval.start ?x .\n}\n",
        "sexpr": "(JOIN (R measurement_unit.time_interval.start) (JOIN (R base.ancientegypt.pharaoh.reign) m.07hcc))",
        "normed_sexpr": "( JOIN ( R [ measurement unit , time interval , start ] ) ( JOIN ( R [ base , ancientegypt , pharaoh , reign ] ) [ Tutankhamun ] ) )",
        "gold_entity_map": {
            "m.07hcc": "Tutankhamun"
        },
        "gold_relation_map": {
            "measurement_unit.time_interval.start": "measurement unit , time interval , start",
            "base.ancientegypt.pharaoh.reign": "base , ancientegypt , pharaoh , reign"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-131",
        "question": "where do baltimore ravens play",
        "comp_type": null,
        "answer": [
            "m.01yq7r"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ct6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ct6 ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.01ct6)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Baltimore Ravens ] )",
        "gold_entity_map": {
            "m.01ct6": "Baltimore Ravens"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-135",
        "question": "what is the dominant language in israel",
        "comp_type": null,
        "answer": [
            "m.03hkp",
            "m.0jzc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03spz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03spz ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.03spz)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Israel ] )",
        "gold_entity_map": {
            "m.03spz": "Israel"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-136",
        "question": "what are the main languages of nigeria",
        "comp_type": null,
        "answer": [
            "m.02h40lc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05cgv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05cgv ns:location.country.official_language ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.official_language) m.05cgv)",
        "normed_sexpr": "( JOIN ( R [ location , country , official language ] ) [ Nigeria ] )",
        "gold_entity_map": {
            "m.05cgv": "Nigeria"
        },
        "gold_relation_map": {
            "location.country.official_language": "location , country , official language"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-137",
        "question": "what jobs did ben franklin do",
        "comp_type": null,
        "answer": [
            "m.016fc2",
            "m.01l5t6",
            "m.02kv97_",
            "m.03sbb",
            "m.05r6c",
            "m.05svgpc",
            "m.06q2q",
            "m.080ntlp",
            "m.09jwl",
            "m.0cbd2",
            "m.0fj9f",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019fz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019fz ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.019fz)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Benjamin Franklin ] )",
        "gold_entity_map": {
            "m.019fz": "Benjamin Franklin"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-138",
        "question": "what bible does the catholic church follow",
        "comp_type": null,
        "answer": [
            "m.015j7",
            "m.01dfl",
            "m.05crg",
            "m.05ld9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c8wxp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c8wxp ns:religion.religion.texts ?x .\n}\n",
        "sexpr": "(JOIN (R religion.religion.texts) m.0c8wxp)",
        "normed_sexpr": "( JOIN ( R [ religion , religion , texts ] ) [ Catholicism ] )",
        "gold_entity_map": {
            "m.0c8wxp": "Catholicism"
        },
        "gold_relation_map": {
            "religion.religion.texts": "religion , religion , texts"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-143",
        "question": "what did nick clegg study at university",
        "comp_type": null,
        "answer": [
            "m.05r79",
            "m.074n0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036547)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036547 ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.major_field_of_study) (JOIN (R people.person.education) m.036547))",
        "normed_sexpr": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Nick Clegg ] ) )",
        "gold_entity_map": {
            "m.036547": "Nick Clegg"
        },
        "gold_relation_map": {
            "people.person.education": "people , person , education",
            "education.education.major_field_of_study": "education , education , major field of study"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-145",
        "question": "what school did cassie bernall go to",
        "comp_type": null,
        "answer": [
            "m.021djq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0219mf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0219mf ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.0219mf))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Cassie Bernall ] ) )",
        "gold_entity_map": {
            "m.0219mf": "Cassie Bernall"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-146",
        "question": "what movie did james frey write",
        "comp_type": null,
        "answer": [
            "m.05nm_9c",
            "m.08vh65"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06w054)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06w054 ns:film.writer.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.writer.film) m.06w054)",
        "normed_sexpr": "( JOIN ( R [ film , writer , film ] ) [ James Frey ] )",
        "gold_entity_map": {
            "m.06w054": "James Frey"
        },
        "gold_relation_map": {
            "film.writer.film": "film , writer , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-148",
        "question": "what did st. matthew do",
        "comp_type": null,
        "answer": [
            "m.038v8",
            "m.0b77943"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0565x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0565x ns:book.author.works_written ?x .\n}\n",
        "sexpr": "(JOIN (R book.author.works_written) m.0565x)",
        "normed_sexpr": "( JOIN ( R [ book , author , works written ] ) [ Matthew the Apostle ] )",
        "gold_entity_map": {
            "m.0565x": "Matthew the Apostle"
        },
        "gold_relation_map": {
            "book.author.works_written": "book , author , works written"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-150",
        "question": "what was nelson mandela 's religion",
        "comp_type": null,
        "answer": [
            "m.051kv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g7q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g7q ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.05g7q)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Nelson Mandela ] )",
        "gold_entity_map": {
            "m.05g7q": "Nelson Mandela"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-152",
        "question": "what is henry clay known for",
        "comp_type": null,
        "answer": [
            "m.016fc2",
            "m.04gc2",
            "m.0fj9f"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ct18)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ct18 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0ct18)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Henry Clay ] )",
        "gold_entity_map": {
            "m.0ct18": "Henry Clay"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-160",
        "question": "who was the apostle paul considered to be",
        "comp_type": null,
        "answer": [
            "m.042gzwd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060nc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060nc ns:fictional_universe.person_in_fiction.representations_in_fiction ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.person_in_fiction.representations_in_fiction) m.060nc)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , person in fiction , representations in fiction ] ) [ Paul the Apostle ] )",
        "gold_entity_map": {
            "m.060nc": "Paul the Apostle"
        },
        "gold_relation_map": {
            "fictional_universe.person_in_fiction.representations_in_fiction": "fictional universe , person in fiction , representations in fiction"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-161",
        "question": "what currency does ontario canada use",
        "comp_type": null,
        "answer": [
            "m.0ptk_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d060g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d060g ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.0d060g)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Canada ] )",
        "gold_entity_map": {
            "m.0d060g": "Canada"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-166",
        "question": "where did the casey anthony case take place",
        "comp_type": null,
        "answer": [
            "m.0ply0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04gtx2_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04gtx2_ ns:time.event.locations ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.locations) m.04gtx2_)",
        "normed_sexpr": "( JOIN ( R [ time , event , locations ] ) [ Death of Caylee Anthony ] )",
        "gold_entity_map": {
            "m.04gtx2_": "Death of Caylee Anthony"
        },
        "gold_relation_map": {
            "time.event.locations": "time , event , locations"
        },
        "gold_type_map": {}
    }
]