[
    {
        "ID": "WebQTrn-2522",
        "question": "what is the capital city of assyrian empire",
        "comp_type": null,
        "answer": [
            "m.02wkmf",
            "m.05fym"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wmn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wmn ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.0wmn)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Assyria ] )",
        "gold_entity_map": {
            "m.0wmn": "Assyria"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2524",
        "question": "what disease michael jackson",
        "comp_type": null,
        "answer": [
            "m.026k8yn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09889g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09889g ns:medicine.notable_person_with_medical_condition.condition ?x .\n}\n",
        "sexpr": "(JOIN (R medicine.notable_person_with_medical_condition.condition) m.09889g)",
        "normed_sexpr": "( JOIN ( R [ medicine , notable person with medical condition , condition ] ) [ Michael Jackson ] )",
        "gold_entity_map": {
            "m.09889g": "Michael Jackson"
        },
        "gold_relation_map": {
            "medicine.notable_person_with_medical_condition.condition": "medicine , notable person with medical condition , condition"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2526",
        "question": "what is the zip code for cordova tn",
        "comp_type": null,
        "answer": [
            "m.03dxntr",
            "m.07nq_8m",
            "m.07nq_c7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07j5_n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07j5_n ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.07j5_n)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Cordova ] )",
        "gold_entity_map": {
            "m.07j5_n": "Cordova"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2528",
        "question": "what is the origin of the turkish language",
        "comp_type": null,
        "answer": [
            "m.07d1d",
            "m.0k0w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02hwyss)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02hwyss ns:language.human_language.language_family ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.language_family) m.02hwyss)",
        "normed_sexpr": "( JOIN ( R [ language , human language , language family ] ) [ Turkish Language ] )",
        "gold_entity_map": {
            "m.02hwyss": "Turkish Language"
        },
        "gold_relation_map": {
            "language.human_language.language_family": "language , human language , language family"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2536",
        "question": "what did ron howard direct",
        "comp_type": null,
        "answer": [
            "m.02mh4b",
            "m.02yf34",
            "m.09m6kg",
            "m.0crrc8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g2lq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g2lq ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n?x ns:film.film.directed_by ns:m.0g2lq .\n}\n",
        "sexpr": "(AND (JOIN film.film.directed_by m.0g2lq) (JOIN (R film.performance.film) (JOIN (R film.actor.film) m.0g2lq)))",
        "normed_sexpr": "( AND ( JOIN [ film , film , directed by ] [ Ron Howard ] ) ( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Ron Howard ] ) ) )",
        "gold_entity_map": {
            "m.0g2lq": "Ron Howard"
        },
        "gold_relation_map": {
            "film.film.directed_by": "film , film , directed by",
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2538",
        "question": "who are shakespeare 's siblings",
        "comp_type": null,
        "answer": [
            "m.02_56lv",
            "m.047d343",
            "m.04zwpml",
            "m.0fq0_1t",
            "m.0jvqm_l",
            "m.0jvqnz8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.081k8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.081k8 ns:people.person.sibling_s ?y .\n?y ns:people.sibling_relationship.sibling ?x .\n}\n",
        "sexpr": "(JOIN (R people.sibling_relationship.sibling) (JOIN (R people.person.sibling_s) m.081k8))",
        "normed_sexpr": "( JOIN ( R [ people , sibling relationship , sibling ] ) ( JOIN ( R [ people , person , sibling s ] ) [ William Shakespeare ] ) )",
        "gold_entity_map": {
            "m.081k8": "William Shakespeare"
        },
        "gold_relation_map": {
            "people.sibling_relationship.sibling": "people , sibling relationship , sibling",
            "people.person.sibling_s": "people , person , sibling s"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2539",
        "question": "what team did albert pujols play for",
        "comp_type": null,
        "answer": [
            "m.04wmvz",
            "m.06x68",
            "m.0f3wm2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.035gcb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.035gcb ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.035gcb))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Albert Pujols ] ) )",
        "gold_entity_map": {
            "m.035gcb": "Albert Pujols"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2540",
        "question": "what inspired monet",
        "comp_type": null,
        "answer": [
            "m.016s03",
            "m.01dqt1",
            "m.0233w",
            "m.03fw00",
            "m.06466",
            "m.074ck",
            "m.0kzxl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xnj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xnj ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.01xnj)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Claude Monet ] )",
        "gold_entity_map": {
            "m.01xnj": "Claude Monet"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2544",
        "question": "what are fun things to do in seattle wa",
        "comp_type": null,
        "answer": [
            "m.01k7v7",
            "m.01r0v3",
            "m.02dxmq",
            "m.02k953",
            "m.02kl80",
            "m.02ks_p",
            "m.02rp3lq",
            "m.02xg6w",
            "m.03325p",
            "m.0332cl",
            "m.0332j6",
            "m.035pqt",
            "m.03t00j",
            "m.04n53vb",
            "m.0k2k2n2",
            "m.0prqs",
            "m.0pxmn",
            "m.0y657tp"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d9jr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d9jr ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0d9jr)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Seattle ] )",
        "gold_entity_map": {
            "m.0d9jr": "Seattle"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2545",
        "question": "where does the oklahoma city thunder practice",
        "comp_type": null,
        "answer": [
            "m.05p8g6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04cxw5b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04cxw5b ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.04cxw5b)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Oklahoma City Thunder ] )",
        "gold_entity_map": {
            "m.04cxw5b": "Oklahoma City Thunder"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2547",
        "question": "who was theodore roosevelt 's vice president",
        "comp_type": null,
        "answer": [
            "m.0myr7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07hyk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07hyk ns:government.us_president.vice_president ?x .\n}\n",
        "sexpr": "(JOIN (R government.us_president.vice_president) m.07hyk)",
        "normed_sexpr": "( JOIN ( R [ government , us president , vice president ] ) [ Theodore Roosevelt ] )",
        "gold_entity_map": {
            "m.07hyk": "Theodore Roosevelt"
        },
        "gold_relation_map": {
            "government.us_president.vice_president": "government , us president , vice president"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2550",
        "question": "what nationality is jermaine paul",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02rxpxn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02rxpxn ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.02rxpxn)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Jermaine Paul ] )",
        "gold_entity_map": {
            "m.02rxpxn": "Jermaine Paul"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2553",
        "question": "who were mary shelley 's parents",
        "comp_type": null,
        "answer": [
            "m.011zsy",
            "m.04_cw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_by)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_by ns:people.person.parents ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.parents) m.04_by)",
        "normed_sexpr": "( JOIN ( R [ people , person , parents ] ) [ Mary Shelley ] )",
        "gold_entity_map": {
            "m.04_by": "Mary Shelley"
        },
        "gold_relation_map": {
            "people.person.parents": "people , person , parents"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2557",
        "question": "what is the capital city of south carolina",
        "comp_type": null,
        "answer": [
            "m.0fv_t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06yxd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06yxd ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.capital) m.06yxd)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ South Carolina ] )",
        "gold_entity_map": {
            "m.06yxd": "South Carolina"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.capital": "base , aareas , schema , administrative area , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2561",
        "question": "what are some of the awards taylor swift has won",
        "comp_type": null,
        "answer": [
            "m.0_vmfsz",
            "m.011lffxx",
            "m.01by1l",
            "m.01c9f2",
            "m.01dk00",
            "m.025m8l",
            "m.026m9w",
            "m.02f6ym",
            "m.04dxjjz",
            "m.04dy0sf",
            "m.04fnq6m",
            "m.04fnq79",
            "m.05kfv8x",
            "m.05kfvnc",
            "m.05kfvsx",
            "m.07_506c",
            "m.07_52dv",
            "m.08clnvk",
            "m.09qd02_",
            "m.0cjw69",
            "m.0ckh35",
            "m.0ckh7c",
            "m.0f4w04",
            "m.0gj6x00",
            "m.0gky9c6",
            "m.0hj9kq4",
            "m.0j8y__n",
            "m.0j8ythh",
            "m.0j8yxq6",
            "m.0j8z2r3",
            "m.0j8zcw2",
            "m.0j912gy",
            "m.0k0811w",
            "m.0k081n1",
            "m.0k081qv",
            "m.0n57zzs",
            "m.0n9z4f7",
            "m.0nh4rr_",
            "m.0sgkrty",
            "m.0sgkvz4",
            "m.0whp1hc",
            "m.0whp2_z",
            "m.0whp5hq",
            "m.0whp9zh",
            "m.0wzyn4z",
            "m.0y4ppv1",
            "m.0y4r26d",
            "m.0y554rz",
            "m.0y87xxx",
            "m.0yqdf3d",
            "m.0yszmsf",
            "m.0yszn3z",
            "m.0yt47m8",
            "m.0yt7tc6",
            "m.0ytbnfc",
            "m.0yvqhv_",
            "m.0zmx3ly"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl567)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl567 ns:award.award_winner.awards_won ?y .\n?y ns:award.award_honor.award ?x .\n}\n",
        "sexpr": "(JOIN (R award.award_honor.award) (JOIN (R award.award_winner.awards_won) m.0dl567))",
        "normed_sexpr": "( JOIN ( R [ award , award honor , award ] ) ( JOIN ( R [ award , award winner , awards won ] ) [ Taylor Swift ] ) )",
        "gold_entity_map": {
            "m.0dl567": "Taylor Swift"
        },
        "gold_relation_map": {
            "award.award_honor.award": "award , award honor , award",
            "award.award_winner.awards_won": "award , award winner , awards won"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2563",
        "question": "where did chris cuomo go",
        "comp_type": null,
        "answer": [
            "m.027kp3",
            "m.037sbn",
            "m.08qs09"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02pjpd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02pjpd ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.02pjpd))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Andrew Cuomo ] ) )",
        "gold_entity_map": {
            "m.02pjpd": "Andrew Cuomo"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2564",
        "question": "where did gary coleman live when he died",
        "comp_type": null,
        "answer": [
            "m.0l39b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.036pg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.036pg ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.036pg)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Gary Coleman ] )",
        "gold_entity_map": {
            "m.036pg": "Gary Coleman"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2567",
        "question": "where was ronald reagan born and raised",
        "comp_type": null,
        "answer": [
            "m.0sj7b"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c0j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c0j ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.06c0j)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Ronald Reagan ] )",
        "gold_entity_map": {
            "m.06c0j": "Ronald Reagan"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2568",
        "question": "what county is morristown tn in",
        "comp_type": null,
        "answer": [
            "m.0n5c9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0xr0t)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0xr0t ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0xr0t)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Morristown ] )",
        "gold_entity_map": {
            "m.0xr0t": "Morristown"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2569",
        "question": "where do the houston rockets play basketball",
        "comp_type": null,
        "answer": [
            "m.01tx3t",
            "m.01txlf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmfb ns:sports.sports_team.arena_stadium ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.arena_stadium) m.0jmfb)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , arena stadium ] ) [ Houston Rockets ] )",
        "gold_entity_map": {
            "m.0jmfb": "Houston Rockets"
        },
        "gold_relation_map": {
            "sports.sports_team.arena_stadium": "sports , sports team , arena stadium"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2576",
        "question": "what continent do the falkland islands belong to",
        "comp_type": null,
        "answer": [
            "m.06n3y",
            "m.07c5l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wmy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wmy ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01mh .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mh) (JOIN (R location.location.containedby) m.02wmy))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Continent ] ) ( JOIN ( R [ location , location , containedby ] ) [ Falkland Islands ] ) )",
        "gold_entity_map": {
            "m.02wmy": "Falkland Islands",
            "m.01mh": "Continent"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01mh": "Continent"
        }
    },
    {
        "ID": "WebQTrn-2579",
        "question": "what did alvin smith died from",
        "comp_type": null,
        "answer": [
            "m.0dh11"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0261tkp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0261tkp ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0261tkp)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Alvin Smith ] )",
        "gold_entity_map": {
            "m.0261tkp": "Alvin Smith"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2580",
        "question": "what are the four harry potter house names",
        "comp_type": null,
        "answer": [
            "m.02vhpv1",
            "m.02vhpvc",
            "m.02vhpvl",
            "m.02vhpw2"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nns:m.0cb3n ns:fictional_universe.fictional_organization.sub_organization_in_fiction ?x .\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {},
        "gold_relation_map": {
            "fictional_universe.fictional_organization.sub_organization_in_fiction": "fictional universe , fictional organization , sub organization in fiction"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2581",
        "question": "who has tim howard played for",
        "comp_type": null,
        "answer": [
            "m.02s9vc",
            "m.04q30l",
            "m.050fh",
            "m.0bxjpy",
            "m.0mmd6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.026s3n)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.026s3n ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.026s3n))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Tim Howard ] ) )",
        "gold_entity_map": {
            "m.026s3n": "Tim Howard"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2582",
        "question": "when is the gold cup cheltenham",
        "comp_type": null,
        "answer": [
            "2012-03-16"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT  ?x \nWHERE {\n  ns:m.03krjv ns:time.recurring_event.instances ?y . # Cheltenham Gold Cup\n  ?y ns:time.event.start_date ?x . \n}\nORDER BY DESC(?x)\nLIMIT 1",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.03krjv": "Cheltenham Gold Cup"
        },
        "gold_relation_map": {
            "time.recurring_event.instances": "time , recurring event , instances",
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2586",
        "question": "what region of the world is north america in",
        "comp_type": null,
        "answer": [
            "m.05k3k",
            "m.07c5l",
            "m.0jntd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.059g4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.059g4 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.059g4)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ North America ] )",
        "gold_entity_map": {
            "m.059g4": "North America"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2588",
        "question": "where do navajo indians live",
        "comp_type": null,
        "answer": [
            "m.0162sr",
            "m.018hq1",
            "m.01n7q",
            "m.05fjy",
            "m.07srw",
            "m.0vmt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08k5jg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08k5jg ns:people.ethnicity.geographic_distribution ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.geographic_distribution) m.08k5jg)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , geographic distribution ] ) [ Navajo people ] )",
        "gold_entity_map": {
            "m.08k5jg": "Navajo people"
        },
        "gold_relation_map": {
            "people.ethnicity.geographic_distribution": "people , ethnicity , geographic distribution"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2590",
        "question": "what instrument does ringo starr play",
        "comp_type": null,
        "answer": [
            "m.013y1f",
            "m.01wy6",
            "m.026t6",
            "m.02fsn",
            "m.02hnl",
            "m.0342h",
            "m.03qjg",
            "m.04rzd",
            "m.05148p4",
            "m.05r5c",
            "m.06ncr",
            "m.07m2y",
            "m.0l14j_",
            "m.0l14md"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vrnsk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vrnsk ns:music.group_member.instruments_played ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_member.instruments_played) m.01vrnsk)",
        "normed_sexpr": "( JOIN ( R [ music , group member , instruments played ] ) [ Ringo Starr ] )",
        "gold_entity_map": {
            "m.01vrnsk": "Ringo Starr"
        },
        "gold_relation_map": {
            "music.group_member.instruments_played": "music , group member , instruments played"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2596",
        "question": "what happened to president james garfield",
        "comp_type": null,
        "answer": [
            "m.014w_8",
            "m.0dq9p",
            "m.0gk4g"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0b22w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0b22w ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0b22w)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ James A. Garfield ] )",
        "gold_entity_map": {
            "m.0b22w": "James A. Garfield"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2597",
        "question": "what time zone am i in missouri",
        "comp_type": null,
        "answer": [
            "m.02fqwt"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04ych)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04ych ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.04ych)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ Missouri ] )",
        "gold_entity_map": {
            "m.04ych": "Missouri"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2601",
        "question": "who did warren moon play for",
        "comp_type": null,
        "answer": [
            "m.0487_",
            "m.04nmxtk",
            "m.051q5",
            "m.070xg",
            "m.0fgg8c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01b0dl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01b0dl ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.01b0dl))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Warren Moon ] ) )",
        "gold_entity_map": {
            "m.01b0dl": "Warren Moon"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    }
]