[
    {
        "ID": "WebQTrn-2213",
        "question": "who did john paul jones fight for",
        "comp_type": null,
        "answer": [
            "m.021xtf",
            "m.0268nz",
            "m.065y1n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045bz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045bz ns:military.military_person.service ?y .\n?y ns:military.military_service.military_force ?x .\n}\n",
        "sexpr": "(JOIN (R military.military_service.military_force) (JOIN (R military.military_person.service) m.045bz))",
        "normed_sexpr": "( JOIN ( R [ military , military service , military force ] ) ( JOIN ( R [ military , military person , service ] ) [ John Paul Jones ] ) )",
        "gold_entity_map": {
            "m.045bz": "John Paul Jones"
        },
        "gold_relation_map": {
            "military.military_service.military_force": "military , military service , military force",
            "military.military_person.service": "military , military person , service"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2214",
        "question": "where does hudson river start",
        "comp_type": null,
        "answer": [
            "m.07663d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cvyp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cvyp ns:geography.river.origin ?x .\n}\n",
        "sexpr": "(JOIN (R geography.river.origin) m.0cvyp)",
        "normed_sexpr": "( JOIN ( R [ geography , river , origin ] ) [ Hudson River ] )",
        "gold_entity_map": {
            "m.0cvyp": "Hudson River"
        },
        "gold_relation_map": {
            "geography.river.origin": "geography , river , origin"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2215",
        "question": "where was brad paisley born and raised",
        "comp_type": null,
        "answer": [
            "m.010xmb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gr7w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gr7w ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.03gr7w)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Brad Paisley ] )",
        "gold_entity_map": {
            "m.03gr7w": "Brad Paisley"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2216",
        "question": "what is charlotte north carolina known for",
        "comp_type": null,
        "answer": [
            "m.02vnhrq",
            "m.03d5y3g",
            "m.03g_2kj",
            "m.04td00",
            "m.05g_v0l",
            "m.0635_7",
            "m.09k6h_2",
            "m.0c2m75",
            "m.0cq5c0",
            "m.0fxjdx",
            "m.0g0c28",
            "m.0gjc5k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fsb8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fsb8 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0fsb8)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Charlotte ] )",
        "gold_entity_map": {
            "m.0fsb8": "Charlotte"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2217",
        "question": "where is glastonbury connecticut",
        "comp_type": null,
        "answer": [
            "m.01x73",
            "m.09c7w0",
            "m.0m2gk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rdgt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rdgt ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0rdgt)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Glastonbury ] )",
        "gold_entity_map": {
            "m.0rdgt": "Glastonbury"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2218",
        "question": "what is george washington 's hometown",
        "comp_type": null,
        "answer": [
            "m.0mmyl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034rd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034rd ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.034rd)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ George Washington ] )",
        "gold_entity_map": {
            "m.034rd": "George Washington"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2219",
        "question": "what is arlington texas zip code",
        "comp_type": null,
        "answer": [
            "m.020yf_6",
            "m.020yfv7",
            "m.020yfw2",
            "m.020yfx2",
            "m.020yg3f",
            "m.020yg4f",
            "m.020yg58",
            "m.020yg73",
            "m.020ygcw",
            "m.020yhh7",
            "m.021df5f",
            "m.03dxw18",
            "m.03dxw1p",
            "m.07nqdlq",
            "m.07nqdm4",
            "m.07nqdmt",
            "m.07nqdn0",
            "m.07nqdn7",
            "m.07nqdng",
            "m.07nqdnp",
            "m.09sh2kb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0nqph)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0nqph ns:location.citytown.postal_codes ?x .\n}\n",
        "sexpr": "(JOIN (R location.citytown.postal_codes) m.0nqph)",
        "normed_sexpr": "( JOIN ( R [ location , citytown , postal codes ] ) [ Arlington ] )",
        "gold_entity_map": {
            "m.0nqph": "Arlington"
        },
        "gold_relation_map": {
            "location.citytown.postal_codes": "location , citytown , postal codes"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2227",
        "question": "what instruments does katy perry play",
        "comp_type": null,
        "answer": [
            "m.0290ngj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03y82t6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03y82t6 ns:music.artist.track_contributions ?y .\n?y ns:music.track_contribution.role ?x .\n}\n",
        "sexpr": "(JOIN (R music.track_contribution.role) (JOIN (R music.artist.track_contributions) m.03y82t6))",
        "normed_sexpr": "( JOIN ( R [ music , track contribution , role ] ) ( JOIN ( R [ music , artist , track contributions ] ) [ Katy Perry ] ) )",
        "gold_entity_map": {
            "m.03y82t6": "Katy Perry"
        },
        "gold_relation_map": {
            "music.track_contribution.role": "music , track contribution , role",
            "music.artist.track_contributions": "music , artist , track contributions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2234",
        "question": "who played mickey on days of our lives",
        "comp_type": null,
        "answer": [
            "m.0345r9",
            "m.044xpb",
            "m.04mm_3"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f778b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f778b ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.0f778b))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Mickey Horton ] ) )",
        "gold_entity_map": {
            "m.0f778b": "Mickey Horton"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2235",
        "question": "what movies does nicole kidman star in",
        "comp_type": null,
        "answer": [
            "m.011yxg",
            "m.012hf4j4",
            "m.012stndr",
            "m.01hr1",
            "m.01pvl7",
            "m.02_nsc",
            "m.023g6w",
            "m.026hh0m",
            "m.026qnh6",
            "m.0279yx9",
            "m.029xhb",
            "m.02cbhg",
            "m.02qcr",
            "m.02rzvmr",
            "m.032z3r",
            "m.033pck",
            "m.034bm_",
            "m.034qbx",
            "m.034scm",
            "m.03lvwp",
            "m.03ntbmw",
            "m.03tsys",
            "m.03y062v",
            "m.046dr3",
            "m.0479x3x",
            "m.04dsq7v",
            "m.04dsq98",
            "m.04dsqb0",
            "m.04dsqd4",
            "m.04dsqdp",
            "m.04dsqpq",
            "m.04j2wxr",
            "m.04jplwp",
            "m.04nnpw",
            "m.04w4_f",
            "m.04w7rn",
            "m.05650n",
            "m.05fm6m",
            "m.05k2xy",
            "m.06wmkz",
            "m.07626w",
            "m.07jd8j",
            "m.07sc1vd",
            "m.08v5s3f",
            "m.095zlp",
            "m.09gcrsw",
            "m.09qh12",
            "m.0bshwmp",
            "m.0cc703f",
            "m.0cc8620",
            "m.0cnxqm5",
            "m.0crs9nr",
            "m.0cy6r9",
            "m.0dd8wdq",
            "m.0ds27b",
            "m.0gkr31c",
            "m.0gx938d",
            "m.0gx9hr9",
            "m.0gx9j_c",
            "m.0jl14xf",
            "m.0m9tw",
            "m.0n5wg2n",
            "m.0ngns90",
            "m.0wy31xz",
            "m.0x0jk5v",
            "m.0zbdddm",
            "m.0zcpz3h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05dbf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05dbf ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.05dbf))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Nicole Kidman ] ) )",
        "gold_entity_map": {
            "m.05dbf": "Nicole Kidman"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2239",
        "question": "where did kate chopin grow up",
        "comp_type": null,
        "answer": [
            "m.06wxw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d8pw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d8pw ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0d8pw)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Kate Chopin ] )",
        "gold_entity_map": {
            "m.0d8pw": "Kate Chopin"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2243",
        "question": "what is the newspaper in phoenix",
        "comp_type": null,
        "answer": [
            "m.03cgzvj",
            "m.041jxp",
            "m.09kqp8",
            "m.0bmwns"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d35y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d35y ns:periodicals.newspaper_circulation_area.newspapers ?x .\n}\n",
        "sexpr": "(JOIN (R periodicals.newspaper_circulation_area.newspapers) m.0d35y)",
        "normed_sexpr": "( JOIN ( R [ periodicals , newspaper circulation area , newspapers ] ) [ Phoenix ] )",
        "gold_entity_map": {
            "m.0d35y": "Phoenix"
        },
        "gold_relation_map": {
            "periodicals.newspaper_circulation_area.newspapers": "periodicals , newspaper circulation area , newspapers"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2244",
        "question": "where is luke bryan from",
        "comp_type": null,
        "answer": [
            "m.0rxrq"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02vpng6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02vpng6 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02vpng6)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Luke Bryan ] )",
        "gold_entity_map": {
            "m.02vpng6": "Luke Bryan"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2249",
        "question": "where did captain james cook grow up",
        "comp_type": null,
        "answer": [
            "m.045_cx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_j8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_j8 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.03_j8)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ James Cook ] )",
        "gold_entity_map": {
            "m.03_j8": "James Cook"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2253",
        "question": "where is alex rodriguez from",
        "comp_type": null,
        "answer": [
            "m.018z6h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f492)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f492 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.01f492)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Alex Rodriguez ] )",
        "gold_entity_map": {
            "m.01f492": "Alex Rodriguez"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2255",
        "question": "who invented morse code",
        "comp_type": null,
        "answer": [
            "m.06q6n"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sb4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sb4 ns:law.invention.inventor ?x .\n}\n",
        "sexpr": "(JOIN (R law.invention.inventor) m.04sb4)",
        "normed_sexpr": "( JOIN ( R [ law , invention , inventor ] ) [ Morse code ] )",
        "gold_entity_map": {
            "m.04sb4": "Morse code"
        },
        "gold_relation_map": {
            "law.invention.inventor": "law , invention , inventor"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2257",
        "question": "what is the political system in england",
        "comp_type": null,
        "answer": [
            "m.01q20",
            "m.07mq4k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02jx1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02jx1 ns:location.country.form_of_government ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.form_of_government) m.02jx1)",
        "normed_sexpr": "( JOIN ( R [ location , country , form of government ] ) [ England ] )",
        "gold_entity_map": {
            "m.02jx1": "England"
        },
        "gold_relation_map": {
            "location.country.form_of_government": "location , country , form of government"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2259",
        "question": "what does rupert murdoch own 2012",
        "comp_type": null,
        "answer": [
            "m.02z_b",
            "m.03p1p8r",
            "m.04w2dc",
            "m.05bgd7",
            "m.08v17y",
            "m.0cjdk",
            "m.0gjb3y5",
            "m.0n_hqj6",
            "m.0sxdg",
            "m.0vsck0t"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06hrk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06hrk ns:organization.organization_founder.organizations_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization_founder.organizations_founded) m.06hrk)",
        "normed_sexpr": "( JOIN ( R [ organization , organization founder , organizations founded ] ) [ Rupert Murdoch ] )",
        "gold_entity_map": {
            "m.06hrk": "Rupert Murdoch"
        },
        "gold_relation_map": {
            "organization.organization_founder.organizations_founded": "organization , organization founder , organizations founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2263",
        "question": "what did sammy davis jr die of",
        "comp_type": null,
        "answer": [
            "m.021plp",
            "m.054rzc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01bmlb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01bmlb ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.01bmlb)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Sammy Davis, Jr. ] )",
        "gold_entity_map": {
            "m.01bmlb": "Sammy Davis, Jr."
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2264",
        "question": "what did anna nicole smith died from",
        "comp_type": null,
        "answer": [
            "m.01tf_6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0hwfl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0hwfl ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.0hwfl)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Anna Nicole Smith ] )",
        "gold_entity_map": {
            "m.0hwfl": "Anna Nicole Smith"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2267",
        "question": "what year did dwayne wade came to the nba",
        "comp_type": null,
        "answer": [
            "m.038c0q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03l295)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03l295 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.03l295))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Dwyane Wade ] ) )",
        "gold_entity_map": {
            "m.03l295": "Dwyane Wade"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2271",
        "question": "what religion does tom cruise follow",
        "comp_type": null,
        "answer": [
            "m.06nzl"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07r1h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07r1h ns:base.popstra.celebrity.religion ?y .\n?y ns:base.popstra.religion_choice.religion ?x .\n}\n",
        "sexpr": "(JOIN (R base.popstra.religion_choice.religion) (JOIN (R base.popstra.celebrity.religion) m.07r1h))",
        "normed_sexpr": "( JOIN ( R [ base , popstra , religion choice , religion ] ) ( JOIN ( R [ base , popstra , celebrity , religion ] ) [ Tom Cruise ] ) )",
        "gold_entity_map": {
            "m.07r1h": "Tom Cruise"
        },
        "gold_relation_map": {
            "base.popstra.religion_choice.religion": "base , popstra , religion choice , religion",
            "base.popstra.celebrity.religion": "base , popstra , celebrity , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2273",
        "question": "what language do lakota indians speak",
        "comp_type": null,
        "answer": [
            "m.02h40lc",
            "m.02k899"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0fk39)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0fk39 ns:people.ethnicity.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R people.ethnicity.languages_spoken) m.0fk39)",
        "normed_sexpr": "( JOIN ( R [ people , ethnicity , languages spoken ] ) [ Lakota people ] )",
        "gold_entity_map": {
            "m.0fk39": "Lakota people"
        },
        "gold_relation_map": {
            "people.ethnicity.languages_spoken": "people , ethnicity , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2277",
        "question": "what money is used in the ukraine",
        "comp_type": null,
        "answer": [
            "m.035qkb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07t21)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07t21 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.07t21)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Ukraine ] )",
        "gold_entity_map": {
            "m.07t21": "Ukraine"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2278",
        "question": "where did ayn rand live",
        "comp_type": null,
        "answer": [
            "m.06pr6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0h25)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0h25 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0h25))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Ayn Rand ] ) )",
        "gold_entity_map": {
            "m.0h25": "Ayn Rand"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2279",
        "question": "when was the civil war in libya",
        "comp_type": null,
        "answer": [
            "2011-02-15"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gfhg1y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gfhg1y ns:time.event.start_date ?x .\n}\n",
        "sexpr": "(JOIN (R time.event.start_date) m.0gfhg1y)",
        "normed_sexpr": "( JOIN ( R [ time , event , start date ] ) [ Libyan Civil War ] )",
        "gold_entity_map": {
            "m.0gfhg1y": "Libyan Civil War"
        },
        "gold_relation_map": {
            "time.event.start_date": "time , event , start date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2282",
        "question": "what influenced roy lichtenstein artwork",
        "comp_type": null,
        "answer": [
            "m.01sj_s",
            "m.04187y",
            "m.0gcjf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gcgd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gcgd ns:influence.influence_node.influenced_by ?x .\n}\n",
        "sexpr": "(JOIN (R influence.influence_node.influenced_by) m.0gcgd)",
        "normed_sexpr": "( JOIN ( R [ influence , influence node , influenced by ] ) [ Roy Lichtenstein ] )",
        "gold_entity_map": {
            "m.0gcgd": "Roy Lichtenstein"
        },
        "gold_relation_map": {
            "influence.influence_node.influenced_by": "influence , influence node , influenced by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2286",
        "question": "where is kentucky located",
        "comp_type": null,
        "answer": [
            "m.04_1l0v",
            "m.09c7w0",
            "m.0hzc9m5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0498y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0498y ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0498y)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Kentucky ] )",
        "gold_entity_map": {
            "m.0498y": "Kentucky"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2287",
        "question": "where john tyler was born",
        "comp_type": null,
        "answer": [
            "m.0mp6c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.042dk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.042dk ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.042dk)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ John Tyler ] )",
        "gold_entity_map": {
            "m.042dk": "John Tyler"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2289",
        "question": "what place did thomas jefferson died",
        "comp_type": null,
        "answer": [
            "m.0mp3l"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07cbs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07cbs ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.07cbs)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Thomas Jefferson ] )",
        "gold_entity_map": {
            "m.07cbs": "Thomas Jefferson"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2291",
        "question": "what is the time zone in france",
        "comp_type": null,
        "answer": [
            "m.02llzg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f8l9c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f8l9c ns:location.location.time_zones ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.time_zones) m.0f8l9c)",
        "normed_sexpr": "( JOIN ( R [ location , location , time zones ] ) [ France ] )",
        "gold_entity_map": {
            "m.0f8l9c": "France"
        },
        "gold_relation_map": {
            "location.location.time_zones": "location , location , time zones"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-2293",
        "question": "what county is lancaster ca located in",
        "comp_type": null,
        "answer": [
            "m.0kpys"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0r0jv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0r0jv ns:location.hud_county_place.county ?x .\n}\n",
        "sexpr": "(JOIN (R location.hud_county_place.county) m.0r0jv)",
        "normed_sexpr": "( JOIN ( R [ location , hud county place , county ] ) [ Lancaster ] )",
        "gold_entity_map": {
            "m.0r0jv": "Lancaster"
        },
        "gold_relation_map": {
            "location.hud_county_place.county": "location , hud county place , county"
        },
        "gold_type_map": {}
    }
]