[
    {
        "ID": "WebQTrn-1650",
        "question": "what airlines hub in phoenix",
        "comp_type": null,
        "answer": [
            "m.0syvm"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0d35y)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0d35y ns:location.location.nearby_airports ?x .\n?x ns:aviation.airport.focus_city_for ns:m.0gztl .\n}\n",
        "sexpr": "(AND (JOIN aviation.airport.focus_city_for m.0gztl) (JOIN (R location.location.nearby_airports) m.0d35y))",
        "normed_sexpr": "( AND ( JOIN [ aviation , airport , focus city for ] [ Southwest Airlines ] ) ( JOIN ( R [ location , location , nearby airports ] ) [ Phoenix ] ) )",
        "gold_entity_map": {
            "m.0gztl": "Southwest Airlines",
            "m.0d35y": "Phoenix"
        },
        "gold_relation_map": {
            "aviation.airport.focus_city_for": "aviation , airport , focus city for",
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1651",
        "question": "where did cutler jay go to college",
        "comp_type": null,
        "answer": [
            "m.01pq4w",
            "m.02q6v42"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.097hft)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.097hft ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.097hft))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Jay Cutler ] ) )",
        "gold_entity_map": {
            "m.097hft": "Jay Cutler"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1654",
        "question": "where is ann romney from",
        "comp_type": null,
        "answer": [
            "m.02dtg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02wvk7d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02wvk7d ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.02wvk7d)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Ann Romney ] )",
        "gold_entity_map": {
            "m.02wvk7d": "Ann Romney"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1656",
        "question": "what school did bill gates go to",
        "comp_type": null,
        "answer": [
            "m.01jv5g",
            "m.01mpwj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017nt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017nt ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.017nt))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ Bill Gates ] ) )",
        "gold_entity_map": {
            "m.017nt": "Bill Gates"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1658",
        "question": "what country does dubai come under",
        "comp_type": null,
        "answer": [
            "m.0j1z8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01f08r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01f08r ns:base.biblioness.bibs_location.country ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.country) m.01f08r)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Dubai ] )",
        "gold_entity_map": {
            "m.01f08r": "Dubai"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.country": "base , biblioness , bibs location , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1661",
        "question": "where does the panama canal run through",
        "comp_type": null,
        "answer": [
            "m.059g4",
            "m.05qx1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.066rl)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.066rl ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.066rl)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Panama Canal ] )",
        "gold_entity_map": {
            "m.066rl": "Panama Canal"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1662",
        "question": "what years did jackie robinson play baseball",
        "comp_type": null,
        "answer": [
            "m.02h7s7l",
            "m.02h7sfp",
            "m.041105l",
            "m.041108j",
            "m.041108x",
            "m.041109n",
            "m.04110b0",
            "m.04110f5",
            "m.04110y2",
            "m.04110yg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0443c)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0443c ns:baseball.baseball_player.batting_stats ?y .\n?y ns:baseball.batting_statistics.season ?x .\n}\n",
        "sexpr": "(JOIN (R baseball.batting_statistics.season) (JOIN (R baseball.baseball_player.batting_stats) m.0443c))",
        "normed_sexpr": "( JOIN ( R [ baseball , batting statistics , season ] ) ( JOIN ( R [ baseball , baseball player , batting stats ] ) [ Jackie Robinson ] ) )",
        "gold_entity_map": {
            "m.0443c": "Jackie Robinson"
        },
        "gold_relation_map": {
            "baseball.batting_statistics.season": "baseball , batting statistics , season",
            "baseball.baseball_player.batting_stats": "baseball , baseball player , batting stats"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1664",
        "question": "who all has steve nash played for",
        "comp_type": null,
        "answer": [
            "m.0jmcv",
            "m.0jmk7",
            "m.0jml5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01yqrk)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01yqrk ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.01yqrk))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Steve Nash ] ) )",
        "gold_entity_map": {
            "m.01yqrk": "Steve Nash"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1665",
        "question": "where does jason statham live",
        "comp_type": null,
        "answer": [
            "m.0ncb9",
            "m.0p98z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.034hyc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.034hyc ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.034hyc))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Jason Statham ] ) )",
        "gold_entity_map": {
            "m.034hyc": "Jason Statham"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1667",
        "question": "what language is cyprus using",
        "comp_type": null,
        "answer": [
            "m.012psb",
            "m.02h40lc",
            "m.02hwj5j",
            "m.02hwyss",
            "m.0349s",
            "m.04306rv",
            "m.064_8sq",
            "m.0xrg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01ppq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01ppq ns:location.country.languages_spoken ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.languages_spoken) m.01ppq)",
        "normed_sexpr": "( JOIN ( R [ location , country , languages spoken ] ) [ Cyprus ] )",
        "gold_entity_map": {
            "m.01ppq": "Cyprus"
        },
        "gold_relation_map": {
            "location.country.languages_spoken": "location , country , languages spoken"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1668",
        "question": "what to do in roatan bay",
        "comp_type": null,
        "answer": [
            "m.0j1h1lh",
            "m.0j1h1lq",
            "m.0jz3_57",
            "m.0jz31x5",
            "m.0jz325w"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djmd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djmd ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.03djmd)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Roatán ] )",
        "gold_entity_map": {
            "m.03djmd": "Roatán"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1670",
        "question": "what is the rainforest in peru called",
        "comp_type": null,
        "answer": [
            "m.0cx4p"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.016wzw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.016wzw ns:location.location.partially_contains ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01nt) (JOIN (R location.location.partially_contains) m.016wzw))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Region ] ) ( JOIN ( R [ location , location , partially contains ] ) [ Peru ] ) )",
        "gold_entity_map": {
            "m.01nt": "Region",
            "m.016wzw": "Peru"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.partially_contains": "location , location , partially contains"
        },
        "gold_type_map": {
            "m.01nt": "Region"
        }
    },
    {
        "ID": "WebQTrn-1671",
        "question": "where is mount jefferson located",
        "comp_type": null,
        "answer": [
            "m.027lsyc",
            "m.059g4",
            "m.05kj_",
            "m.09c7w0",
            "m.0k3nk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0238w8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0238w8 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0238w8)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Mount Jefferson ] )",
        "gold_entity_map": {
            "m.0238w8": "Mount Jefferson"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1675",
        "question": "which airport is closest to the city of chicago",
        "comp_type": null,
        "answer": [
            "m.01ky66",
            "m.01l1jx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:location.location.nearby_airports ?x .\n?x ns:location.location.containedby ns:m.01_d4 .\n}\n",
        "sexpr": "(AND (JOIN location.location.containedby m.01_d4) (JOIN (R location.location.nearby_airports) m.01_d4))",
        "normed_sexpr": "( AND ( JOIN [ location , location , containedby ] [ Chicago ] ) ( JOIN ( R [ location , location , nearby airports ] ) [ Chicago ] ) )",
        "gold_entity_map": {
            "m.01_d4": "Chicago"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby",
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1677",
        "question": "what movies did adam sandler play in",
        "comp_type": null,
        "answer": [
            "m.010fch95",
            "m.010rdrd1",
            "m.02m7tn",
            "m.02ph9tm",
            "m.02qdrjx",
            "m.02ql1gl",
            "m.03why2r",
            "m.0408m53",
            "m.0640m69",
            "m.074w86",
            "m.07kb7vh",
            "m.07x6zk",
            "m.07zsmk",
            "m.087pfc",
            "m.0b6f8pf",
            "m.0bshwmp",
            "m.0ch3qr1",
            "m.0f2sx4",
            "m.0gwgn1k",
            "m.0mzt5cs",
            "m.0v_ckgv",
            "m.0w26rky"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pz91)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pz91 ns:film.producer.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.producer.film) m.0pz91)",
        "normed_sexpr": "( JOIN ( R [ film , producer , film ] ) [ Adam Sandler ] )",
        "gold_entity_map": {
            "m.0pz91": "Adam Sandler"
        },
        "gold_relation_map": {
            "film.producer.film": "film , producer , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1679",
        "question": "where is washington d.c. at",
        "comp_type": null,
        "answer": [
            "m.018v5k",
            "m.03ph5j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0rh6k)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0rh6k ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01nt) (JOIN (R location.location.containedby) m.0rh6k))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Region ] ) ( JOIN ( R [ location , location , containedby ] ) [ Washington, D.C. ] ) )",
        "gold_entity_map": {
            "m.01nt": "Region",
            "m.0rh6k": "Washington, D.C."
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01nt": "Region"
        }
    },
    {
        "ID": "WebQTrn-1682",
        "question": "when did aldi originate",
        "comp_type": null,
        "answer": [
            "m.017gry"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0246n2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0246n2 ns:organization.organization.place_founded ?x .\n}\n",
        "sexpr": "(JOIN (R organization.organization.place_founded) m.0246n2)",
        "normed_sexpr": "( JOIN ( R [ organization , organization , place founded ] ) [ ALDI ] )",
        "gold_entity_map": {
            "m.0246n2": "ALDI"
        },
        "gold_relation_map": {
            "organization.organization.place_founded": "organization , organization , place founded"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1683",
        "question": "who created microsoft windows",
        "comp_type": null,
        "answer": [
            "m.04sv4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04r_8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04r_8 ns:computer.software.developer ?x .\n}\n",
        "sexpr": "(JOIN (R computer.software.developer) m.04r_8)",
        "normed_sexpr": "( JOIN ( R [ computer , software , developer ] ) [ Microsoft Windows ] )",
        "gold_entity_map": {
            "m.04r_8": "Microsoft Windows"
        },
        "gold_relation_map": {
            "computer.software.developer": "computer , software , developer"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1685",
        "question": "what is john steinbeck best known for",
        "comp_type": null,
        "answer": [
            "m.02xhgwq",
            "m.0cbd2",
            "m.0d8qb",
            "m.0dxtg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04107)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04107 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.04107)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ John Steinbeck ] )",
        "gold_entity_map": {
            "m.04107": "John Steinbeck"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1687",
        "question": "who nominated anthony kennedy",
        "comp_type": null,
        "answer": [
            "m.06c0j"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019s7r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019s7r ns:people.appointee.position ?y .\n?y ns:people.appointment.appointed_by ?x .\n}\n",
        "sexpr": "(JOIN (R people.appointment.appointed_by) (JOIN (R people.appointee.position) m.019s7r))",
        "normed_sexpr": "( JOIN ( R [ people , appointment , appointed by ] ) ( JOIN ( R [ people , appointee , position ] ) [ Anthony Kennedy ] ) )",
        "gold_entity_map": {
            "m.019s7r": "Anthony Kennedy"
        },
        "gold_relation_map": {
            "people.appointee.position": "people , appointee , position",
            "people.appointment.appointed_by": "people , appointment , appointed by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1690",
        "question": "where the french language come from",
        "comp_type": null,
        "answer": [
            "m.05tkbx2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.064_8sq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.064_8sq ns:base.rosetta.languoid.parent ?x .\n}\n",
        "sexpr": "(JOIN (R base.rosetta.languoid.parent) m.064_8sq)",
        "normed_sexpr": "( JOIN ( R [ base , rosetta , languoid , parent ] ) [ French ] )",
        "gold_entity_map": {
            "m.064_8sq": "French"
        },
        "gold_relation_map": {
            "base.rosetta.languoid.parent": "base , rosetta , languoid , parent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1692",
        "question": "what movie does natalie portman play in",
        "comp_type": null,
        "answer": [
            "m.0_z9qv6",
            "m.0134d9mx",
            "m.01shy7",
            "m.02cbhg",
            "m.02pw_n",
            "m.02v_87f",
            "m.02z3r8t",
            "m.02z59y_",
            "m.03h0byn",
            "m.04cj79",
            "m.04q5g",
            "m.05f7jsw",
            "m.062zjtt",
            "m.0645k5",
            "m.06z3xb",
            "m.07kg878",
            "m.08yjvl",
            "m.09k56b7",
            "m.09lxv9",
            "m.0b6d3kn",
            "m.0b79_ft",
            "m.0blmy",
            "m.0bln8",
            "m.0blp1",
            "m.0blpg",
            "m.0bxsk",
            "m.0bz3jx",
            "m.0c2pz3",
            "m.0c2wy",
            "m.0clsl7",
            "m.0cn7nb",
            "m.0ddt_",
            "m.0dfw0",
            "m.0dlkhvv",
            "m.0fdv3",
            "m.0fy9wm",
            "m.0gyy53",
            "m.0hypmnr",
            "m.0j9knfv",
            "m.0nfnhrv",
            "m.0nh4bl2",
            "m.0nh4bnn",
            "m.0w9hhc4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09l3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09l3p ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.09l3p))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Natalie Portman ] ) )",
        "gold_entity_map": {
            "m.09l3p": "Natalie Portman"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1693",
        "question": "who is the head coach of the new orleans saints",
        "comp_type": null,
        "answer": [
            "m.09z95c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g3v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g3v ns:american_football.football_team.current_head_coach ?x .\n}\n",
        "sexpr": "(JOIN (R american_football.football_team.current_head_coach) m.05g3v)",
        "normed_sexpr": "( JOIN ( R [ american football , football team , current head coach ] ) [ New Orleans Saints ] )",
        "gold_entity_map": {
            "m.05g3v": "New Orleans Saints"
        },
        "gold_relation_map": {
            "american_football.football_team.current_head_coach": "american football , football team , current head coach"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1694",
        "question": "where does the shannon river flow",
        "comp_type": null,
        "answer": [
            "m.0847q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04yg368)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04yg368 ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.04yg368)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Shannon River ] )",
        "gold_entity_map": {
            "m.04yg368": "Shannon River"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1695",
        "question": "what movies does zac efron star in",
        "comp_type": null,
        "answer": [
            "g.11b6v7j7y9",
            "m.011w_f4w",
            "m.012gbh3x",
            "m.0286_hv",
            "m.02q2plk",
            "m.03d79mp",
            "m.047bynf",
            "m.07k7h19",
            "m.087wc7n",
            "m.09dv8h",
            "m.0bc5ny",
            "m.0bt3j9",
            "m.0fphf3v",
            "m.0g55yqj",
            "m.0gpnn7",
            "m.0gpntg",
            "m.0gpp1g",
            "m.0gx938d",
            "m.0h1j5fv",
            "m.0hgky8t",
            "m.0kfzhzd",
            "m.0ng09tf",
            "m.0ng0d9f",
            "m.0ng0dbq",
            "m.0qfrrg8",
            "m.0w1wb91"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06wm0z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06wm0z ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.06wm0z))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Zac Efron ] ) )",
        "gold_entity_map": {
            "m.06wm0z": "Zac Efron"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1697",
        "question": "where is puerto galera",
        "comp_type": null,
        "answer": [
            "m.01mw7c",
            "m.05v8c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01pn1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01pn1_ ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01pn1_)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Puerto Galera, Oriental Mindoro ] )",
        "gold_entity_map": {
            "m.01pn1_": "Puerto Galera, Oriental Mindoro"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1699",
        "question": "what currency does hungary have",
        "comp_type": null,
        "answer": [
            "m.01hfll"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03gj2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03gj2 ns:location.country.currency_used ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.currency_used) m.03gj2)",
        "normed_sexpr": "( JOIN ( R [ location , country , currency used ] ) [ Hungary ] )",
        "gold_entity_map": {
            "m.03gj2": "Hungary"
        },
        "gold_relation_map": {
            "location.country.currency_used": "location , country , currency used"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1708",
        "question": "what to do and see in miami florida",
        "comp_type": null,
        "answer": [
            "m.027mkgm",
            "m.02pysdq",
            "m.02qgngm",
            "m.02vklws",
            "m.02wc4x5",
            "m.02y8b8",
            "m.03ykj__",
            "m.04f683m",
            "m.050n1m",
            "m.05rx5g",
            "m.06kf8d",
            "m.0973y_",
            "m.09v47qw",
            "m.0cmdy7y",
            "m.0lf_c4d"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0f2v0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0f2v0 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0f2v0)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Miami ] )",
        "gold_entity_map": {
            "m.0f2v0": "Miami"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1711",
        "question": "what movies did chris farley do",
        "comp_type": null,
        "answer": [
            "m.01342x",
            "m.02q3pj",
            "m.036z1n",
            "m.03dxs5",
            "m.03qfpk",
            "m.040mt6",
            "m.05fkxp",
            "m.05yxmk",
            "m.08vw2f",
            "m.0kbwb"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012801)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012801 ns:film.actor.film ?y .\n?y ns:film.performance.film ?x .\n}\n",
        "sexpr": "(JOIN (R film.performance.film) (JOIN (R film.actor.film) m.012801))",
        "normed_sexpr": "( JOIN ( R [ film , performance , film ] ) ( JOIN ( R [ film , actor , film ] ) [ Chris Farley ] ) )",
        "gold_entity_map": {
            "m.012801": "Chris Farley"
        },
        "gold_relation_map": {
            "film.actor.film": "film , actor , film",
            "film.performance.film": "film , performance , film"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-1715",
        "question": "where george washington carver go to school",
        "comp_type": null,
        "answer": [
            "m.01xssh",
            "m.03v6t",
            "m.076fk5z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03djm)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03djm ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.institution) (JOIN (R people.person.education) m.03djm))",
        "normed_sexpr": "( JOIN ( R [ education , education , institution ] ) ( JOIN ( R [ people , person , education ] ) [ George Washington Carver ] ) )",
        "gold_entity_map": {
            "m.03djm": "George Washington Carver"
        },
        "gold_relation_map": {
            "education.education.institution": "education , education , institution",
            "people.person.education": "people , person , education"
        },
        "gold_type_map": {}
    }
]