[
    {
        "ID": "WebQTrn-3485",
        "question": "in which continent is russia",
        "comp_type": null,
        "answer": [
            "m.02j9z"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bnz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bnz ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.06bnz)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Russia ] )",
        "gold_entity_map": {
            "m.06bnz": "Russia"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3486",
        "question": "what to do in ottawa ontario today",
        "comp_type": null,
        "answer": [
            "m.01kw4z",
            "m.01q67r",
            "m.0266k_",
            "m.02g7cm",
            "m.02pv10j",
            "m.02r8kj8",
            "m.039613",
            "m.03963z",
            "m.03966d",
            "m.03cymk3",
            "m.03q4gx",
            "m.042wft",
            "m.06zntx5",
            "m.07_hr6",
            "m.0826cd",
            "m.09rvcx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05ksh)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05ksh ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.05ksh)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Ottawa ] )",
        "gold_entity_map": {
            "m.05ksh": "Ottawa"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3487",
        "question": "where did paul ryan live",
        "comp_type": null,
        "answer": [
            "m.01mm_c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.024v2j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.024v2j ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.024v2j))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Paul Ryan ] ) )",
        "gold_entity_map": {
            "m.024v2j": "Paul Ryan"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3489",
        "question": "what is the australian open called",
        "comp_type": null,
        "answer": [
            "Australian Open"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05ftlg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05ftlg ns:type.object.name ?x .\n}\n",
        "sexpr": "(JOIN (R type.object.name) m.05ftlg)",
        "normed_sexpr": "( JOIN ( R [ type , object , name ] ) [ Australian Open ] )",
        "gold_entity_map": {
            "m.05ftlg": "Australian Open"
        },
        "gold_relation_map": {
            "type.object.name": "type , object , name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3491",
        "question": "where is angola located",
        "comp_type": null,
        "answer": [
            "m.0dg3n1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j4b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j4b ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.0j4b)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Angola ] )",
        "gold_entity_map": {
            "m.0j4b": "Angola"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3492",
        "question": "what is tibetan language",
        "comp_type": null,
        "answer": [
            "m.0148c4",
            "m.020gly",
            "m.02hwtv6",
            "m.02hx1d8",
            "m.02hx1h3",
            "m.02hx1pw",
            "m.02hxp6w",
            "m.02m3bw",
            "m.03dh42",
            "m.04tcky",
            "m.05fb9dg",
            "m.064r7fk",
            "m.08g721",
            "m.095gcr",
            "m.095hnm",
            "m.09g_ln"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kbrp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kbrp ns:language.language_writing_system.languages ?x .\n}\n",
        "sexpr": "(JOIN (R language.language_writing_system.languages) m.01kbrp)",
        "normed_sexpr": "( JOIN ( R [ language , language writing system , languages ] ) [ Tibetan alphabet ] )",
        "gold_entity_map": {
            "m.01kbrp": "Tibetan alphabet"
        },
        "gold_relation_map": {
            "language.language_writing_system.languages": "language , language writing system , languages"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3494",
        "question": "when did maria sharapova start playing tennis",
        "comp_type": null,
        "answer": [
            "2001-04-19"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03b7gw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03b7gw ns:tennis.tennis_player.year_turned_pro ?x .\n}\n",
        "sexpr": "(JOIN (R tennis.tennis_player.year_turned_pro) m.03b7gw)",
        "normed_sexpr": "( JOIN ( R [ tennis , tennis player , year turned pro ] ) [ Maria Sharapova ] )",
        "gold_entity_map": {
            "m.03b7gw": "Maria Sharapova"
        },
        "gold_relation_map": {
            "tennis.tennis_player.year_turned_pro": "tennis , tennis player , year turned pro"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3502",
        "question": "what is the capital of oregon",
        "comp_type": null,
        "answer": [
            "m.0d23k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05kj_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05kj_ ns:base.aareas.schema.administrative_area.capital ?x .\n}\n",
        "sexpr": "(JOIN (R base.aareas.schema.administrative_area.capital) m.05kj_)",
        "normed_sexpr": "( JOIN ( R [ base , aareas , schema , administrative area , capital ] ) [ Oregon ] )",
        "gold_entity_map": {
            "m.05kj_": "Oregon"
        },
        "gold_relation_map": {
            "base.aareas.schema.administrative_area.capital": "base , aareas , schema , administrative area , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3510",
        "question": "what teams did shaq play 4",
        "comp_type": null,
        "answer": [
            "m.026dqjm",
            "m.0bwjj",
            "m.0jm2v",
            "m.0jm4b",
            "m.0jm7n",
            "m.0jmk7",
            "m.0jml5"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.012xdf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.012xdf ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.012xdf))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Shaquille O'Neal ] ) )",
        "gold_entity_map": {
            "m.012xdf": "Shaquille O'Neal"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3514",
        "question": "where did andreas vesalius die",
        "comp_type": null,
        "answer": [
            "m.01t0n2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07zk5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07zk5 ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.07zk5)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Andreas Vesalius ] )",
        "gold_entity_map": {
            "m.07zk5": "Andreas Vesalius"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3517",
        "question": "what color are the arizona cardinals uniforms",
        "comp_type": null,
        "answer": [
            "m.019sc",
            "m.03wkwg",
            "m.083jv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ws7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ws7 ns:sports.sports_team.colors ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.colors) m.0ws7)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , colors ] ) [ Arizona Cardinals ] )",
        "gold_entity_map": {
            "m.0ws7": "Arizona Cardinals"
        },
        "gold_relation_map": {
            "sports.sports_team.colors": "sports , sports team , colors"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3519",
        "question": "where was emperor qin shi huang born",
        "comp_type": null,
        "answer": [
            "m.04xtcd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0pf00)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0pf00 ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0pf00)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Qin Shi Huang ] )",
        "gold_entity_map": {
            "m.0pf00": "Qin Shi Huang"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3522",
        "question": "which country does irish language come from",
        "comp_type": null,
        "answer": [
            "m.03rt9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03x42)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03x42 ns:language.human_language.main_country ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.main_country) m.03x42)",
        "normed_sexpr": "( JOIN ( R [ language , human language , main country ] ) [ Irish ] )",
        "gold_entity_map": {
            "m.03x42": "Irish"
        },
        "gold_relation_map": {
            "language.human_language.main_country": "language , human language , main country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3523",
        "question": "what did the harlem renaissance created",
        "comp_type": null,
        "answer": [
            "m.0bm0crh",
            "m.0bvbrrh",
            "m.0g98xzj",
            "m.0gw8fc1",
            "m.0gxmy6l",
            "m.0gxmyjk",
            "m.0gxmyk3",
            "m.0gxnkj8",
            "m.0gxnksh",
            "m.0gxq34z",
            "m.0gxq399",
            "m.0h2x8v6",
            "m.0hgc8tl",
            "m.0hnx0cj",
            "m.0hpxc1b",
            "m.0pxynmm",
            "m.0z842cv"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.019y_2)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.019y_2 ns:book.book_subject.works ?x .\n}\n",
        "sexpr": "(JOIN (R book.book_subject.works) m.019y_2)",
        "normed_sexpr": "( JOIN ( R [ book , book subject , works ] ) [ Harlem Renaissance ] )",
        "gold_entity_map": {
            "m.019y_2": "Harlem Renaissance"
        },
        "gold_relation_map": {
            "book.book_subject.works": "book , book subject , works"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3525",
        "question": "where did mendeleev died",
        "comp_type": null,
        "answer": [
            "m.06pr6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gglj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gglj ns:people.deceased_person.place_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_death) m.0gglj)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of death ] ) [ Dmitri Mendeleev ] )",
        "gold_entity_map": {
            "m.0gglj": "Dmitri Mendeleev"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_death": "people , deceased person , place of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3527",
        "question": "what language did ancient romans write in",
        "comp_type": null,
        "answer": [
            "m.0349s",
            "m.04h9h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06cmp)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06cmp ns:fictional_universe.fictional_setting.languages ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_setting.languages) m.06cmp)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional setting , languages ] ) [ Roman Empire ] )",
        "gold_entity_map": {
            "m.06cmp": "Roman Empire"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_setting.languages": "fictional universe , fictional setting , languages"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3532",
        "question": "what religion did jesus christ follow",
        "comp_type": null,
        "answer": [
            "m.03_gx"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045m1_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045m1_ ns:people.person.religion ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.religion) m.045m1_)",
        "normed_sexpr": "( JOIN ( R [ people , person , religion ] ) [ Jesus Christ ] )",
        "gold_entity_map": {
            "m.045m1_": "Jesus Christ"
        },
        "gold_relation_map": {
            "people.person.religion": "people , person , religion"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3537",
        "question": "what year was tom brady drafted",
        "comp_type": null,
        "answer": [
            "m.09gmxd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01xyt7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01xyt7 ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.01xyt7))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Tom Brady ] ) )",
        "gold_entity_map": {
            "m.01xyt7": "Tom Brady"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3538",
        "question": "what party is bloomberg affiliated with",
        "comp_type": null,
        "answer": [
            "m.075qbd2",
            "m.07wbk",
            "m.0d075m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09pfj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09pfj ns:government.politician.party ?y .\n?y ns:government.political_party_tenure.party ?x .\n}\n",
        "sexpr": "(JOIN (R government.political_party_tenure.party) (JOIN (R government.politician.party) m.09pfj))",
        "normed_sexpr": "( JOIN ( R [ government , political party tenure , party ] ) ( JOIN ( R [ government , politician , party ] ) [ Michael Bloomberg ] ) )",
        "gold_entity_map": {
            "m.09pfj": "Michael Bloomberg"
        },
        "gold_relation_map": {
            "government.politician.party": "government , politician , party",
            "government.political_party_tenure.party": "government , political party tenure , party"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3539",
        "question": "where does t boone pickens live",
        "comp_type": null,
        "answer": [
            "m.05mph"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05jyjn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05jyjn ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.05jyjn))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ T. Boone Pickens ] ) )",
        "gold_entity_map": {
            "m.05jyjn": "T. Boone Pickens"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3540",
        "question": "when did the mets win the pennant",
        "comp_type": null,
        "answer": [
            "m.01q9lc",
            "m.04jg9_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05g76)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05g76 ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.05g76)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ New York Mets ] )",
        "gold_entity_map": {
            "m.05g76": "New York Mets"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3541",
        "question": "where was saint paul from",
        "comp_type": null,
        "answer": [
            "m.03kcs9"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.060nc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.060nc ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.060nc)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Paul the Apostle ] )",
        "gold_entity_map": {
            "m.060nc": "Paul the Apostle"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3542",
        "question": "what is the capital city of germany now",
        "comp_type": null,
        "answer": [
            "m.0156q"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:location.country.capital ?x .\n}\n",
        "sexpr": "(JOIN (R location.country.capital) m.0345h)",
        "normed_sexpr": "( JOIN ( R [ location , country , capital ] ) [ Germany ] )",
        "gold_entity_map": {
            "m.0345h": "Germany"
        },
        "gold_relation_map": {
            "location.country.capital": "location , country , capital"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3545",
        "question": "what continent is syria located in",
        "comp_type": null,
        "answer": [
            "m.0j0k"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06vbd)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06vbd ns:base.locations.countries.continent ?x .\n}\n",
        "sexpr": "(JOIN (R base.locations.countries.continent) m.06vbd)",
        "normed_sexpr": "( JOIN ( R [ base , locations , countries , continent ] ) [ Syria ] )",
        "gold_entity_map": {
            "m.06vbd": "Syria"
        },
        "gold_relation_map": {
            "base.locations.countries.continent": "base , locations , countries , continent"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3546",
        "question": "what events does stephanie rice compete in",
        "comp_type": null,
        "answer": [
            "m.04f4q5m",
            "m.04g7f4g",
            "m.04g7f54",
            "m.0hzrq23"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0c1qx3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0c1qx3 ns:olympics.olympic_athlete.medals_won ?y .\n?y ns:olympics.olympic_medal_honor.event ?x .\n}\n",
        "sexpr": "(JOIN (R olympics.olympic_medal_honor.event) (JOIN (R olympics.olympic_athlete.medals_won) m.0c1qx3))",
        "normed_sexpr": "( JOIN ( R [ olympics , olympic medal honor , event ] ) ( JOIN ( R [ olympics , olympic athlete , medals won ] ) [ Stephanie Rice ] ) )",
        "gold_entity_map": {
            "m.0c1qx3": "Stephanie Rice"
        },
        "gold_relation_map": {
            "olympics.olympic_athlete.medals_won": "olympics , olympic athlete , medals won",
            "olympics.olympic_medal_honor.event": "olympics , olympic medal honor , event"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3548",
        "question": "where did charlton heston live",
        "comp_type": null,
        "answer": [
            "m.030qb3t",
            "m.0psxp",
            "m.0s5tn",
            "m.0vnvs"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0chsq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0chsq ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.0chsq))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Charlton Heston ] ) )",
        "gold_entity_map": {
            "m.0chsq": "Charlton Heston"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3549",
        "question": "where did hurricane irene",
        "comp_type": null,
        "answer": [
            "m.0157g9",
            "m.0160w",
            "m.01rll_",
            "m.01x73",
            "m.027rn",
            "m.02jwvm",
            "m.059rby",
            "m.05fjf",
            "m.05fkf",
            "m.05r7t",
            "m.0684cc",
            "m.07fr_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02p70bg)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02p70bg ns:meteorology.tropical_cyclone.affected_areas ?x .\n}\n",
        "sexpr": "(JOIN (R meteorology.tropical_cyclone.affected_areas) m.02p70bg)",
        "normed_sexpr": "( JOIN ( R [ meteorology , tropical cyclone , affected areas ] ) [ Hurricane Irene ] )",
        "gold_entity_map": {
            "m.02p70bg": "Hurricane Irene"
        },
        "gold_relation_map": {
            "meteorology.tropical_cyclone.affected_areas": "meteorology , tropical cyclone , affected areas"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3550",
        "question": "what region is thailand located in",
        "comp_type": null,
        "answer": [
            "m.073q1"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07f1x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07f1x ns:location.location.containedby ?x .\n?x ns:common.topic.notable_types ns:m.01nt .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01nt) (JOIN (R location.location.containedby) m.07f1x))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Region ] ) ( JOIN ( R [ location , location , containedby ] ) [ Thailand ] ) )",
        "gold_entity_map": {
            "m.01nt": "Region",
            "m.07f1x": "Thailand"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {
            "m.01nt": "Region"
        }
    },
    {
        "ID": "WebQTrn-3552",
        "question": "where to visit in orlando florida",
        "comp_type": null,
        "answer": [
            "m.011cgl9q",
            "m.027988f",
            "m.02hzwl",
            "m.02mv6p",
            "m.02mv7g",
            "m.02txcm",
            "m.02vm9cg",
            "m.034130",
            "m.03c_xr2",
            "m.03c6j75",
            "m.03ctc7p",
            "m.03d62sn",
            "m.0437y8",
            "m.04dh7m",
            "m.04srm9",
            "m.05ngvz",
            "m.05ppq8",
            "m.05pzpj",
            "m.05qsyq",
            "m.05x_5h",
            "m.06ph97",
            "m.09b3f",
            "m.0b__kbm",
            "m.0c2dly"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0ply0)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0ply0 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0ply0)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Orlando ] )",
        "gold_entity_map": {
            "m.0ply0": "Orlando"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3555",
        "question": "what was alexander graham bell known for",
        "comp_type": null,
        "answer": [
            "m.07cx4"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k70)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k70 ns:user.lindenb.default_domain.scientist.known_for ?x .\n}\n",
        "sexpr": "(JOIN (R user.lindenb.default_domain.scientist.known_for) m.0k70)",
        "normed_sexpr": "( JOIN ( R [ user , lindenb , default domain , scientist , known for ] ) [ Alexander Graham Bell ] )",
        "gold_entity_map": {
            "m.0k70": "Alexander Graham Bell"
        },
        "gold_relation_map": {
            "user.lindenb.default_domain.scientist.known_for": "user , lindenb , default domain , scientist , known for"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3556",
        "question": "what band did joe satriani play in",
        "comp_type": null,
        "answer": [
            "m.01ntj9y",
            "m.01w7ljg",
            "m.04q7vx6",
            "m.0cfgd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j6cj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j6cj ns:music.group_member.membership ?y .\n?y ns:music.group_membership.group ?x .\n}\n",
        "sexpr": "(JOIN (R music.group_membership.group) (JOIN (R music.group_member.membership) m.0j6cj))",
        "normed_sexpr": "( JOIN ( R [ music , group membership , group ] ) ( JOIN ( R [ music , group member , membership ] ) [ Joe Satriani ] ) )",
        "gold_entity_map": {
            "m.0j6cj": "Joe Satriani"
        },
        "gold_relation_map": {
            "music.group_membership.group": "music , group membership , group",
            "music.group_member.membership": "music , group member , membership"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-3562",
        "question": "what country was juan ponce de leon from",
        "comp_type": null,
        "answer": [
            "m.06mkj"
        ],
        "sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\tns:m.0123f1 ns:people.person.place_of_birth ?y .\n\t?y ns:location.location.containedby ?x .\n\t?x ns:common.topic.notable_types ns:m.01mp .  #Country\n}",
        "sexpr": "null",
        "normed_sexpr": "null",
        "gold_entity_map": {
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.containedby": "location , location , containedby",
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    }
]