[
    {
        "ID": "WebQTrn-472",
        "question": "what are some famous tourist attractions in germany",
        "comp_type": null,
        "answer": [
            "m.012vvtp_",
            "m.05mw0",
            "m.066tl8",
            "m.0djmy_",
            "m.0h1f0zf"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0345h)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0345h ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0345h)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Germany ] )",
        "gold_entity_map": {
            "m.0345h": "Germany"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-473",
        "question": "who 's kobe bryant",
        "comp_type": null,
        "answer": [
            "m.01445t",
            "m.02h664x"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01kmd4)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Kobe Bryant ] )",
        "gold_entity_map": {
            "m.01kmd4": "Kobe Bryant"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-476",
        "question": "what songs did richard marx write",
        "comp_type": null,
        "answer": [
            "m.0_6bp36",
            "m.0_6cmss",
            "m.0_6mdny",
            "m.0_74q0_",
            "m.0_h_cgt",
            "m.0_hzrs3",
            "m.0_j2s_6",
            "m.0_j49rz",
            "m.0_j6fdq",
            "m.0_jl7zs",
            "m.0_jy97f",
            "m.0_k6tx4",
            "m.0_k8qmn",
            "m.0_kc6_d",
            "m.0_kfk35",
            "m.0_kl558",
            "m.026z037",
            "m.027nkrj",
            "m.027z3k2",
            "m.02w8bnn",
            "m.02z693m",
            "m.02z8wxt",
            "m.047dns6",
            "m.047sv3_",
            "m.04f_5cs",
            "m.0660y6p",
            "m.06w85_m",
            "m.06ztdrs",
            "m.080c98w",
            "m.090b3g",
            "m.09v6mpn",
            "m.0dljzzm",
            "m.0dlk7dr",
            "m.0dnw07",
            "m.0gctfn",
            "m.0gkn6l",
            "m.0h3rvsp",
            "m.0j2572m",
            "m.0j7ks26",
            "m.0jyh___",
            "m.0n8gs8y",
            "m.0zh2zr8",
            "m.0zj1mbm",
            "m.0zjsk2p",
            "m.0zkpb0k",
            "m.0zlwgbd"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03t852)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03t852 ns:music.composer.compositions ?x .\n}\n",
        "sexpr": "(JOIN (R music.composer.compositions) m.03t852)",
        "normed_sexpr": "( JOIN ( R [ music , composer , compositions ] ) [ Richard Marx ] )",
        "gold_entity_map": {
            "m.03t852": "Richard Marx"
        },
        "gold_relation_map": {
            "music.composer.compositions": "music , composer , compositions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-477",
        "question": "what did ryan dunn died from",
        "comp_type": null,
        "answer": [
            "m.08q1tg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04sdsv)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04sdsv ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.04sdsv)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Ryan Dunn ] )",
        "gold_entity_map": {
            "m.04sdsv": "Ryan Dunn"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-482",
        "question": "where did al capone go to jail",
        "comp_type": null,
        "answer": [
            "m.027z7s",
            "m.0ffk70",
            "m.0m0j7_8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.014gr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.014gr ns:base.prison.prisoner.imprisoned ?y .\n?y ns:base.prison.imprisonment.prison ?x .\n}\n",
        "sexpr": "(JOIN (R base.prison.imprisonment.prison) (JOIN (R base.prison.prisoner.imprisoned) m.014gr))",
        "normed_sexpr": "( JOIN ( R [ base , prison , imprisonment , prison ] ) ( JOIN ( R [ base , prison , prisoner , imprisoned ] ) [ Al Capone ] ) )",
        "gold_entity_map": {
            "m.014gr": "Al Capone"
        },
        "gold_relation_map": {
            "base.prison.imprisonment.prison": "base , prison , imprisonment , prison",
            "base.prison.prisoner.imprisoned": "base , prison , prisoner , imprisoned"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-483",
        "question": "what type of music did richard wagner play",
        "comp_type": null,
        "answer": [
            "m.05lls",
            "m.06gk7",
            "m.0ggq0m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06c44)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06c44 ns:music.artist.genre ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.genre) m.06c44)",
        "normed_sexpr": "( JOIN ( R [ music , artist , genre ] ) [ Richard Wagner ] )",
        "gold_entity_map": {
            "m.06c44": "Richard Wagner"
        },
        "gold_relation_map": {
            "music.artist.genre": "music , artist , genre"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-486",
        "question": "what airport in paris",
        "comp_type": null,
        "answer": [
            "m.01l525",
            "m.02pp90s",
            "m.03tjk2",
            "m.0qk79"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.05qtj)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.05qtj ns:location.location.nearby_airports ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.nearby_airports) m.05qtj)",
        "normed_sexpr": "( JOIN ( R [ location , location , nearby airports ] ) [ Paris ] )",
        "gold_entity_map": {
            "m.05qtj": "Paris"
        },
        "gold_relation_map": {
            "location.location.nearby_airports": "location , location , nearby airports"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-487",
        "question": "what nationality was andy williams",
        "comp_type": null,
        "answer": [
            "m.09c7w0"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02lvtb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02lvtb ns:people.person.nationality ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.nationality) m.02lvtb)",
        "normed_sexpr": "( JOIN ( R [ people , person , nationality ] ) [ Andy Williams ] )",
        "gold_entity_map": {
            "m.02lvtb": "Andy Williams"
        },
        "gold_relation_map": {
            "people.person.nationality": "people , person , nationality"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-488",
        "question": "where did matthew brady live",
        "comp_type": null,
        "answer": [
            "m.02_286"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.028vw5)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.028vw5 ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
        "sexpr": "(JOIN (R people.place_lived.location) (JOIN (R people.person.places_lived) m.028vw5))",
        "normed_sexpr": "( JOIN ( R [ people , place lived , location ] ) ( JOIN ( R [ people , person , places lived ] ) [ Mathew Brady ] ) )",
        "gold_entity_map": {
            "m.028vw5": "Mathew Brady"
        },
        "gold_relation_map": {
            "people.person.places_lived": "people , person , places lived",
            "people.place_lived.location": "people , place lived , location"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-492",
        "question": "in what country do they speak basque",
        "comp_type": null,
        "answer": [
            "m.06mkj",
            "m.0f8l9c"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.017k6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.017k6 ns:language.human_language.countries_spoken_in ?x .\n}\n",
        "sexpr": "(JOIN (R language.human_language.countries_spoken_in) m.017k6)",
        "normed_sexpr": "( JOIN ( R [ language , human language , countries spoken in ] ) [ Basque Language ] )",
        "gold_entity_map": {
            "m.017k6": "Basque Language"
        },
        "gold_relation_map": {
            "language.human_language.countries_spoken_in": "language , human language , countries spoken in"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-493",
        "question": "where is belgium at",
        "comp_type": null,
        "answer": [
            "m.02j9z",
            "m.02qkt",
            "m.0852h"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0154j)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0154j ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.0154j)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Belgium ] )",
        "gold_entity_map": {
            "m.0154j": "Belgium"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-496",
        "question": "what did einstein do",
        "comp_type": null,
        "answer": [
            "m.01d30f",
            "m.02h6fbs",
            "m.02ktm6n",
            "m.04s2z",
            "m.05snw",
            "m.06q2q",
            "m.0cbd2",
            "m.0kyk"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jcx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jcx ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.0jcx)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Albert Einstein ] )",
        "gold_entity_map": {
            "m.0jcx": "Albert Einstein"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-497",
        "question": "in what country is amsterdam",
        "comp_type": null,
        "answer": [
            "m.059j2"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0k3p)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0k3p ns:base.biblioness.bibs_location.country ?x .\n}\n",
        "sexpr": "(JOIN (R base.biblioness.bibs_location.country) m.0k3p)",
        "normed_sexpr": "( JOIN ( R [ base , biblioness , bibs location , country ] ) [ Amsterdam ] )",
        "gold_entity_map": {
            "m.0k3p": "Amsterdam"
        },
        "gold_relation_map": {
            "base.biblioness.bibs_location.country": "base , biblioness , bibs location , country"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-499",
        "question": "what did martin luther king jr go to college for",
        "comp_type": null,
        "answer": [
            "m.0329p4",
            "m.06ms6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.051cc)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.051cc ns:people.person.education ?y .\n?y ns:education.education.major_field_of_study ?x .\n}\n",
        "sexpr": "(JOIN (R education.education.major_field_of_study) (JOIN (R people.person.education) m.051cc))",
        "normed_sexpr": "( JOIN ( R [ education , education , major field of study ] ) ( JOIN ( R [ people , person , education ] ) [ Martin Luther King, Jr. ] ) )",
        "gold_entity_map": {
            "m.051cc": "Martin Luther King, Jr."
        },
        "gold_relation_map": {
            "people.person.education": "people , person , education",
            "education.education.major_field_of_study": "education , education , major field of study"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-500",
        "question": "where did sir ernest shackleton come from",
        "comp_type": null,
        "answer": [
            "m.07s6dm7"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0gbcz)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0gbcz ns:people.person.place_of_birth ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.place_of_birth) m.0gbcz)",
        "normed_sexpr": "( JOIN ( R [ people , person , place of birth ] ) [ Sir Ernest Shackleton ] )",
        "gold_entity_map": {
            "m.0gbcz": "Sir Ernest Shackleton"
        },
        "gold_relation_map": {
            "people.person.place_of_birth": "people , person , place of birth"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-501",
        "question": "what made jimi hendrix great",
        "comp_type": null,
        "answer": [
            "m.012qdp",
            "m.01c72t",
            "m.039v1",
            "m.09jwl",
            "m.09l65",
            "m.09wct1s",
            "m.09x_r",
            "m.0dz3r",
            "m.0fq0t_c",
            "m.0n1h",
            "m.0nbcg"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsy3q)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsy3q ns:people.person.profession ?x .\n}\n",
        "sexpr": "(JOIN (R people.person.profession) m.01vsy3q)",
        "normed_sexpr": "( JOIN ( R [ people , person , profession ] ) [ Jimi Hendrix ] )",
        "gold_entity_map": {
            "m.01vsy3q": "Jimi Hendrix"
        },
        "gold_relation_map": {
            "people.person.profession": "people , person , profession"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-502",
        "question": "who did aaron rodgers play college football 4",
        "comp_type": null,
        "answer": [
            "m.02zd460"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04q06_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04q06_ ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.school ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.school) (JOIN (R sports.drafted_athlete.drafted) m.04q06_))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , school ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Aaron Rodgers ] ) )",
        "gold_entity_map": {
            "m.04q06_": "Aaron Rodgers"
        },
        "gold_relation_map": {
            "sports.sports_league_draft_pick.school": "sports , sports league draft pick , school",
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-503",
        "question": "who plays nathan scott",
        "comp_type": null,
        "answer": [
            "m.0532c_"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09p1z3)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09p1z3 ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n}\n",
        "sexpr": "(JOIN (R tv.regular_tv_appearance.actor) (JOIN (R tv.tv_character.appeared_in_tv_program) m.09p1z3))",
        "normed_sexpr": "( JOIN ( R [ tv , regular tv appearance , actor ] ) ( JOIN ( R [ tv , tv character , appeared in tv program ] ) [ Nathan Scott ] ) )",
        "gold_entity_map": {
            "m.09p1z3": "Nathan Scott"
        },
        "gold_relation_map": {
            "tv.regular_tv_appearance.actor": "tv , regular tv appearance , actor",
            "tv.tv_character.appeared_in_tv_program": "tv , tv character , appeared in tv program"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-504",
        "question": "when did the houston rockets win the championship",
        "comp_type": null,
        "answer": [
            "m.08x9cq",
            "m.08x9k6"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jmfb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jmfb ns:sports.sports_team.championships ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team.championships) m.0jmfb)",
        "normed_sexpr": "( JOIN ( R [ sports , sports team , championships ] ) [ Houston Rockets ] )",
        "gold_entity_map": {
            "m.0jmfb": "Houston Rockets"
        },
        "gold_relation_map": {
            "sports.sports_team.championships": "sports , sports team , championships"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-505",
        "question": "where is mount whitney",
        "comp_type": null,
        "answer": [
            "m.0db94"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01jlyt)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01jlyt ns:geography.mountain.mountain_range ?x .\n}\n",
        "sexpr": "(JOIN (R geography.mountain.mountain_range) m.01jlyt)",
        "normed_sexpr": "( JOIN ( R [ geography , mountain , mountain range ] ) [ Mount Whitney ] )",
        "gold_entity_map": {
            "m.01jlyt": "Mount Whitney"
        },
        "gold_relation_map": {
            "geography.mountain.mountain_range": "geography , mountain , mountain range"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-506",
        "question": "who created the character of romeo",
        "comp_type": null,
        "answer": [
            "m.081k8"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02qnhw1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02qnhw1 ns:fictional_universe.fictional_character.character_created_by ?x .\n}\n",
        "sexpr": "(JOIN (R fictional_universe.fictional_character.character_created_by) m.02qnhw1)",
        "normed_sexpr": "( JOIN ( R [ fictional universe , fictional character , character created by ] ) [ Romeo ] )",
        "gold_entity_map": {
            "m.02qnhw1": "Romeo"
        },
        "gold_relation_map": {
            "fictional_universe.fictional_character.character_created_by": "fictional universe , fictional character , character created by"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-509",
        "question": "where is puntland somalia",
        "comp_type": null,
        "answer": [
            "m.06tgw"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01hywq)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01hywq ns:location.location.containedby ?x .\n}\n",
        "sexpr": "(JOIN (R location.location.containedby) m.01hywq)",
        "normed_sexpr": "( JOIN ( R [ location , location , containedby ] ) [ Puntland ] )",
        "gold_entity_map": {
            "m.01hywq": "Puntland"
        },
        "gold_relation_map": {
            "location.location.containedby": "location , location , containedby"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-512",
        "question": "what is kareem abdul jabbar real name",
        "comp_type": null,
        "answer": [
            "Ferdinand Lewis Alcindor, Jr."
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.049sb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.049sb ns:base.schemastaging.context_name.official_name ?x .\n}\n",
        "sexpr": "(JOIN (R base.schemastaging.context_name.official_name) m.049sb)",
        "normed_sexpr": "( JOIN ( R [ base , schemastaging , context name , official name ] ) [ Kareem Abdul-Jabbar ] )",
        "gold_entity_map": {
            "m.049sb": "Kareem Abdul-Jabbar"
        },
        "gold_relation_map": {
            "base.schemastaging.context_name.official_name": "base , schemastaging , context name , official name"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-513",
        "question": "what countries fall in eastern europe",
        "comp_type": null,
        "answer": [
            "m.015qh",
            "m.01rdm0",
            "m.01rhrd",
            "m.021hd9",
            "m.03msdy",
            "m.03pn9",
            "m.04w4s",
            "m.06c1y",
            "m.08z6cq",
            "m.0c81v",
            "m.0d0kn"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.09b69)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.09b69 ns:location.location.contains ?x .\n?x ns:common.topic.notable_types ns:m.01mp .\n}\n",
        "sexpr": "(AND (JOIN common.topic.notable_types m.01mp) (JOIN (R location.location.contains) m.09b69))",
        "normed_sexpr": "( AND ( JOIN [ common , topic , notable types ] [ Country ] ) ( JOIN ( R [ location , location , contains ] ) [ Eastern Europe ] ) )",
        "gold_entity_map": {
            "m.09b69": "Eastern Europe",
            "m.01mp": "Country"
        },
        "gold_relation_map": {
            "common.topic.notable_types": "common , topic , notable types",
            "location.location.contains": "location , location , contains"
        },
        "gold_type_map": {
            "m.01mp": "Country"
        }
    },
    {
        "ID": "WebQTrn-514",
        "question": "what are taylor swift 's albums",
        "comp_type": null,
        "answer": [
            "g.11b6hzvg95",
            "g.11b7_l6mtp",
            "g.11btzxkr6h",
            "g.12hhhh17b",
            "m.011lmhtd",
            "m.011lmk0n",
            "m.012_y_jq",
            "m.012mpq38",
            "m.012wtwn0",
            "m.012yb9pt",
            "m.013022f7",
            "m.013780bj",
            "m.01384jbf",
            "m.03cl661",
            "m.03g7rsz",
            "m.04fzl64",
            "m.04glrxj",
            "m.0cmdv8y",
            "m.0dx87fz",
            "m.0dyfhdr",
            "m.0f9j46z",
            "m.0fsvq5r",
            "m.0h32z_v",
            "m.0h64xty",
            "m.0kt11l5",
            "m.0l8mh7y",
            "m.0ncnjcy",
            "m.0np7lyc",
            "m.0np8z3z",
            "m.0q8fd99",
            "m.0qbj764",
            "m.0qcj7kz",
            "m.0qdjmwp",
            "m.0qhct4y",
            "m.0qhcyx7",
            "m.0qhdszl",
            "m.0qs2v1z",
            "m.0rzq3vt",
            "m.0v90pw0",
            "m.0v90yqv",
            "m.0v90ysy",
            "m.0v90yvp",
            "m.0v90ywq",
            "m.0w1gb4n",
            "m.0w1gbng",
            "m.0w1gbxc",
            "m.0w1gc7j",
            "m.0w1gcgg",
            "m.0w1gcr6",
            "m.0xnlcw8",
            "m.0xnldx7",
            "m.0xnlfj0",
            "m.0xnlg6g",
            "m.0xnlgv6",
            "m.0xnlhtx",
            "m.0xnljbl",
            "m.0xnlk03",
            "m.0xnln6f",
            "m.0xnlptf",
            "m.0xnltf5",
            "m.0y603xz",
            "m.0ychqg1",
            "m.0ymh9t3",
            "m.0zt7wlh"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dl567)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dl567 ns:music.artist.album ?x .\n}\n",
        "sexpr": "(JOIN (R music.artist.album) m.0dl567)",
        "normed_sexpr": "( JOIN ( R [ music , artist , album ] ) [ Taylor Swift ] )",
        "gold_entity_map": {
            "m.0dl567": "Taylor Swift"
        },
        "gold_relation_map": {
            "music.artist.album": "music , artist , album"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-516",
        "question": "when was mary poppins made",
        "comp_type": null,
        "answer": [
            "1964-08-27"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kcn7)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kcn7 ns:film.film.initial_release_date ?x .\n}\n",
        "sexpr": "(JOIN (R film.film.initial_release_date) m.0kcn7)",
        "normed_sexpr": "( JOIN ( R [ film , film , initial release date ] ) [ Mary Poppins ] )",
        "gold_entity_map": {
            "m.0kcn7": "Mary Poppins"
        },
        "gold_relation_map": {
            "film.film.initial_release_date": "film , film , initial release date"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-517",
        "question": "what did king edward vi died from",
        "comp_type": null,
        "answer": [
            "m.07jwr"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02s82)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02s82 ns:people.deceased_person.cause_of_death ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.cause_of_death) m.02s82)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , cause of death ] ) [ Edward VI of England ] )",
        "gold_entity_map": {
            "m.02s82": "Edward VI of England"
        },
        "gold_relation_map": {
            "people.deceased_person.cause_of_death": "people , deceased person , cause of death"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-519",
        "question": "who did johnny bench play for",
        "comp_type": null,
        "answer": [
            "m.01ypc"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0476l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0476l ns:sports.pro_athlete.teams ?y .\n?y ns:sports.sports_team_roster.team ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_team_roster.team) (JOIN (R sports.pro_athlete.teams) m.0476l))",
        "normed_sexpr": "( JOIN ( R [ sports , sports team roster , team ] ) ( JOIN ( R [ sports , pro athlete , teams ] ) [ Johnny Bench ] ) )",
        "gold_entity_map": {
            "m.0476l": "Johnny Bench"
        },
        "gold_relation_map": {
            "sports.sports_team_roster.team": "sports , sports team roster , team",
            "sports.pro_athlete.teams": "sports , pro athlete , teams"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-521",
        "question": "where is napoleon buried",
        "comp_type": null,
        "answer": [
            "m.0gxqj"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0j5b8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0j5b8 ns:people.deceased_person.place_of_burial ?x .\n}\n",
        "sexpr": "(JOIN (R people.deceased_person.place_of_burial) m.0j5b8)",
        "normed_sexpr": "( JOIN ( R [ people , deceased person , place of burial ] ) [ Napoleon Bonaparte ] )",
        "gold_entity_map": {
            "m.0j5b8": "Napoleon Bonaparte"
        },
        "gold_relation_map": {
            "people.deceased_person.place_of_burial": "people , deceased person , place of burial"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-526",
        "question": "what to see and do in galway ireland",
        "comp_type": null,
        "answer": [
            "m.01798p",
            "m.017hs7",
            "m.01bx21",
            "m.01cm11",
            "m.0269xds",
            "m.02z573b",
            "m.03cbp7t",
            "m.047d2xk",
            "m.0ch85h",
            "m.0ft87m"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0m__z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0m__z ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
        "sexpr": "(JOIN (R travel.travel_destination.tourist_attractions) m.0m__z)",
        "normed_sexpr": "( JOIN ( R [ travel , travel destination , tourist attractions ] ) [ Galway ] )",
        "gold_entity_map": {
            "m.0m__z": "Galway"
        },
        "gold_relation_map": {
            "travel.travel_destination.tourist_attractions": "travel , travel destination , tourist attractions"
        },
        "gold_type_map": {}
    },
    {
        "ID": "WebQTrn-527",
        "question": "what year did brandon roy get drafted",
        "comp_type": null,
        "answer": [
            "m.09th87"
        ],
        "sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0cf_p_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0cf_p_ ns:sports.drafted_athlete.drafted ?y .\n?y ns:sports.sports_league_draft_pick.draft ?x .\n}\n",
        "sexpr": "(JOIN (R sports.sports_league_draft_pick.draft) (JOIN (R sports.drafted_athlete.drafted) m.0cf_p_))",
        "normed_sexpr": "( JOIN ( R [ sports , sports league draft pick , draft ] ) ( JOIN ( R [ sports , drafted athlete , drafted ] ) [ Brandon Roy ] ) )",
        "gold_entity_map": {
            "m.0cf_p_": "Brandon Roy"
        },
        "gold_relation_map": {
            "sports.drafted_athlete.drafted": "sports , drafted athlete , drafted",
            "sports.sports_league_draft_pick.draft": "sports , sports league draft pick , draft"
        },
        "gold_type_map": {}
    }
]