{
  "Version": "1.0",
  "FreebaseVersion": "2015-08-09",
  "Questions": [
    {
      "QuestionId": "WebQTrn-2312",
      "RawQuestion": "where to hang out in chicago?",
      "ProcessedQuestion": "where to hang out in chicago",
      "Parses": [
        {
          "ParseId": "WebQTrn-2312.P0",
          "AnnotatorId": 5,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Low",
            "FreeFormComment": "? places for hang out?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01_d4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01_d4 ns:travel.travel_destination.tourist_attractions ?x .\n}\n",
          "PotentialTopicEntityMention": "chicago",
          "TopicEntityName": "Chicago",
          "TopicEntityMid": "m.01_d4",
          "InferentialChain": [
            "travel.travel_destination.tourist_attractions"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.01dlzc",
              "EntityName": "Adler Planetarium"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.021czc",
              "EntityName": "Field Museum of Natural History"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.025v4fb",
              "EntityName": "Lincoln Park Zoo"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.027hqc_",
              "EntityName": "Art Institute of Chicago"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02jw0z",
              "EntityName": "Shedd Aquarium"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02rvwrv",
              "EntityName": "Art Institute of Chicago Building"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02vv_6w",
              "EntityName": "Polish Museum of America"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03y4l3",
              "EntityName": "Gilmore Car Museum"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.04h9qj",
              "EntityName": "Brookfield Zoo"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05zv09",
              "EntityName": "Chicago Cultural Center"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.06_7k",
              "EntityName": "Willis Tower"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.07qbm4",
              "EntityName": "Hyde Park Art Center"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.094154",
              "EntityName": "National Museum of Mexican Art"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0b0sh",
              "EntityName": "Wrigley Field"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0b28z",
              "EntityName": "John Hancock Center"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0bl8mx",
              "EntityName": "DuSable Museum of African American History"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0c7ln",
              "EntityName": "Navy Pier"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0d9wz",
              "EntityName": "Museum of Science and Industry"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0g_8d0",
              "EntityName": "Cadillac Palace Theatre"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0j2m3px",
              "EntityName": "Museum of Science and Industry"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0n4_xtw",
              "EntityName": "Chicago Riverwalk"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0n8yyvt",
              "EntityName": "Riis Park"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0w7m2x9",
              "EntityName": "Muslim Community Center"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2393",
      "RawQuestion": "who started google?",
      "ProcessedQuestion": "who started google",
      "Parses": [
        {
          "ParseId": "WebQTrn-2393.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0387r)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0387r ns:law.invention.inventor ?x .\n}\n",
          "PotentialTopicEntityMention": "google",
          "TopicEntityName": "Google Search",
          "TopicEntityMid": "m.0387r",
          "InferentialChain": [
            "law.invention.inventor"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0gjpq",
              "EntityName": "Larry Page"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0gjq6",
              "EntityName": "Sergey Brin"
            }
          ]
        },
        {
          "ParseId": "WebQTrn-2393.P1",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045c7b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045c7b ns:organization.organization.founders ?x .\n}\n",
          "PotentialTopicEntityMention": "google",
          "TopicEntityName": "Google",
          "TopicEntityMid": "m.045c7b",
          "InferentialChain": [
            "organization.organization.founders"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0gjpq",
              "EntityName": "Larry Page"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0gjq6",
              "EntityName": "Sergey Brin"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2428",
      "RawQuestion": "who is john garcia?",
      "ProcessedQuestion": "who is john garcia",
      "Parses": [
        {
          "ParseId": "WebQTrn-2428.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_lpf)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_lpf ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "john garcia",
          "TopicEntityName": "John Garcia",
          "TopicEntityMid": "m.03_lpf",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.09jwl",
              "EntityName": "Musician"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.09l65",
              "EntityName": "Singer"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2826",
      "RawQuestion": "where does eddie bravo teach?",
      "ProcessedQuestion": "where does eddie bravo teach",
      "Parses": [
        {
          "ParseId": "WebQTrn-2826.P0",
          "AnnotatorId": 5,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "VeryLow",
            "FreeFormComment": "?? teaching place = living place?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.08rm_x)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.08rm_x ns:people.person.places_lived ?y .\n?y ns:people.place_lived.location ?x .\n}\n",
          "PotentialTopicEntityMention": "eddie bravo",
          "TopicEntityName": "Eddie Bravo",
          "TopicEntityMid": "m.08rm_x",
          "InferentialChain": [
            "people.person.places_lived",
            "people.place_lived.location"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0jbrr",
              "EntityName": "Santa Ana"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2830",
      "RawQuestion": "where is madeira?",
      "ProcessedQuestion": "where is madeira",
      "Parses": [
        {
          "ParseId": "WebQTrn-2830.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:base.aareas.schema.administrative_area.administrative_parent ?x .\n}\n",
          "PotentialTopicEntityMention": "madeira",
          "TopicEntityName": "Madeira",
          "TopicEntityMid": "m.04_z1",
          "InferentialChain": [
            "base.aareas.schema.administrative_area.administrative_parent"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05r4w",
              "EntityName": "Portugal"
            }
          ]
        },
        {
          "ParseId": "WebQTrn-2830.P1",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:location.administrative_division.country ?x .\n}\n",
          "PotentialTopicEntityMention": "madeira",
          "TopicEntityName": "Madeira",
          "TopicEntityMid": "m.04_z1",
          "InferentialChain": [
            "location.administrative_division.country"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05r4w",
              "EntityName": "Portugal"
            }
          ]
        },
        {
          "ParseId": "WebQTrn-2830.P2",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:location.administrative_division.first_level_division_of ?x .\n}\n",
          "PotentialTopicEntityMention": "madeira",
          "TopicEntityName": "Madeira",
          "TopicEntityMid": "m.04_z1",
          "InferentialChain": [
            "location.administrative_division.first_level_division_of"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05r4w",
              "EntityName": "Portugal"
            }
          ]
        },
        {
          "ParseId": "WebQTrn-2830.P3",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04_z1)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04_z1 ns:location.location.containedby ?x .\n}\n",
          "PotentialTopicEntityMention": "madeira",
          "TopicEntityName": "Madeira",
          "TopicEntityMid": "m.04_z1",
          "InferentialChain": [
            "location.location.containedby"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.04g96mg",
              "EntityName": "Azores Canaries Madeira"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05r4w",
              "EntityName": "Portugal"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0j_kh1k",
              "EntityName": "Madeira Islands archipelago"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0j3b",
              "EntityName": "Atlantic Ocean"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2865",
      "RawQuestion": "where is bosnia?",
      "ProcessedQuestion": "where is bosnia",
      "Parses": [
        {
          "ParseId": "WebQTrn-2865.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:base.locations.countries.continent ?x .\n}\n",
          "PotentialTopicEntityMention": "bosnia",
          "TopicEntityName": "Bosnia and Herzegovina",
          "TopicEntityMid": "m.0166b",
          "InferentialChain": [
            "base.locations.countries.continent"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02j9z",
              "EntityName": "Europe"
            }
          ]
        },
        {
          "ParseId": "WebQTrn-2865.P1",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0166b)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0166b ns:location.location.containedby ?x .\n}\n",
          "PotentialTopicEntityMention": "bosnia",
          "TopicEntityName": "Bosnia and Herzegovina",
          "TopicEntityMid": "m.0166b",
          "InferentialChain": [
            "location.location.containedby"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.01jjk",
              "EntityName": "Balkans"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02j9z",
              "EntityName": "Europe"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02qkt",
              "EntityName": "Eurasia"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-3094",
      "RawQuestion": "who is aidan quinn?",
      "ProcessedQuestion": "who is aidan quinn",
      "Parses": [
        {
          "ParseId": "WebQTrn-3094.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.045c66)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.045c66 ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "aidan quinn",
          "TopicEntityName": "Aidan Quinn",
          "TopicEntityMid": "m.045c66",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02hrh1q",
              "EntityName": "Actor"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-3158",
      "RawQuestion": "what boudicca do?",
      "ProcessedQuestion": "what boudicca do",
      "Parses": [
        {
          "ParseId": "WebQTrn-3158.P0",
          "AnnotatorId": 3,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Low",
            "FreeFormComment": "?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01fz6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01fz6 ns:common.topic.notable_types ?x .\n}\n",
          "PotentialTopicEntityMention": "boudicca",
          "TopicEntityName": "Boudica",
          "TopicEntityMid": "m.01fz6",
          "InferentialChain": [
            "common.topic.notable_types"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02h77nv",
              "EntityName": "Military Commander"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-3586",
      "RawQuestion": "what nestle owns?",
      "ProcessedQuestion": "what nestle owns",
      "Parses": [
        {
          "ParseId": "WebQTrn-3586.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01556g)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01556g ns:business.business_operation.industry ?x .\n}\n",
          "PotentialTopicEntityMention": "nestle",
          "TopicEntityName": "Nestlé",
          "TopicEntityMid": "m.01556g",
          "InferentialChain": [
            "business.business_operation.industry"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02vjn0",
              "EntityName": "Food processing"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03q9wy3",
              "EntityName": "Ice Cream and Frozen Dessert Manufacturing"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03q9x41",
              "EntityName": "Soft Drink Manufacturing"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03q9x47",
              "EntityName": "Bottled Water Manufacturing"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03qtd73",
              "EntityName": "Cookies and Crackers"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03qtd7r",
              "EntityName": "Chocolate and Cocoa Products"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03qtd9w",
              "EntityName": "Bottled and Canned Soft Drinks and Carbonated Waters"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-3612",
      "RawQuestion": "what is kate spade?",
      "ProcessedQuestion": "what is kate spade",
      "Parses": [
        {
          "ParseId": "WebQTrn-3612.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06bkdx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06bkdx ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "kate spade",
          "TopicEntityName": "Kate Spade",
          "TopicEntityMid": "m.06bkdx",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02hqyhw",
              "EntityName": "Fashion designer"
            }
          ]
        }
      ]
    }
  ]
}
