{
  "Version": "1.0",
  "FreebaseVersion": "2015-08-09",
  "Questions": [
    {
      "QuestionId": "WebQTrn-122",
      "RawQuestion": "what is the world's tallest building in dubai called?",
      "ProcessedQuestion": "what is the world 's tallest building in dubai called",
      "Parses": [
        {
          "ParseId": "WebQTrn-122.P0",
          "AnnotatorId": 4,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "!Manual Sparql. Comment: F Aggregation. Original comment: F Notable landmarks where type = skyscraper and height is the max?"
          },
          "Sparql": "#MANUAL SPARQL\nPREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\n\t?x ns:common.topic.notable_types ns:m.01xljq9 ; #skyskraper\n\t   ns:location.location.containedby ns:m.01f08r ;\t#Dubai\n           ns:architecture.structure.height_meters ?y\n}\nORDER BY DESC(xsd:float(?y))\nLIMIT 1",
          "PotentialTopicEntityMention": "dubai",
          "TopicEntityName": "Dubai",
          "TopicEntityMid": "m.01f08r",
          "InferentialChain": null,
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03cn0v",
              "EntityName": "Burj Khalifa"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-248",
      "RawQuestion": "who started pixar?",
      "ProcessedQuestion": "who started pixar",
      "Parses": [
        {
          "ParseId": "WebQTrn-248.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0kk9v)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0kk9v ns:organization.organization.founders ?x .\n}\n",
          "PotentialTopicEntityMention": "pixar",
          "TopicEntityName": "Pixar",
          "TopicEntityMid": "m.0kk9v",
          "InferentialChain": [
            "organization.organization.founders"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.017h4c",
              "EntityName": "Edwin Catmull"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.06y3r",
              "EntityName": "Steve Jobs"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-376",
      "RawQuestion": "who speaks farsi?",
      "ProcessedQuestion": "who speaks farsi",
      "Parses": [
        {
          "ParseId": "WebQTrn-376.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.032f6)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.032f6 ns:language.human_language.countries_spoken_in ?x .\n}\n",
          "PotentialTopicEntityMention": "farsi",
          "TopicEntityName": "Persian Language",
          "TopicEntityMid": "m.032f6",
          "InferentialChain": [
            "language.human_language.countries_spoken_in"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0161c",
              "EntityName": "Bahrain"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02z62v1",
              "EntityName": "Seljuk Empire"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03shp",
              "EntityName": "Iran"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05l8y",
              "EntityName": "Oman"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.07dvs",
              "EntityName": "Tajikistan"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.07t_x",
              "EntityName": "Uzbekistan"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0d05q4",
              "EntityName": "Iraq"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0d060g",
              "EntityName": "Canada"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-408",
      "RawQuestion": "what airport is closest to sandals grande in st lucia?",
      "ProcessedQuestion": "what airport is closest to sandals grande in st lucia",
      "Parses": [
        {
          "ParseId": "WebQTrn-408.P0",
          "AnnotatorId": 4,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Low",
            "FreeFormComment": "? Can we answer nearest airport to a resort?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.06s0l)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.06s0l ns:location.location.nearby_airports ?x .\n}\n",
          "PotentialTopicEntityMention": "st lucia",
          "TopicEntityName": "Saint Lucia",
          "TopicEntityMid": "m.06s0l",
          "InferentialChain": [
            "location.location.nearby_airports"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02zrg2",
              "EntityName": "George F. L. Charles Airport"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-426",
      "RawQuestion": "who was louis riel?",
      "ProcessedQuestion": "who was louis riel",
      "Parses": [
        {
          "ParseId": "WebQTrn-426.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.04qqn)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.04qqn ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "louis riel",
          "TopicEntityName": "Louis Riel",
          "TopicEntityMid": "m.04qqn",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0fj9f",
              "EntityName": "Politician"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-473",
      "RawQuestion": "who's kobe bryant?",
      "ProcessedQuestion": "who 's kobe bryant",
      "Parses": [
        {
          "ParseId": "WebQTrn-473.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01kmd4)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01kmd4 ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "kobe bryant",
          "TopicEntityName": "Kobe Bryant",
          "TopicEntityMid": "m.01kmd4",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.01445t",
              "EntityName": "Athlete"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02h664x",
              "EntityName": "Basketball player"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-605",
      "RawQuestion": "who was tex beneke?",
      "ProcessedQuestion": "who was tex beneke",
      "Parses": [
        {
          "ParseId": "WebQTrn-605.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.076yxy)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.076yxy ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "tex beneke",
          "TopicEntityName": "Tex Beneke",
          "TopicEntityMid": "m.076yxy",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.029bkp",
              "EntityName": "Bandleader"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02h66dr",
              "EntityName": "Saxophonist"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.09jwl",
              "EntityName": "Musician"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.09l65",
              "EntityName": "Singer"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-675",
      "RawQuestion": "who is the leader of japan?",
      "ProcessedQuestion": "who is the leader of japan",
      "Parses": [
        {
          "ParseId": "WebQTrn-675.P0",
          "AnnotatorId": 5,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Low",
            "FreeFormComment": "? prime minister instead?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.03_3d)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.03_3d ns:government.governmental_jurisdiction.governing_officials ?y .\n?y ns:government.government_position_held.office_holder ?x .\n?y ns:government.government_position_held.basic_title ns:m.02rbq .\nFILTER(NOT EXISTS {?y ns:government.government_position_held.from ?sk0} || \nEXISTS {?y ns:government.government_position_held.from ?sk1 . \nFILTER(xsd:datetime(?sk1) <= \"2015-08-10\"^^xsd:dateTime) })\nFILTER(NOT EXISTS {?y ns:government.government_position_held.to ?sk2} || \nEXISTS {?y ns:government.government_position_held.to ?sk3 . \nFILTER(xsd:datetime(?sk3) >= \"2015-08-10\"^^xsd:dateTime) })\n}\n",
          "PotentialTopicEntityMention": "japan",
          "TopicEntityName": "Japan",
          "TopicEntityMid": "m.03_3d",
          "InferentialChain": [
            "government.governmental_jurisdiction.governing_officials",
            "government.government_position_held.office_holder"
          ],
          "Constraints": [
            {
              "Operator": "Equal",
              "ArgumentType": "Entity",
              "Argument": "m.02rbq",
              "EntityName": "Emperor",
              "SourceNodeIndex": 0,
              "NodePredicate": "government.government_position_held.basic_title",
              "ValueType": "String"
            },
            {
              "Operator": "LessOrEqual",
              "ArgumentType": "Value",
              "Argument": "2015-08-10",
              "EntityName": "",
              "SourceNodeIndex": 0,
              "NodePredicate": "government.government_position_held.from",
              "ValueType": "DateTime"
            },
            {
              "Operator": "GreaterOrEqual",
              "ArgumentType": "Value",
              "Argument": "2015-08-10",
              "EntityName": "",
              "SourceNodeIndex": 0,
              "NodePredicate": "government.government_position_held.to",
              "ValueType": "DateTime"
            }
          ],
          "Time": {
            "IsRelativeToNow": true,
            "Start": "0000-00-00",
            "End": "0000-00-00",
            "AssociatedConstraints": [
              1,
              2
            ],
            "PotentialTimeMention": null
          },
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0kfzb",
              "EntityName": "Akihito"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-908",
      "RawQuestion": "who is james dean?",
      "ProcessedQuestion": "who is james dean",
      "Parses": [
        {
          "ParseId": "WebQTrn-908.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01w32s8)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01w32s8 ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "james dean",
          "TopicEntityName": "James Dean",
          "TopicEntityMid": "m.01w32s8",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02hrh1q",
              "EntityName": "Actor"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-924",
      "RawQuestion": "what middle school did barack obama attend?",
      "ProcessedQuestion": "what middle school did barack obama attend",
      "Parses": [
        {
          "ParseId": "WebQTrn-924.P0",
          "AnnotatorId": 5,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Low",
            "FreeFormComment": "? middle school == Elementary, Secondary Ed ?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.02mjmr)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.02mjmr ns:people.person.education ?y .\n?y ns:education.education.institution ?x .\n?x ns:base.schemastaging.non_profit_extra.classification ns:m.0ppgt66 .\n}\n",
          "PotentialTopicEntityMention": "barack obama",
          "TopicEntityName": "Barack Obama",
          "TopicEntityMid": "m.02mjmr",
          "InferentialChain": [
            "people.person.education",
            "education.education.institution"
          ],
          "Constraints": [
            {
              "Operator": "Equal",
              "ArgumentType": "Entity",
              "Argument": "m.0ppgt66",
              "EntityName": "Elementary, Secondary Ed",
              "SourceNodeIndex": 1,
              "NodePredicate": "base.schemastaging.non_profit_extra.classification",
              "ValueType": "String"
            }
          ],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02d9nr",
              "EntityName": "Punahou School"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-973",
      "RawQuestion": "who was dan cody?",
      "ProcessedQuestion": "who was dan cody",
      "Parses": [
        {
          "ParseId": "WebQTrn-973.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.07m5fb)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.07m5fb ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "dan cody",
          "TopicEntityName": "Dan Cody",
          "TopicEntityMid": "m.07m5fb",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02h665k",
              "EntityName": "American football player"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-1013",
      "RawQuestion": "who is aidan davis?",
      "ProcessedQuestion": "who is aidan davis",
      "Parses": [
        {
          "ParseId": "WebQTrn-1013.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.080p6xw)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.080p6xw ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "aidan davis",
          "TopicEntityName": "Aidan Davis",
          "TopicEntityMid": "m.080p6xw",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.015cjr",
              "EntityName": "Presenter"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02h6p92",
              "EntityName": "Dancer"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-1180",
      "RawQuestion": "where is wellsville missouri?",
      "ProcessedQuestion": "where is wellsville missouri",
      "Parses": [
        {
          "ParseId": "WebQTrn-1180.P0",
          "AnnotatorId": 4,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Low",
            "FreeFormComment": "? Do they want GPS location or county?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0wy41)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0wy41 ns:location.location.containedby ?x .\n}\n",
          "PotentialTopicEntityMention": "wellsville missouri",
          "TopicEntityName": "Wellsville",
          "TopicEntityMid": "m.0wy41",
          "InferentialChain": [
            "location.location.containedby"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.04ych",
              "EntityName": "Missouri"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.09c7w0",
              "EntityName": "United States of America"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0fwvj",
              "EntityName": "Montgomery County"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-1240",
      "RawQuestion": "where is mallorca?",
      "ProcessedQuestion": "where is mallorca",
      "Parses": [
        {
          "ParseId": "WebQTrn-1240.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0g52z)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0g52z ns:geography.island.body_of_water ?x .\n}\n",
          "PotentialTopicEntityMention": "mallorca",
          "TopicEntityName": "Majorca",
          "TopicEntityMid": "m.0g52z",
          "InferentialChain": [
            "geography.island.body_of_water"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.04swx",
              "EntityName": "Mediterranean Sea"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-1384",
      "RawQuestion": "who was louis xvi?",
      "ProcessedQuestion": "who was louis xvi",
      "Parses": [
        {
          "ParseId": "WebQTrn-1384.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0dj9w)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0dj9w ns:royalty.noble_person.titles ?y .\n?y ns:royalty.noble_title_tenure.noble_title ?x .\n}\n",
          "PotentialTopicEntityMention": "louis xvi",
          "TopicEntityName": "Louis XVI of France",
          "TopicEntityMid": "m.0dj9w",
          "InferentialChain": [
            "royalty.noble_person.titles",
            "royalty.noble_title_tenure.noble_title"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0290vf",
              "EntityName": "Duke of Normandy"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.05st_0j",
              "EntityName": "King of France"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.063032x",
              "EntityName": "King of Navarre"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-1979",
      "RawQuestion": "who's betty white?",
      "ProcessedQuestion": "who 's betty white",
      "Parses": [
        {
          "ParseId": "WebQTrn-1979.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025mb_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025mb_ ns:people.person.profession ?x .\n}\n",
          "PotentialTopicEntityMention": "betty white",
          "TopicEntityName": "Betty White",
          "TopicEntityMid": "m.025mb_",
          "InferentialChain": [
            "people.person.profession"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.015cjr",
              "EntityName": "Presenter"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.018gz8",
              "EntityName": "Comedian"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02hrh1q",
              "EntityName": "Actor"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.03gjzk",
              "EntityName": "Television producer"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.09l65",
              "EntityName": "Singer"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0cbd2",
              "EntityName": "Writer"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0dypbr",
              "EntityName": "TV Personality"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0kyk",
              "EntityName": "Author"
            },
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0np9r",
              "EntityName": "Voice Actor"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-1992",
      "RawQuestion": "who shot j lennon?",
      "ProcessedQuestion": "who shot j lennon",
      "Parses": [
        {
          "ParseId": "WebQTrn-1992.P0",
          "AnnotatorId": 1,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "Normal",
            "FreeFormComment": "First-round parse verification"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.01vsl3_)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.01vsl3_ ns:user.alexander.misc.murdered_person.murdered_by ?x .\n}\n",
          "PotentialTopicEntityMention": "j lennon",
          "TopicEntityName": "John Lennon",
          "TopicEntityMid": "m.01vsl3_",
          "InferentialChain": [
            "user.alexander.misc.murdered_person.murdered_by"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.01p64f",
              "EntityName": "Mark David Chapman"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2062",
      "RawQuestion": "who plays young john winchester in supernatural?",
      "ProcessedQuestion": "who plays young john winchester in supernatural",
      "Parses": [
        {
          "ParseId": "WebQTrn-2062.P0",
          "AnnotatorId": 3,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "VeryLow",
            "FreeFormComment": "?? min corresponds to young?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.025ybxs)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.025ybxs ns:tv.tv_character.appeared_in_tv_program ?y .\n?y ns:tv.regular_tv_appearance.actor ?x .\n?y ns:tv.regular_tv_appearance.series ns:m.06s3sm .\n?y ns:tv.regular_tv_appearance.from ?sk0 .\n}\nORDER BY xsd:datetime(?sk0)\nLIMIT 1\n",
          "PotentialTopicEntityMention": "john winchester",
          "TopicEntityName": "John Winchester",
          "TopicEntityMid": "m.025ybxs",
          "InferentialChain": [
            "tv.tv_character.appeared_in_tv_program",
            "tv.regular_tv_appearance.actor"
          ],
          "Constraints": [
            {
              "Operator": "Equal",
              "ArgumentType": "Entity",
              "Argument": "m.06s3sm",
              "EntityName": "Supernatural",
              "SourceNodeIndex": 0,
              "NodePredicate": "tv.regular_tv_appearance.series",
              "ValueType": "String"
            }
          ],
          "Time": null,
          "Order": {
            "SortOrder": "Ascending",
            "Start": 0,
            "Count": 1,
            "SourceNodeIndex": 0,
            "NodePredicate": "tv.regular_tv_appearance.from",
            "ValueType": "DateTime"
          },
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.0cz5jr",
              "EntityName": "Jeffrey Dean Morgan"
            }
          ]
        }
      ]
    },
    {
      "QuestionId": "WebQTrn-2110",
      "RawQuestion": "where is the country of armenia?",
      "ProcessedQuestion": "where is the country of armenia",
      "Parses": [
        {
          "ParseId": "WebQTrn-2110.P0",
          "AnnotatorId": 2,
          "AnnotatorComment": {
            "ParseQuality": "Complete",
            "QuestionQuality": "Good",
            "Confidence": "VeryLow",
            "FreeFormComment": "?? geolocation or continent?"
          },
          "Sparql": "PREFIX ns: <http://rdf.freebase.com/ns/>\nSELECT DISTINCT ?x\nWHERE {\nFILTER (?x != ns:m.0jgx)\nFILTER (!isLiteral(?x) OR lang(?x) = '' OR langMatches(lang(?x), 'en'))\nns:m.0jgx ns:base.locations.countries.continent ?x .\n}\n",
          "PotentialTopicEntityMention": "armenia",
          "TopicEntityName": "Armenia",
          "TopicEntityMid": "m.0jgx",
          "InferentialChain": [
            "base.locations.countries.continent"
          ],
          "Constraints": [],
          "Time": null,
          "Order": null,
          "Answers": [
            {
              "AnswerType": "Entity",
              "AnswerArgument": "m.02j9z",
              "EntityName": "Europe"
            }
          ]
        }
      ]
    }
  ]
}
